{
  "url": "https://www.hindustantimes.com/india-news/why-ravneet-singh-bittu-modi-s-minister-from-punjab-so-important-to-bjp-sikh-face-with-beant-singh-s-antikhalistan-101770207055221.html",
  "title": "Why Ravneet Bittu, Modis minister whom Rahul called traitor, is so important to BJP: Sikh face with Beant legacy| India News",
  "raw_text": "Ravneet Singh Bittu, a minister in the Modi government, is making national headlines for being called our traitor friend by Congress leader Rahul Gandhi. And for refusing to shake Rahuls outstretched hand. Thats a long way for Bittu, 51, who was brought into active politics by Rahul Gandhi two decades ago. The Gandhi scion wanted Bittu  now touted as a prominent Sikh face by the BJP  to carry forward the legacy of his grandfather Beant Singh, a Congress stalwart who was assassinated in a bomb attack by Khalistani militants in 1995 when he was chief minister of Punjab. Bittu was 20 years old in 1995. He had already lost his father a decade earlier. He became a businessman, and it took until 2007 for him to join active politics, when Rahul Gandhi was attempting a generational shift within the Grand Old Party. Bittu was among Team Rahul's poster boys, winning the Anandpur Sahib Lok Sabha seat in 2009, when Manmohan Singh won a second term as PM, and then Ludhiana, his home district, even amid a Modi wave in 2014 and 2019. Bittus family legacy is intertwined with that of the Congress and Gandhis  his uncle Tej Parkash Singh and cousin Gurkirat Singh Kotli, both former ministers, are still in the Congress  but Bittu switched to the BJP just ahead of the 2024 election. Now a member of the Rajya Sabha, Bittu was made a minister by PM Narendra Modi even after he lost the Ludhiana Lok Sabha seat to state Congress chief Amrinder Singh Raja Warring, an old friend who was among the MPs with Rahul Gandhi as he teased Bittu with a \"traitor friend\" jibe on the Parliaments stairs on Wednesday. Bittu faced the traitor jibe throughout the Congresss 2024 campaign in Ludhiana too. This is something the BJP has latched on to, alleging that the Congress is anti-Sikh for using that adjective for him. The BJP posted on X: Rahul Gandhi calling a Sikh minister a 'traitor' is not an isolated remark. It exposes a deep, disturbing continuity in Congress attitude towards the Sikh community. Let us not forget history. It mentioned the 1984 anti-Sikh riots in Delhi, which followed Rahuls grandmother Indira Gandhis assassination by her Sikh bodyguards over the militarys Operation Blue Star in Amritsars Golden Temple, the shrine that houses Sikhisms temporal seat the Akal Takht, against entrenched militants who were led by preacher Jarnail Singh Bhindranwale. Bittus grandfather Beant Singh became chief minister of Punjab when elections returned in the militancy-ravaged state in the 1990s, and the Congress formed a government. Beant Singh was killed at the violent fag end of the separatist militancy in Punjab. Bittu, too, has faced threats from Khalistani groups and hardline Sikh groups. Even during the 2020-21 farmers protest against the Modi government, when the Congress supported the protesters, Bittu was booed away when he went to express solidarity as he had said Khalistanis were trying to hijack the protest. Sections of Sikh religio-political circles continue to term Beant Singh traitor of the community for alleged police brutality against Sikh militants. Bittu has consistently spoken against Khalistan supporters and defended the Congress governments actions against the militants in the 1990s. It is this anti-Khalistani, nationalist image  with which he defended the Congress for years  that he cited as the ideological common thread that brought him to the BJP. For the Saffron Party, Bittu has emerged as a prominent, albeit mostly urban, face in the Sikh-majority state of Punjab, where the party is hoping to make a mark on its own in the assembly election due within a year. No matter the loss in Ludhiana, Bittu has two ministerial assignments  as MoS with independent charge of food processing, and MoS for railways. He was elected to the Rajya Sabha from BJP-ruled Rajasthan in August 2024. He remains present in the Lok Sabha  as is permitted for ministers  during key debate, mostly within the camera frame when front-row leaders are speaking. And he continues to be active in public meetings and rallies in Punjab. For the BJP, considered a primary Hindu and urban party, Punjab has for long been a difficult electoral turf. Bittu won more votes in large urban areas within the Ludhiana LS segment, when he otherwise lost because the rural vote proved key in the 2024 elections against Congresss Raja Warring. The BJP has, at best, been a junior partner of the Shiromani Akali Dal (SAD). But ever since the SAD broke its alliance with the BJP citing the later-repealed farm laws amid a massive protest in 2020, the party has been experimenting with ideas in parallel  ranging from trying to go it alone, to seeking a re-alliance with Sukhbir Singh Badals SAD, to micro-management of castes and communities. It got a respectable vote share in the 2024 LS election, even more than the SADs, but none of the 13 seats as even the Hindu/urban vote is claimed by the Congress and the states ruling Aam Aadmi Party too. The BJPs concentrated support so far has been in urban-Hindu pockets, including Abohar-Fazilka and parts of Ludhiana in the Malwa region; Pathankot-Batala in Majha; and Hoshiarpur-Jalandhar in Doaba, among others. PM Modis recent visit to Dera Sachkhand at Ballan near Jalandhar was seen as a major outreach to the Ravidassia Dalit community. Dera head Sant Niranjan Dass was picked for the Padma Shri last month. This has underlined how the BJPs top leadership is looking at Punjab, and Bittu remains a key part of that strategy for the party. Rahul Gandhi, however, told Bittu on Wednesday: You will come back, brother. Bittu held up his palm, refused a handshake, and called Rahul and his MPs desh ke dushman, enemies of the nation. Among them was Raja Warring, whose rise in the Congress coincided with that of Bittu, and with whom the Union minister reportedly continues to be friends. Bittu denies any such friendship now, while Warring later said on X, Once a traitor, always a traitor, and noted that the word was used for his leaving the Congress. He further wrote: BJP is using you with an expiry date, Bittu!",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:32.708636"
}