{
  "url": "https://www.hindustantimes.com/india-news/delhi-police-reports-800-missing-in-delhi-in-january-2026-mostly-women-and-minor-101770200898801.html",
  "title": "Over 59 missing daily, 191 minors: 807 reported missing in Delhi in first 15 days of 2026, majority women| India News",
  "raw_text": "Over 800 people have went missing in Delhi, mostly women and minors, averaging 54 people a day in the first half of January this year, a report has said. VIDEO Of the 807 reported missing to Delhi Police, 509 were women and girls, while a total of 191 were minors, a data of Delhi Police, accessed by PTI news agency said. The alarming number, which averages 54 a day, were reported between January 1 and 15. The missing reports have raised severe concerns related to child safety and women's safety in the city. Girls reportedly made up a larger share of the mission people, with 146 missing girls as opposed to 45 boys. A total of 191 minors were reported missing, raising concerns about child safety in the city. Also read: Family alleges apathy as missing teen found dead in Bengaluru, says they were told search on your own The report showed that teenagers formed the bulk of the missing minors, with 169 adolescents reported missing. Of these 169 missing, 138 were girls, and 31 were boys, the report said. The report noted that 13 children aged between 8 and 12 years were reported missing, including eight boys and five girls. Along with this, nine children below the age of eight also went missing. Of these younger children, only six have been traced so far. Also read: Over 500 women among 800 missing in Delhi in first 15 days of 2026, shows police data Adults made up the bulk of missing persons during this period, with 616 cases reported, including 363 women and 253 men. While police have traced 181 adults so far, 435 cases are still unresolved. The data reflects a deeper, long-term pattern in the capital. In 2025, Delhi reported more than 24,500 cases of missing persons, with women making up over 60 per cent of those reported. An analysis spanning the past decade reveals that close to 2.3 lakh people have gone missing in the city, and nearly 52,000 of these cases remain unresolved to date, the report said.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:31.956203"
}