{
  "url": "https://www.hindustantimes.com/india-news/spam-complaints-cross-2-2-million-in-2025-airtel-jio-top-telecom-operators-101770204632131.html",
  "title": "Spam complaints cross 2.2 million in 2025; Airtel, Jio top list| India News",
  "raw_text": "New Delhi: Complaints about spam marketing calls and messages rose to 2.5 million in 2025, from around 850,000 in 2021, according to data tabled in the Lok Sabha on Wednesday by the Department of Telecommunications (DoT), with 1.17 million complaints against Bharti Airtel and 1.07 against Reliance Jio, the two largest telcos in the country. The numbers suggest that spam is a persistent problem for mobile users in India across networks, although the situation could have been worse. The system now automatically blocks large volumes of unwanted communication, the government claimed. In December 2025, an average of more than 75 million calls and messages were blocked every day based on customer preferences, while AI tools flagged over 310 million calls and messages daily as suspected spam. According to McAfees 2026 State of the Scamiverse report for India released Wednesday, Indians receive 13 scam communications on average, everyday, across text, social media, email, phone calls, even malicious QR codes. Also Read: Indians spend 102 hours a year second guessing scam messages, McAfee finds According to a response provided by the minister of state for communications Dr. Pemmasani Chandra Sekhar on Wednesday, Airtel saw complaints rising from around 370,000 in 2021 and Reliance Jio, from around 220,000. Responding to the findings by DoT, Bharti Airtel official told HT that it has deployed AI-based, network-level tools to curb spam and fraud, claiming to have blocked over 70 billion suspected spam calls in the past two years. Citing analysis by the Indian Cyber Crime Coordination Centre under the Ministry of Home Affairs, the company official said financial losses on its network fell 68% and overall cybercrime incidents declined 14%. The official added that it introduced a network-based AI spam detection solution in September 2024 that alerts users in real time about suspected spam calls and messages, and later expanded the system in May 2025 to detect and block malicious links across platforms such as messaging apps, email, and other online services. According to Airtel official, these protections are automatically enabled for all mobile and broadband customers at no additional cost. The government said telecom operators have taken action against repeat offenders by issuing warnings, limiting how many calls they can make, and disconnecting numbers. After directions from the sector regulator, Telecom Regulatory Authority of India (TRAI), around 1.88 million numbers linked to unregistered telemarketers were disconnected in a large enforcement drive. TRAI also imposed penalties of 153.8 crore on telecom companies for not handling spam complaints properly. Also Read:Display International Call for calls from abroad to curb scams: DoT to telecos More than 300,000 businesses and 21,000 telemarketers have been asked to register on a digital platform so their messages can be tracked and verified. For consumers, the regulator said it has made it easier to block or report spam. Users can register their preferences or file complaints through the Do Not Disturb app, their telecom providers app or website, by sending an SMS or calling 1909, or through the governments Sanchar Saathi portal. Promotional calls must come from special numbers starting with 140, and financial service calls from a 1600 series, so people can recognise them more easily. In December 2025, TRAI along with the Reserve Bank of India began a pilot project where a small group of mobile users received SMS alerts from short code 127000 to review and manage the permissions they had given banks to send promotional messages. The messages allowed customers to see, modify or withdraw their consent through a secure link. The government plans to expand this to other sectors and service providers soon.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:31.681850"
}