{
  "url": "https://www.hindustantimes.com/india-news/over-4-000-police-personnel-to-manage-traffic-during-ai-impact-summit-in-delhi-starting-feb-16-101770162057618.html",
  "title": "Over 4,000 police personnel to manage traffic during AI impact summit in Delhi starting Feb 16| India News",
  "raw_text": "Over 4,000 Delhi Traffic Police personnel, including 10 deputy commissioners of police (DCPs), will be deployed to manage traffic during the India Artificial Intelligence (AI) Impact Summit being hosted at Bharat Mandapam in central Delhi from February 16 to 20, at least three senior officials aware of the matter said on Tuesday. The massive personnel deployment is part of a plan where 10 zones will be created in Delhi to handle traffic and minimise impact on commuters. The 10 zones, which will further be divided into 22 sectors, will cover the event venue at Bharat Mandapam, 10 luxury hotels in central and south Delhi where foreign delegates will stay, the Indira Gandhi International (IGI) Airport, and the routes connecting all these locations, the officer said, citing the plan. The officers, who asked not to be identified, said that unlike during the G20 Summit also hosted at Bharat Mandapam in September 2023  when travel and access to the national capital were severely restricted, particularly in the New Delhi district or Lutyens Zone  no such extreme traffic and security curbs would be imposed for the India AI Impact Summit. All schools, offices and business establishments will remain open as usual, the traffic officials said. We are devising the AI Summit-related routes plan in such a way that the traffic restrictions and diversions will not impact the movement on other vehicles, including buses and four-wheelers carrying school children. The process of identifying and earmarking alternate routes for such vehicles is in progress. Our objective is to ensure minimum inconvenience to the public on roads during the event, said additional commissioner of police (traffic) Dinesh Kumar Gupta, who is the in-charge for the AI Summit traffic arrangements plan. According to the traffic plan, seen by HT, areas in and directly around Bharat Mandapam  the summit venue near Pragati Maidan  have been divided into two traffic zones, marked Zone 1 and Zone 2, and four traffic sectors labelled A, B, C and D. Each zone will be headed by a DCP, while an assistant commissioner of police (ACP) will be deputed to oversee each sector. The ACP will be assisted by one traffic inspector (TI) and multiple zonal officers (ZOs) of sub-inspector (SI) and assistant sub-inspector (ASI) ranks. Meanwhile, IGI Airport and the routes leading to Dhaula Kuan via National Highway-10 have been categorised as Zone 9 and Zone 10 and divided into five sectors named R, S, T, U and V. The remaining six traffic zones and nine sectors will cover the 10 hotels and routes identified for VVIP movement between the hotels and Bharat Mandapam. Taj Palace, ITC Maurya, The Leela Palace, The Imperial, Le Meridien, Hyatt Regency, The Ashok, The Claridges, Taj Mahal and The Oberoi have been confirmed so far as the place of stay for foreign delegates. If more hotels are added after confirmations of additional heads of state, we will make necessary changes to the route plan. As of now, heads of state from 15 countries have confirmed participation, said one of the officers cited above. According to the officer, Sardar Patel Marg, Shanti Path, Teen Murti Marg, Gol Methi, Prithviraj Road and C-Hexagon  known better as the India Gate Circle  will be the key routes for VVIP movement during the event. Apart from the 22 ACPs heading traffic sectors, one ACP will be present in the pilot vehicle of each foreign delegates motorcade. One traffic inspector will act as the warning officer in each motorcade. The warning officers job will be to ensure a clear passage for the motorcade, for which announcements will be made using the public address system installed in the official vehicle, the officer added. Briefings of traffic police officials, outlining the traffic arrangement plan and detailing duties and responsibilities during the event, have started at Bharat Mandapam from Monday, the officer said. The AI Impact Summit is set to be one of the largest global gatherings on artificial intelligence. Prime Minister Narendra Modi is scheduled to inaugurate the event on February 19 and host a CEOs roundtable, while a gala dinner for participating heads of state is planned for February 18. More than 100 global CEOs and over a dozen heads of state have confirmed their participation so far, HT had reported earlier. Confirmed attendees include Microsoft co-founder Bill Gates, Nvidia CEO Jensen Huang, Google CEO Sundar Pichai, Anthropic CEO Dario Amodei, Google DeepMind CEO Demis Hassabis, Reliance Industries chairman Mukesh Ambani, Infosys chairman Nandan Nilekani, Cisco president Jeetu Patel and Adobe CEO Shantanu Narayen, among others.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:20.264951"
}