{
  "url": "https://www.hindustantimes.com/india-news/par-panel-flags-train-punctuality-drop-from-90-pc-in-2021-22-to-73-62-pc-in-202324-101770206103062.html",
  "title": "Par panel flags train punctuality drop from 90 pc in 2021-22 to 73.62 pc in 2023-24| India News",
  "raw_text": "New Delhi, The punctuality of trains declined from 90 per cent in 2021-22 to 73.62 per cent in 2023-24, a parliamentary committee observed, while questioning the Indian Railways' \"misleading\" method of recording train timings. The Public Accounts Committee of Parliament, in its report \"Punctuality and Travel Time in Train Operations in Indian Railways\", presented to the Lok Sabha on Wednesday, examined the punctuality performance of all types of trains and recommended several measures to improve it. It noted that train punctuality stood at 77.51 per cent in 2015-16, compared to 69.23 per cent in 2018-19, before improving significantly to 90.48 per cent in 2021-22. The Committee further observed that punctuality performance again declined to 73.62 per cent in 2023-24, before showing some improvement to 78.67 per cent in 2024-25 . Questioning the methods of recording punctuality, the report said, \"The Committee notes from audit observation that IR measures the punctuality of trains at the terminating stations. Whereas, in other countries, it is measured at the originating point, intermediate station, and at terminating stations.\" \"Besides, for measuring punctuality, IR provides an allowance of 15 minutes delay with reference to the scheduled time,\" it added. According to the report, the Committee also noted that global best practices for measuring punctuality reflect a much stricter threshold, as the yardstick in Japan is in seconds, and a train arriving before the scheduled time is also considered a punctuality loss. \"The Committee are of the view that this narrow approach to punctuality monitoring fails to account for delays experienced enroute, leading to an incomplete and often misleading picture of actual train performance,\" the report said. \"The existing allowance of a 15-minute delay within Indian Railway's punctuality benchmark further dilutes the accuracy of performance assessment\", it added. Though the Committee acknowledged the launch of high-speed trains like Vande Bharat and technologically advanced coaches, it stated that the bulk of the Indian Railways network is catered to by normal express, superfast and passenger trains. The Committee recommended that the Indian Railways review and revise time punctuality assessment through integrated monitoring at originating / intermediate stations alongside the existing termination station. Talking about the Indian Railways initiative \"Mission Raftaar\" launched in 2016-17 with an aim to double the average speed of freight trains from 25 Kmph to 50 Kmph and Mail/Express from 50 Kmph to 75 Kmph by the end of 2021- 22, the committee noticed that the average speed of Mail/Express Trains and Goods Trains was only improved to 50.6 kmph and 23.6 kmph, respectively. Reviewing steps taken by the Ministry to improve the average speed/maximum speed of trains, it found that the lack of an integrated approach involving all zonal railways is proving a hindrance in this regard. \"Therefore, the Committee recommend the Ministry to prepare a plan encompassing zonal Railways to achieve the desired increase in the average and maximum speed of Passenger and Freight trains in their network and strive to achieve it without compromising safety,\" the report said. It also appreciated the effectiveness of the EMU/MEMU trains introduced by the Indian Railways and recom mended that the exercise of conversion of passenger trains into DEMU and MEMU may be expedited in order to obtain optimum speed and be applied to all passenger trains across all the railway zones. \"The Committee desire that Indian Railways should adopt new/modern technological tools/systems to improve speed, reduce delay and capture the data,\" the report said, suggesting a holistic mechanism for real-time monitoring of train movements. Regarding the operations of the freight trains, the Committee noted that despite several efforts, the Indian Railways has not been able to incorporate Goods Train paths in their Working Time Tables to have a proper schedule for running of goods trains. It urged the Ministry to address the issues through a multi-pronged strategy in order to streamline the running of freight trains in a coordinated and time-bound manner. \"The Committee notes that, as per ICMS data, which captures all the incidents that caused the train operations' delay, out of 33 factors responsible for punctuality loss, 27 factors are controllable by Railways, and the remaining six factors are external factors,\" the report said. It added, \"The total contribution of external factors for the two years was 12.89 per cent. The internal factors, which contributed to 66 per cent, could have been controlled well by IR but were not addressed adequately.\" This article was generated from an automated news agency feed without modifications to text.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:32.316486"
}