{
  "url": "https://www.hindustantimes.com/india-news/gen-naravane-on-why-he-wrote-memoir-4-stars-of-destiny-now-at-centre-of-rahul-bjp-row-over-galwan-china-border-101770212085050.html",
  "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
  "raw_text": "A book by General MM Naravane, Indias former Chief of Army Staff (COAS), has dominated Parliament proceedings this week, with Leader of Opposition Rahul Gandhi being stopped from citing its contents to question PM Narendra Modi and his government over their China policy. Its not published, so cant be cited, according to Rajnath Singh, who heads the defence ministry where its reportedly pending for approval since 2023. General Naravane has not spoken amidst this row. But he has spoken before about the book, Four Stars of Destiny, and lamented the ongoing delay in approval. He has also shared how he decided to write it at all. There is a story behind writing this book. I had no intention of writing a memoir or an autobiography, he told web channel Lallantop in an interview in April 2025, a year after the book was originally supposed to be published. Penguin (publishing house) had published a book on the late General Bipin Rawat. I went to its book release in March 2023. People who had come from Penguin, jokingly I told them that you aren't publishing a book of mine. In response, they asked, Have you written a book? I said no, he recalled. I told them, If you say so, I will write it, to which they said, Yes sir, it will be a matter of pride if you give us this opportunity to publish your book, the retired officer said. And like that, by the way, this process started for me to write a book. He said the satisfaction he has got by writing the book is enough. At a literary festival in the hill station of Kasauli six months later, in October 2025, Gen Naravane again said he had done his job by writing, and now it is between the publisher and the Ministry of Defence. In the earlier interview, though, he also expressed disappointment at the delay, when asked about books by former top army officers being stopped or halted. Everyone has a span of information control. Being in the position of Army Chief, you would know about your service, but (not) how it impacts other ministries, foreign relations with different countries... Therefore, when a book is written, if a review is needed, then perhaps it is a necessity so that, from the perspective of the country's overall national security, there isn't something in it that spoils our relations with other countries, he argued. There is nothing wrong with a review; it must happen so that some point does not come out inadvertently, he said, but added, However, it would be better if there were a fixed time limit; it shouldn't take 15 months to review any one book. In Kasauli later, he was reportedly more poetic as he remarked, I think it is maturing, like aged wine. The longer its there, it becomes more and more vintage; of greater value. Four months on, the unpublished book entered national consciousness as Rahul Gandhi brought to the Lok Sabha an article in The Caravan magazine that quotes the books excerpts. Gen Naravane has not disputed the excerpts. Defence minister Rajnath Singh has, however, said that the book is held up because its contents are not factually correct, arguing why General Naravane has not gone to court if the facts in the book are correct. A printed copy of the book made an appearance on Wednesday when Rahul Gandhi flashed it to cameras in the Parliament complex: See, it exists  the book the government says does not.\" The Congress top leader further said, I don't think PM (Narendra Modi) will have the guts to come to the Lok Sabha today, because if he comes I'm going to give him this book. Rahul Gandhi claimed the former army chief wrote that when he informed Rajnath Singh and other leaders, including NSA Ajit Doval, about Chinese tanks approaching, he got no direct reply for a long time. And then he writes that the PMs message conveyed to him was, Jo uchit samjho, woh karo (Do what you think is right)... This means Narendra Modi ji did not fulfil his responsibility; effectively telling the army chief to handle it as he could not decide, the Congress leader said, speaking in Hindi. Gandhis insistence on quoting a part about the 2020 border tensions with China from the unpublished book has stalled the Lok Sabha since Monday, February 2, when Parliament took up for discussion the Motion of Thanks to the Presidential Address for the Budget Session. Rajnath Singh and others allegedly named in the book have not responded to the express allegations. Earlier, Rajnath Singh and other leaders asserted in the Lok Sabha that quoting from a book thats not been published is not just against Parliaments rules but also against national interest and harms national security. Speaker Om Birla agreed with their contention about rules. Rajnath also said, (Rahul Gandhi) should present the book that he is claiming to quote from. I want to see it; this House wants to see it. Rahul Gandhi may have held up a printed copy but General Manoj Mukund Naravane's memoir 'Four Stars of Destiny' has indeed never been available for the public to buy or access. It was supposed to be published in April 2024, as per pre-order announcements made in late 2023 by the publisher, Penguin. Amazon still has a listing that says in the price section: Currently unavailable. We don't know when or if this item will be back in stock. It is considered standard practice for books by former senior military officials to undergo scrutiny to check for sensitive material, but General Naravanes book drew controversy for reportedly revealing discussions on issues such as the Agnipath scheme and the Galwan clash in which 20 Indian soldiers were killed in a fight with the Chinese. Gen MM Naravane served as Indias Chief of Army Staff from December 2019 to April 2022. The books Amazon and Flipkart listings say it has 448 pages. The description reads: \"From his first encounter with the Chinese as a young officer in Sikkim to dealing with them in Galwan when he was Chief, from daily incidents of firing across the LC to implementing a ceasefire with Pakistan, General Naravane takes us through his distinguished career spanning over four decades that saw him serve in all corners of the country.\" As for Naravane's other book, military thriller The Cantonment Conspiracy, that was published in March 2025.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:33.090674"
}