{
  "url": "https://www.hindustantimes.com/india-news/gold-silver-rate-today-live-update-mcx-gold-price-today-mcx-silver-price-today-4-feb-2026-latest-news-101770172702389.html",
  "title": "Gold, silver rates: Check Feb 4 prices in Delhi, Mumbai, Bengaluru| India News",
  "raw_text": "Updated on: Feb 04, 2026 5:10:08 PM IST Gold, silver rate today LIVE: Check latest Gold and Silver prices on Wednesday. MCX Gold, Silver rates Feb 4: The price of Gold on Wednesday stood at 153440 (24 K, 10 gram) and of Silver was registered at 316900 (1 kg) Check the latest prices in major cities:Cities24-k gold (10g)22-k gold (10g)Silver (per 10g)Delhi 1,54,220 141,390 2,969Bengaluru 1,54,050 141,220 2,909Chennai 1,55,790 142,820 3,139Hyderabad 1,53,310 140540 3159Mumbai 1,54,080 141,250 2,959Kolkata 1,54,060 141,230 2,919Pune 1,54,100 141,270 2,979Why should you invest in gold?Gold is considered a safe and reliable mode of investment. It acts as an excellent hedge against inflation. It is also an excellent portfolio diversifier.Why should you invest in silver?There are several reasons to invest in silver. Being a precious metal, it is always in demand in India's jewellery markets. Since there is a huge demand for silver, the availability of the metal is dropping. In future, the prices will rise, resulting in profit for the investors who put their money into the metal now. Another important fact is that silver is cheaper than gold. Top pointsGold prices in India today: 24-carat gold stood at 1,53,440 per 10 grams, while 22-carat gold was priced at 1,40,670 per 10 grams.Silver prices in India today: Silver was trading at 3,160 per 10 grams on Wednesday.Gold prices in major cities: 24-carat gold was priced at 15,32,700 in Delhi, 15,33,000 in Mumbai, 15,32,700 in Bengaluru, and 15,33,200 in Pune.Silver prices in major cities: Silver stood at 31,690 per 10 grams in Delhi, 31,590 in Mumbai, 31,090 in Bengaluru, and 31,790 in Pune.Gold rates globally: Gold rose for a second consecutive day on Wednesday, rebounding above $5,000 an ounce as dip buyers returned following a historic fall from record highs. There are several reasons to invest in silver. Being a precious metal, it is always in demand in India's jewellery markets. Since there is a huge demand for silver, the availability of the metal is dropping. In future, the prices will rise, resulting in profit for the investors who put their money into the metal now. Another important fact is that silver is cheaper than gold. There are several reasons to invest in silver. Being a precious metal, it is always in demand in India's jewellery markets. Since there is a huge demand for silver, the availability of the metal is dropping. In future, the prices will rise, resulting in profit for the investors who put their money into the metal now. Another important fact is that silver is cheaper than gold. Follow all the updates here: Feb 04, 2026 5:09:18 PM IST Feb 04, 2026 3:52:38 PM IST Gold price in Delhi on Wednesday afternoon stood at 1,54,220 per 10 grams for 24 karats, increasing slightly than previous day's rates. Feb 04, 2026 2:49:04 PM IST Gold, silver rates today LIVE updates: In Hyderabad, 22-carat gold is priced at 1,41,260 and 24-carat gold at 1,54,090 per 10 grams, while silver is selling at 3,15,900 per kilogram. Feb 04, 2026 2:46:33 PM IST Gold, silver rates today LIVE updates: In Pune, gold rates stand at 1,41,270 for 22-carat and 1,54,100 for 24-carat per 10 grams, with silver priced at 2,97,900 per kilogram. Feb 04, 2026 2:40:26 PM IST Gold, silver rates today LIVE updates: In Kolkata, the 22-carat gold rate is 1,41,230 and 24-carat gold is priced at 1,54,060 per 10 grams, while silver costs 2,91,900 per kilogram. Feb 04, 2026 2:33:48 PM IST Gold, silver rates today LIVE updates: In Mumbai, gold is priced at 1,41,250 for 22-carat and 1,54,080 for 24-carat per 10 grams, while silver stands at 2,95,900 per kilogram. Feb 04, 2026 1:57:41 PM IST Silver Rate Today LIVE updates: Silver rates in the national capital declined noticeably. Silver is at 2,96,900 per kg, down 20,000 on Wednesday. Feb 04, 2026 1:56:29 PM IST Silver Rate Today LIVE updates: Chennai remained stable amid broader weakness in silver prices. Silver is priced at 3,13,900 per kg, with no change. Feb 04, 2026 1:42:55 PM IST Silver prices in Bengaluru saw a sharp fall on Tuesday. Silver is trading at 2,90,900 per kg, down 20,000. Feb 04, 2026 1:15:20 PM IST MCX Gold Rate Today LIVE updates: Gold prices in Kolkata followed the broader upward trend. 24-carat gold is selling at 1,54,060 per 10 grams, higher by 780. Feb 04, 2026 1:14:24 PM IST MCX Gold Rate Today LIVE updates: Gold rates in the national capital moved up marginally. 24-carat gold stands at 1,54,220 per 10 grams, up 780. Feb 04, 2026 1:13:30 PM IST MCX Gold Rate Today LIVE updates: Chennai recorded a stronger surge compared to other metros. 24-carat gold is priced at 1,55,790 per 10 grams, gaining 3,510. Feb 04, 2026 1:12:05 PM IST MCX Gold Rate Today LIVE updates: Gold prices in Bengaluru climbed on Tuesday. 24-carat gold is trading at 1,54,050 per 10 grams, up 780. Feb 04, 2026 12:20:40 PM IST MCX Gold Rate Today LIVE updates: MCX silver gained 14,448, or 5.39%, trading at 2,82,463 per kilogram. Feb 04, 2026 12:18:01 PM IST MCX Gold Rate Today LIVE updates: MCX gold was trading higher by 5,883, or 3.82%, reaching 1,59,692 per 10 grams. Feb 04, 2026 12:02:07 PM IST Silver, gold rate today LIVE updates:Gold prices extended gains on Wednesday on safe-haven appeal, as renewed geopolitical tensions between the U.S. and Iran added to the yellow metal's recent upswing that saw it mark its best day since 2008 in the previous session. Spot gold gained 2.7% to $5,071.79 per ounce as of 0353 GMT, after surging 5.9% on Tuesday, its biggest daily gain since November 2008. Bullion scaled a record high of $5,594.82 last Thursday. U.S. gold futures for April delivery climbed 3.2% to $5,092.0 per ounce. \"Gold has climbed back about the key $5,000 level, ... (as) geopolitical tensions have lifted the metal's safe-haven appeal after U.S. forces downed an Iranian drone,\" said Jigar Trivedi, a senior research analyst at IndusInd Securities. (Reuters) Feb 04, 2026 11:57:48 AM IST Silver, gold rate today LIVE updates: The US stock market is losing ground amid mixed trading on Tuesday, while gold and silver bounce back from their latest sell-off. The S&P 500 slipped 0.9 per cent and fell further from its all-time high set last week, even though the majority of stocks within the index rose. The Dow Jones Industrial Average was down 189 points, or 0.4 per cent, as of 12:20 pm eastern time, and the Nasdaq composite was 1.6 per cent lower. Several influential Big Tech stocks weighed on the market, including drops of 3.3 per cent for Nvidia and 2.9 per cent for Microsoft. They helped drown out a 6.5 per cent climb for Palantir Technologies, which reported bigger profit for the latest quarter than analysts expected. Its forecast for 61 per cent growth in revenue this year also topped analysts' expectations. The action was stronger, again, in metals markets. Gold's price climbed 6.8 per cent to USD 4,970.40 per ounce in its latest swing since its jaw-dropping rally suddenly halted last week. Silver's price, which has been whipping through even wilder moves, leaped 11.6 per cent. (AP) Feb 04, 2026 11:56:48 AM IST Silver, gold rate today LIVE updates: MSCI's global equities gauge was barely changed on Tuesday as technology stocks pushed Wall Street lower while oil futures rallied after incidents between the United States and Iran and precious metal prices rose to regain some lost ground following a two-day rout. While diplomats were seeking to arrange nuclear talks between Iran and the United States, oil prices climbed more than $1 after the U.S. military shot down an Iranian drone approaching a U.S. aircraft carrier in the Arabian Sea, according to a Reuters report citing a U.S. official. Separately, Iranian gunboats approached a U.S.-flagged tanker in the Strait of Hormuz, maritime sources said. Meanwhile, the U.S. dollar was slightly lower after two sessions in a row of gains while the Australian dollar was the standout performer in foreign exchange markets on Tuesday after the central bank joined Japan as the only developed world economy to raise interest rates. Investor anxiety rose with choppy trading in the CBOE volatility index, which picked up steam early on but in the late afternoon it pulled back from its 20.37 session high to close up 1.66 points at 18. (Reuters) Feb 04, 2026 11:53:38 AM IST Silver, gold rate today LIVE updates: MCX silver for March futures opened higher by 10,000, or 3.73%, at 2,78,015 per kilogram, up from its previous close of 2,68,015. The white metal surged as much as 6% during intraday trading, reaching a high of 2,84,094. At the time, MCX silver was trading 12,191, or 4.55% higher, at 2,80,206 per kilogram, Mint reported. Feb 04, 2026 11:51:07 AM IST Silver, gold rate today LIVE updates: The MCX gold rate traded higher by 5,883, or 3.82%, reaching 1,59,692 per 10 grams. Meanwhile, the MCX silver price rose by 14,448, or 5.39%, to 2,82,463 per kilogram, as per Groww. Feb 04, 2026 11:36:17 AM IST Silver, gold rate today LIVE updates: The gold rate in Chennai is 1,55,790 (24K, 10 gram) Feb 04, 2026 11:34:34 AM IST Silver, gold rate today LIVE updates: Here's a list of 24K gold, and silver prices today: Mumbai 24K Gold per 10 gm: 1,54,080 Silver per kg: 2,95,900 Delhi 24K Gold per 10 gm: 1,53,440 Silver per kg: 3,16,900 Kolkata 24K Gold per 10 gm: 1,53,280 Silver per kg: 3,11,900 Bengaluru 24K Gold per 10 gm: 1,53,270 Silver per kg: 3,10,900 Chennai 24K Gold per 10 gm: 1,52,280 Silver per kg: 3,13,900 Pune 24K Gold per 10 gm: 1,53,320 Silver per kg: 3,17,900 Feb 04, 2026 11:08:19 AM IST Gold, silver rate today LIVE updates: As mentioned earlier, 24 karat of gold is called pure gold with a purity of 99.99 per cent. It is liquid in the state and cannot be moulded to make bars, jewellery etc. As a result, it is mixed with other metals like copper and zinc to form an alloy. For example, 22K gold is a mix of 22 parts of gold. Feb 04, 2026 10:56:16 AM IST Gold, silver rate today LIVE updates: Gold prices in India are determined on several factors including currency, global demand, interest rates and government policies. If the rupee slides against the US dollar in India, gold will become expensive. Feb 04, 2026 10:55:51 AM IST Gold, silver rate today LIVE updates:India is the largest importer of gold, which mainly caters to the demand of the jewellery industry. In volume terms, the country imports 800-900 tonne of gold annually. Feb 04, 2026 10:55:27 AM IST Gold, silver rate today LIVE updates: Gold is traded in the form of bars, coins, bullions, jewellery, exchanges, exchange trade funds etc Feb 04, 2026 10:54:59 AM IST Gold, silver rate today LIVE updates: Gold is considered as a safe and reliable mode of investment. It acts as an excellent hedge against inflation. It is also an excellent portfolio diversifier Feb 04, 2026 10:54:23 AM IST Gold, silver rate today LIVE updates: Feb 04, 2026 10:42:49 AM IST Gold, silver rate today LIVE updates: Here are the top points: Feb 04, 2026 10:40:57 AM IST Gold, silver rate today LIVE updates: Here's the latest prices Feb 04, 2026 10:38:51 AM IST MCX Silver, Gold rates today LIVE: Strong gains made in January came under pressure early this week after the dollar jumped on reports that Donald Trump had chosen Kevin Warsh to lead the Federal Reserve. Analysts said Warsh, seen as the most hawkish option and a former Fed governor, could steer central bank policy in a way that strengthens the US dollar. (AFP) Feb 04, 2026 10:37:30 AM IST Gold, silver rate today LIVE updates: The price of gold has risen to 1,54,050 (24 carat, 10 gram) Feb 04, 2026 10:33:36 AM IST Gold, silver rate today LIVE updates: Yes, the prices of Gold have increased in Delhi today. Feb 04, 2026 10:24:55 AM IST Gold, silver rate today LIVE updates: The purity grade of fine silver is either 999.9, 999.5 or just 999. For silver alloys, jewellery and artefacts, the purity grade is 970, 925, 900, 835, 800v Feb 04, 2026 10:22:00 AM IST Gold, silver rate today LIVE updates: Gold rose for a second day, rebounding above $5,000 an ounce as dip buyers snapped up precious metals following a historic collapse from record highs. Bullion climbed as much as 2.1% in early trading, after a gain of more than 6% in the previous session, as a risk-on tone returned to markets and the US dollar weakened. At the close on Tuesday, gold was around 12% below an all-time high hit on Jan. 29  but was still up nearly 15% for the year. Silver also advanced. Forced sales have likely run their course in precious metals, Daniel Ghali, a senior commodity strategist at TD Securities, said in a note. The intense volatility over the last week could certainly keep retail participants on the sidelines, removing an increasingly important cohort of buyers, he said. Precious metals soared last month in a rally underpinned by speculative momentum, geopolitical upheaval and concerns about the Federal Reserves independence. However, market watchers had warned that the advances had been too large and too swift. The surge came to a sudden halt at the end of last week, with silver seeing its biggest daily drop on record and gold plunging the most since 2013. (Bloomberg) Feb 04, 2026 10:20:21 AM IST Gold, silver rate today LIVE updates: Silver can be purchased from banks, jewellers and online agents in India. The banks charge higher rates due to purity checks and assurance provided by them. The jewellers offer different products based on the weight. Silver can also be bought online with a number of companies providing a platform for online purchase. Feb 04, 2026 10:19:19 AM IST Gold, silver rate today LIVE updates: K or karats is a term used to measure the purity of gold. In simple words, 24K gold is also called pure gold and has 99.9 per cent purity. It does not contain traces of other metals. On the other hand, 22K gold comprises 22 parts of gold mixed with two parts of other metals like copper and zinc. It is harder than 24K gold due to presence of other metals. It is suited for making jewellery. Feb 04, 2026 10:18:42 AM IST Gold, silver rate today LIVE updates: India is the largest importer of gold, which mainly caters to the demand of the jewellery industry. In volume terms, the country imports 800-900 tonne of gold annually. Feb 04, 2026 10:18:16 AM IST Gold, silver rate today LIVE updates:Gold is traded in the form of bars, coins, bullions, jewellery, exchanges, exchange trade funds etc Feb 04, 2026 10:16:46 AM IST Gold, silver rate today LIVE updates:Silver also recovered losses by jumping 9.2% to $86.7 an ounce on Tuesday globally after crashing 27% on Friday and slipping another 6% on Monday. Feb 04, 2026 10:16:10 AM IST Gold, silver rate today LIVE updates:The price of silver in Chennai today is 300 per gram and 3,00,000 per kilogram. Feb 04, 2026 10:08:19 AM IST Gold, silver rate today LIVE updates: The price of silver in Delhi today is 3169 0.00 per 10 gram. Load More",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:26.055396"
}