{
  "url": "https://www.hindustantimes.com/india-news/china1-strategy-to-play-out-fully-nirmala-sitharaman-after-india-us-deal-sealed-what-is-it-101770174190763.html",
  "title": "'China+1 strategy' to play out fully: Sitharaman after India-US deal sealed. What is it?| India News",
  "raw_text": "The China+1 strategy will play out, finance minister Nirmala Sitharaman asserted in an interview to HT recently as she spoke about a trade deal India and the US sealed on Monday, bringing down tariffs on Indian imports to 18%. The trade pact not only reduces US tariffs on Indian imports but also brings months of tense trade negotiations between both countries to an end. Sitharaman has expressed hope that the deal would come as a big relief to Indian exporters, now that they stand at an advantage compared to their rivals. It is a very welcome move and will be a big relief to our exporters, Sitharaman said. She also said that the recently-concluded talks on trade between India and the US would pave way for the China+1 strategy to fully play out. China+1 is a strategy aimed at getting businesses to reduce reliance on China and expand their investment fields to other countries. The term was coined back in 2013 after witnessing an overconcentration of global businesses in China, largely driven by the country's low manufacturing costs. In simple terms, the strategy aims to have businesses add at least one more country apart from China to their investment pool. According to an earlier Business Standard report, a grouping of 18 global economies, including India, had come together under this supply-chain diversification strategy. Other countries seen as popular +1 destinations are Thailand, Vietnam and Indonesia, among others. According to the finance minister, the India-US trade deal could make way for the China+1 strategy to fully play out. Speaking to HT about the Indian currency's weakness despite India's foreign exchange reserves breaching the $700 billion mark, Sitharaman said: Then why is the Rupee becoming weaker? Because our capital inflows are reducing. Why are capital inflows reducing? Some people have exited after booking profits, but why have they not come in? We have to convince large fund managers to come in -- but this is a problem facing not just us, but others as well. She further expressed hope that the India-US trade deal could turn the tide. But after last nights conversation, I think things will change. You will see the China+1 strategy play out fully now, she said. The US tariffs on India have now been reduced to 18%, down from 50% that was imposed by Donald Trump. Half of these duties were imposed as penalties for India doing oil trade with Russia. Trump now says that Prime Minister Narendra Modi has assured him that New Delhi would stop the oil trade with Moscow, a claim not yet confirmed by Indian authorities. There has also not been any official clarity on Trump's claim that India has committed to buying more than $500 billion worth of American energy, technology, agricultural products, coal and other goods.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:24.594032"
}