{
  "url": "https://www.hindustantimes.com/india-news/3-minor-girls-jump-off-ghaziabad-building-were-addicted-to-korean-mobile-game-101770178218788.html",
  "title": "3 Ghaziabad sisters, 'obsessed with Korean mobile game', die by suicide| India News",
  "raw_text": "A 16-year-old girl and her two half-sisters, aged 14 and 12, died after allegedly jumping from the ninth floor of a high-rise in Ghaziabad, police said on Wednesday, and added that they were \"highly addicted\" to an online Korean game and obsessed with gaming on their mobile phones. Police said the three lived with their father, a forex trader, and their mothers. They added that the eldest was born to the trader's first wife, while the younger two were born to the second wife. Around 12.30am on Wednesday, all three were with their mothers. After some time, they went to the puja room and locked it from inside. Thereafter, they used a chair to jump out of the window one by one. They all died on the spot. The guards and locals on the ground floor woke up hearing the loud noise of girls falling, and even their family members on the ninth floor woke up. Police were informed, and bodies were sent for autopsy, said assistant police commissioner Atul Kumar Singh. Police said they will analyse the girls' mobile phones and seek details about the game they were obsessed with. The girls left behind a lot of notes in a diary and stated that they were sorry, and also made a crying caricature. They were highly obsessed with the game and thought that they were not Indians, but Koreans. They also portrayed themselves as Korean princesses under the influence of the game,\" said Singh. \"It is an online task-based game that they were addicted to. They were not attentive to their studies... the 16-year-old was still studying in class 4. This situation developed after the Covid-19 pandemic...they got addicted to online gaming.\" Police said that their family knew about their addiction and would snatch their mobiles. The girls would get them back. They followed a daily life routine together; even went to the bathroom together. Their diary left behind has a lot of details about their lifestyle and their obsession with the task-based game, said Singh. Discussing suicides can be triggering for some. However, suicides are preventable. A few major suicide prevention helpline numbers in India are 011-23389090 from Sumaitri (Delhi-based) and 044-24640050 from Sneha Foundation (Chennai-based).",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:25.306142"
}