{
  "url": "https://www.hindustantimes.com/india-news/2-jaish-terrorists-killed-ak-47-m4-carbine-seized-in-operation-kiya-in-jk-udhampur-encounter-101770191458292.html",
  "title": "2 Jaish terrorists killed, AK-47, M4 Carbine seized: What to know about 'Operation Kiya' in J&amp;K's Udhampur| India News",
  "raw_text": "Two terrorists were gunned down two terrorists in a security operation - named Operation Kiya - in Jophar area of Jammu and Kashmir's Udhampur, officials said on Wednesday. Both terrorists have been identified as commanders of Jaish-e-Mohammad terror outfit. While the identity of one - Mavi - was ascertained, that of the other was yet to be verified. An AK-47 and an M4 carbine were recovered from the neutralised terrorists, with whom contact was established on Tuesday. Indian Army corps White Knight said in a post on X that the operation was launched based on specific intelligence inputs provided by Jammu and Kashmir Police, troops of CIF Delta. White Knight Corps planned and executed a focused joint counter-terror operation in the general area of Jophar forest, Basantgarh, in coordination with J&K Police and the Central Reserve Police Force (CRPF). The forces cordoned off the targeted area, to prevent escape of terrorists. Contact with terrorists was established yesterday and since then, terrorists were prevented from breaking contact. Following a calibrated and coordinated response, two terrorists have been successfully neutralised. The operation highlighted seamless inter-agency coordination, tactical precision and high standards of professionalism, the post stated. Operation was concluded successfully, it said, adding that the area remains under surveillance. The encounter between terrorists and security forces broke out in Jophar area at around 4 pm on Tuesday. Around 4 pm, an encounter broke out between armed terrorists, believed to be two to three in numbers, and security forces in Jophar area, a densely forested area, 25 kms from Ramnagar tehsil, an earlier HT report quoted a police officer as saying. He informed that additional reinforcements were rushed to the area. The Army had also shared the information on X. In an intelligence based joint Operation, contact has been established with the terrorists by the Troops of CIF Delta, #WhiteKnightCorps, @JmuKmrPolice and #CRPF at around 4 pm today in the general area of Basantgarh. Cordon has been established. Firefight is on. Operation is in progress, it states. Parallelly, security forces continued with their searches in Kishtwar districts Chatroo area to trackdown a group of three to four Jaish terrorists.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:28.140194"
}