{
  "url": "https://www.hindustantimes.com/india-news/parliament-face-off-rahul-gandhi-calls-ex-aide-ravneet-bittu-traitor-bjp-hits-back-101770202111341.html",
  "title": "Parliament face-off: Rahul Gandhi calls ex-aide Ravneet Bittu traitor; BJP hits back| India News",
  "raw_text": "Leader of opposition Rahul Gandhi and Union minister Ravneet Singh Bittu were involved in a sharp verbal confrontation outside the Parliament complex on Wednesday, after Gandhi referred to his former aide as a traitor, triggering a political spat that later drew in the Bharatiya Janata Party (BJP). VIDEO The exchange took place when the two leaders crossed paths near Parliament. Pointing towards Bittu, who is currently the minister of state for railways, Gandhi remarked, Here is a traitor walking right by. Take a look at his face. Referring to Bittus exit from the Congress in 2024 to join the BJP, Gandhi added, Hello brother, my traitor friend. Dont worry, you will come back (to Congress), while extending his hand for a handshake. Bittu, however, refused to shake hands with Gandhi. Later reacting to the remarks, he accused the Congress of believing it alone represented patriotism. They [Congress] think that they are the biggest patriots, Bittu said, alleging that Congress leaders considered themselves kings of the country. Bittu also brought up historical grievances, saying the Congress accorded former Prime Minister Rajiv Gandhi the status of a martyr after his assassination in 1991, but did not extend the same recognition to his grandfather, Sardar Beant Singh. Beant Singh, a Congress leader and former Punjab chief minister, was assassinated by a suicide bomber in 1992 during the period of intense counter-insurgency operations against Sikh militancy. In a subsequent statement to the press, Bittu said he had refused to shake hands with Gandhi because, in his view, the Congress party and the Gandhi family were enemies of the country and murderers of Sikhs. He cited Operation Blue Star, the 1984 military action ordered by then Prime Minister Indira Gandhi at the Golden Temple to flush out militant leader Jarnail Singh Bhindranwale. Our biggest and most holy Gurudwara, Guru Granth Sahib ji, was shot at. Punjabis and Sikhs were murdered, our sisters and mothers were murdered, Bittu said. The BJP later rallied behind Bittu, with three Sikh leaders  Union Minister Hardeep Singh Puri, Manjinder Singh Sirsa and Arvinder Singh Lovely  holding a press conference to condemn Gandhis remarks. Puri said, This mindset is troubling. I can understand that Rahul Gandhi, the Leader of the Opposition, may be upset that Bittu ji was in his party and then left it. If he wants to express his anger, he could say, My friend, my long-lost friend, you will come back. But instead, calling someone a traitor and saying you will come back is unacceptable. Separately, later in the day, Gandhi escalated his criticism of the BJP and the Prime Minister. Speaking to reporters in the Parliament House complex, he accused Prime Minister Narendra Modi of failing to fulfil his responsibility during the 2020 India-China standoff in the Kailash Range. Gandhi referred to an unpublished memoir by former Army chief General Manoj Mukund Naravane, which he said he had been disallowed from reading in Parliament since Monday. I dont think the PM will have the guts to come to the Lok Sabha today, because if he comes, I am going to give him this book, Gandhi said, adding that the memoir would help the Prime Minister and the country know the truth.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:31.079498"
}