{
  "url": "https://www.hindustantimes.com/india-news/chhattisgarh-cabinet-approves-sog-anti-narcotics-task-forces-pilot-training-101770200100112.html",
  "title": "Chhattisgarh cabinet approves SOG, anti-narcotics task forces, pilot training| India News",
  "raw_text": "Raipur, The Chhattisgarh cabinet on Wednesday approved the creation of a Special Operations Group of the state police and district-level anti-narcotics task forces in ten districts. Chief Minister Vishnu Deo Sai chaired the cabinet meeting at Mantralaya Mahanadi Bhawan. The cabinet gave its nod to the creation of 44 new posts for the SOG under the Special Branch of the police headquarters, a provision for which had been made in the 2025-26 budget, a government official said. The SOG will be a specially trained unit tasked with swiftly responding to major or sudden incidents and neutralising terrorist attacks or serious threats, he said. The cabinet also approved 100 new posts for district-level Anti-Narcotics Task Forces, to be set up Raipur, Mahasamund, Bilaspur, Durg, Bastar, Surguja, Kabirdham, Jashpur, Rajnandgaon and Korba. Flight Training Organisations would be set up at various airports and airstrips in the state. The cabinet cleared operational guidelines for the same. The initiative aims to provide pilot training facilities through private participation in view of the rising demand, the official said. The decision is also expected to promote aircraft recycling and aero sports facilities, he added. In another decision, the cabinet gave its nod to the Chhattisgarh Innovation and Startup Promotion Policy 2025-26. The policy seeks to develop Chhattisgarh as a major innovation hub and improve its position in the Centre's Startup Ranking, thereby attracting more investment, the official said. To accelerate planned development in Sirpur and Arpa regions, the cabinet authorised district collectors to allot government land in areas under the Sirpur and Arpa Special Area Development Authorities. The cabinet approved the implementation of the Chhattisgarh Cloud First Policy, under which all state departments, undertakings and autonomous bodies will procure cloud services only from providers approved by the Union Ministry of Electronics and IT or from secure data and disaster recovery centres located in India. Low-priority applications and archival data will be migrated to the cloud by 2027-28, while high-priority services will be migrated by 2029-30, the official stated. The policy is expected to reduce IT infrastructure costs, improve efficiency, strengthen cyber security, ensure service continuity during disasters and provide 24x7 citizen services, he said. Besides, the cabinet also approved a Mobile Tower Scheme to expand digital infrastructure in geographically difficult and Left Wing Extremism-affected areas. The scheme will simplify and expedite approvals for mobile tower installations in remote areas, he added. This article was generated from an automated news agency feed without modifications to text.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:29.350825"
}