{
  "url": "https://www.hindustantimes.com/india-news/delhi-cabinet-approves-financial-aid-for-2-lpg-cylinders-per-year-to-all-ration-card-holder-families-101770164236588.html",
  "title": "Delhi cabinet approves financial aid for 2 LPG cylinders per year to all ration card holder families| India News",
  "raw_text": "The Delhi Cabinet on Tuesday approved a welfare scheme to provide financial assistance equivalent to the cost of two LPG cylinders every year to all ration card holder families in the national capital, chief minister Rekha Gupta announced after the cabinet meeting at the secretariat. The assistance will be extended twice a year on the occasions of Holi and Diwali starting from 2026 and will be implemented through Direct Benefit Transfer (DBT), Gupta said. The Delhi government has decided to provide financial assistance equivalent to two LPG cylinders every year to all ration card holder families so that rising cooking fuel costs do not become a burden during festivals. We are fulfilling a big promise that we had made during elections last year and we will gradually fulfill every promise that we have made to the people, the chief minister said. Gupta said there are around 1.75 million ration card holders in Delhi, covering more than 7.2 million beneficiaries. Officials said the scheme will cover all ration card holder households in Delhi and that 242.77 crore has been allocated for the first tranche of disbursal ahead of Holi early next month. The final expenditure may vary depending on fluctuations in LPG prices, changes in subsidies provided by the central government, and variations in the number of eligible beneficiaries. Officials said the scheme will also cover ration cards issued after 2026, and migrant ration card holders will be eligible as well. Under the scheme, the assistance amount will be credited directly into the Aadhaar-linked bank account of the head of the family. The benefit will be provided twice a year and will not be linked to the purchase of a new LPG cylinder during the festive month, officials said. At present, the retail price of a domestic LPG cylinder in Delhi is 853. Ration card holder families who are beneficiaries of the Pradhan Mantri Ujjwaa Yojana (PMUY) will receive 553 per cylinder after accounting for the 300 per cylinder subsidy provided by the Government of India. Non-PMUY ration card holder households will receive financial assistance equivalent to the full market price of 853 per cylinder. Officials said the scheme has been structured to ensure universal coverage among ration card holders and to avoid exclusions based on the type of cooking fuel used. Households using piped natural gas will also be eligible to receive the same amount through DBT. The assistance will be provided through a transparent DBT mechanism and families using piped natural gas will also receive the benefit so that there is no discrimination among ration card holders, the chief minister said. The government said the objective of the scheme is to reduce the financial impact of rising cooking fuel prices on economically weaker households, particularly during festive seasons when household expenses tend to rise. Officials added that women are expected to be among the primary beneficiaries, as they typically manage household cooking and fuel requirements. According to officials, the cabinet has approved the financial allocation for the scheme and instructed the concerned departments to finalise operational guidelines, beneficiary verification procedures, and timelines for disbursement. The food and civil supplies department will coordinate with other agencies to ensure bank accounts and Aadhaar details are correctly linked for eligible families. The first instalment of assistance is expected to be disbursed around Holi this year, with the second instalment scheduled around Diwali. Officials said detailed instructions will be issued closer to the rollout to ensure smooth implementation.",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:21.442957"
}