{
  "url": "https://www.hindustantimes.com/india-news/we-will-move-forward-together-what-ajit-pawar-said-in-final-phone-call-before-plane-crash-101770194729355.html",
  "title": "We will move forward together: What Ajit Pawar said in final phone call before plane crash| India News",
  "raw_text": "Ajit Pawars final phone call, made minutes before the chartered aircraft he was travelling in crashed at Baramati, has emerged as a poignant reminder of the late NCP leaders emphasis on inclusivity, according to accounts shared by his relatives. Shreejit Pawar, Ajit Pawars relative, recalled exchanging messages with him early on the morning of January 28 regarding the upcoming elections, during which Pawar stressed the need to move forward by taking people of all religions and castes together, news agency PTI reported. ALSO READ | Opposition alleges foul play in Ajit Pawar death Shreejit Pawar said that he had first sent a text message to Ajit Pawar and received a phone call from him at 8:37 am, in which the leader reiterated that collective progress was his political approach. Shreejit Pawar had sought representation for the Mali community in the upcoming Zilla Parishad elections, and in the recorded conversation, Ajit Pawar spoke about his efforts to ensure representation for all communities. \"I had messaged him at 8:19 am while he was on board. As soon as the aircraft came into network range, he called me at 8:37 am, just a few minutes before the crash. I had sought representation for the Mali community in the ZP polls,\" Sreejit Pawar said, as quoted by PTI. ALSO READ | Ajit Pawar death: Crash probe intensifies as aircraft debris shifted to Mumbai The late Maharashtra DCM reportedly referred to appointing Digambar Durgade from the Mali community as chairman of the Pune District Central Co-operative Bank and granting Zilla Parishad tickets to candidates from the community. Ajit Pawar and four others were killed when the Learjet 45 aircraft crash-landed near Baramati airport on January 28, barely 200 metres from the runway. Following his death, his wife Sunetra Pawar was sworn in as Maharashtra DCM, with Governor Acharya Devvrat administering the oath in the presence of Chief Minister Devendra Fadnavis and DCM Eknath Shinde. ALSO READ | A new video, 3 theories, CID probe: 5 crucial points on Ajit Pawar plane crash Meanwhile, Pawars death has triggered political speculation, with opposition leaders alleging foul play and demanding an independent probe, allegations that the BJP has dismissed, HT.com earlier reported. Investigations into the crash are ongoing, with aircraft debris shifted to Mumbai for detailed forensic examination and analysis of flight data and the black box. (With PTI inputs)",
  "source": "www.hindustantimes.com",
  "published_date": null,
  "extracted_at": "2026-02-17T16:45:28.610450"
}