[
  {
    "chunk_id": "article_31_clean.json_0",
    "text": "TITLE: Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leader Rahul Gandhi's traitor jibe at former party colleague Ravneet Singh Bittu in Parliament on Wednesday seems to have gone beyond it intended to with the Bharatiya Janata Party (BJP) now launching an all out attack at the MP, linking the remarks to Operation Bluestar.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_1",
    "text": "TITLE: Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leader Rahul Gandhi's traitor jibe at former party colleague Ravneet Singh Bittu in Parliament on Wednesday seems to have gone beyond it intended to with the Bharatiya Janata Party (BJP) now launching an all out attack at the MP, linking the remarks to Operation Bluestar. Congress Rahul Gandhi was on Wednesday protesting in Parliament complex over the suspension of eight party MPs and his demand for having the unpublished memoir of former army chief MM Naravane, which carries his account of the India-China border standoff, allowed in the House.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_2",
    "text": "TITLE: Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leader Rahul Gandhi's traitor jibe at former party colleague Ravneet Singh Bittu in Parliament on Wednesday seems to have gone beyond it intended to with the Bharatiya Janata Party (BJP) now launching an all out attack at the MP, linking the remarks to Operation Bluestar. Congress Rahul Gandhi was on Wednesday protesting in Parliament complex over the suspension of eight party MPs and his demand for having the unpublished memoir of former army chief MM Naravane, which carries his account of the India-China border standoff, allowed in the House. Ravneet Singh Bittu walked towards the protesting MPs, prompting Rahul Gandhi to initiate a handshake which was rejected, as the gesture came with the remarks, here is a traitor walking right by.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_3",
    "text": "TITLE: Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leader Rahul Gandhi's traitor jibe at former party colleague Ravneet Singh Bittu in Parliament on Wednesday seems to have gone beyond it intended to with the Bharatiya Janata Party (BJP) now launching an all out attack at the MP, linking the remarks to Operation Bluestar. Congress Rahul Gandhi was on Wednesday protesting in Parliament complex over the suspension of eight party MPs and his demand for having the unpublished memoir of former army chief MM Naravane, which carries his account of the India-China border standoff, allowed in the House. Ravneet Singh Bittu walked towards the protesting MPs, prompting Rahul Gandhi to initiate a handshake which was rejected, as the gesture came with the remarks, here is a traitor walking right by. \"Look at the face... Hello my friend... you will come back [to Congress],\" Rahul Gandhi said as Bittu refused to shake hands.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_4",
    "text": "Congress Rahul Gandhi was on Wednesday protesting in Parliament complex over the suspension of eight party MPs and his demand for having the unpublished memoir of former army chief MM Naravane, which carries his account of the India-China border standoff, allowed in the House. Ravneet Singh Bittu walked towards the protesting MPs, prompting Rahul Gandhi to initiate a handshake which was rejected, as the gesture came with the remarks, here is a traitor walking right by. \"Look at the face... Hello my friend... you will come back [to Congress],\" Rahul Gandhi said as Bittu refused to shake hands. Bittu, a three-time MP from Congress, quit the party and joined the BJP before the 2024 Lok Sabha elections.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_5",
    "text": "Ravneet Singh Bittu walked towards the protesting MPs, prompting Rahul Gandhi to initiate a handshake which was rejected, as the gesture came with the remarks, here is a traitor walking right by. \"Look at the face... Hello my friend... you will come back [to Congress],\" Rahul Gandhi said as Bittu refused to shake hands. Bittu, a three-time MP from Congress, quit the party and joined the BJP before the 2024 Lok Sabha elections. He currently serves as the Minister of State for Railways and as the Minister of State for Food Processing Industries and is a Rajya Sabha member of parliament from Rajasthan.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_6",
    "text": "\"Look at the face... Hello my friend... you will come back [to Congress],\" Rahul Gandhi said as Bittu refused to shake hands. Bittu, a three-time MP from Congress, quit the party and joined the BJP before the 2024 Lok Sabha elections. He currently serves as the Minister of State for Railways and as the Minister of State for Food Processing Industries and is a Rajya Sabha member of parliament from Rajasthan. On his altercation with Lok Sabha Leader of Opposition Rahul Gandhi outside Makar Dwar, Ravneet Singh Bittu invoked the Operation Bluestar - a military operation conducted in June 1984 under the then Indira Gandhiled government, with the objective of removing separatist Jarnail Singh Bhindranwale and other militants from the buildings of the Golden Temple, the holiest site of Sikhism, in Amritsar.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_7",
    "text": "Bittu, a three-time MP from Congress, quit the party and joined the BJP before the 2024 Lok Sabha elections. He currently serves as the Minister of State for Railways and as the Minister of State for Food Processing Industries and is a Rajya Sabha member of parliament from Rajasthan. On his altercation with Lok Sabha Leader of Opposition Rahul Gandhi outside Makar Dwar, Ravneet Singh Bittu invoked the Operation Bluestar - a military operation conducted in June 1984 under the then Indira Gandhiled government, with the objective of removing separatist Jarnail Singh Bhindranwale and other militants from the buildings of the Golden Temple, the holiest site of Sikhism, in Amritsar. \"They [Congress] believe that they are biggest 'desh bhakt' [patriots].",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_8",
    "text": "He currently serves as the Minister of State for Railways and as the Minister of State for Food Processing Industries and is a Rajya Sabha member of parliament from Rajasthan. On his altercation with Lok Sabha Leader of Opposition Rahul Gandhi outside Makar Dwar, Ravneet Singh Bittu invoked the Operation Bluestar - a military operation conducted in June 1984 under the then Indira Gandhiled government, with the objective of removing separatist Jarnail Singh Bhindranwale and other militants from the buildings of the Golden Temple, the holiest site of Sikhism, in Amritsar. \"They [Congress] believe that they are biggest 'desh bhakt' [patriots]. The Congress party, Gandhi family put Punjab on fire.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_9",
    "text": "On his altercation with Lok Sabha Leader of Opposition Rahul Gandhi outside Makar Dwar, Ravneet Singh Bittu invoked the Operation Bluestar - a military operation conducted in June 1984 under the then Indira Gandhiled government, with the objective of removing separatist Jarnail Singh Bhindranwale and other militants from the buildings of the Golden Temple, the holiest site of Sikhism, in Amritsar. \"They [Congress] believe that they are biggest 'desh bhakt' [patriots]. The Congress party, Gandhi family put Punjab on fire. The Golden Temple was destroyed... My grandfather Sardar Beant Singh was also martyred... till the time I was with you [Congress], I was right and now I am with BJP then you are referring me with such a word [traitor], Bittu said.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_10",
    "text": "\"They [Congress] believe that they are biggest 'desh bhakt' [patriots]. The Congress party, Gandhi family put Punjab on fire. The Golden Temple was destroyed... My grandfather Sardar Beant Singh was also martyred... till the time I was with you [Congress], I was right and now I am with BJP then you are referring me with such a word [traitor], Bittu said. \"He [Rahul Gandhi] thinks himself as some 'Shehanshah'.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_11",
    "text": "The Congress party, Gandhi family put Punjab on fire. The Golden Temple was destroyed... My grandfather Sardar Beant Singh was also martyred... till the time I was with you [Congress], I was right and now I am with BJP then you are referring me with such a word [traitor], Bittu said. \"He [Rahul Gandhi] thinks himself as some 'Shehanshah'. When he came forward to shake hands, I told him that you people are 'desh ke gaddar', enemies of the country... talk against the Army daily,\" he added.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_12",
    "text": "The Golden Temple was destroyed... My grandfather Sardar Beant Singh was also martyred... till the time I was with you [Congress], I was right and now I am with BJP then you are referring me with such a word [traitor], Bittu said. \"He [Rahul Gandhi] thinks himself as some 'Shehanshah'. When he came forward to shake hands, I told him that you people are 'desh ke gaddar', enemies of the country... talk against the Army daily,\" he added. Later in a press conference, BJP leader Hardeep Singh Puri continued the attack the word traitor should not be used lightly, as it means one who betrays the country, linking the Rajya Sabha MP's turban to the remark.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_13",
    "text": "\"He [Rahul Gandhi] thinks himself as some 'Shehanshah'. When he came forward to shake hands, I told him that you people are 'desh ke gaddar', enemies of the country... talk against the Army daily,\" he added. Later in a press conference, BJP leader Hardeep Singh Puri continued the attack the word traitor should not be used lightly, as it means one who betrays the country, linking the Rajya Sabha MP's turban to the remark. \"This is a serious issue for the Sikh community.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_14",
    "text": "When he came forward to shake hands, I told him that you people are 'desh ke gaddar', enemies of the country... talk against the Army daily,\" he added. Later in a press conference, BJP leader Hardeep Singh Puri continued the attack the word traitor should not be used lightly, as it means one who betrays the country, linking the Rajya Sabha MP's turban to the remark. \"This is a serious issue for the Sikh community. LoP Rahul Gandhi is upset that Bittu ji left his party, but he also told him that you will come back.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_15",
    "text": "Later in a press conference, BJP leader Hardeep Singh Puri continued the attack the word traitor should not be used lightly, as it means one who betrays the country, linking the Rajya Sabha MP's turban to the remark. \"This is a serious issue for the Sikh community. LoP Rahul Gandhi is upset that Bittu ji left his party, but he also told him that you will come back. Just because a turban-wearing person leaves your party, you call him a traitor. The word he used is unacceptable.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_16",
    "text": "LoP Rahul Gandhi is upset that Bittu ji left his party, but he also told him that you will come back. Just because a turban-wearing person leaves your party, you call him a traitor. The word he used is unacceptable. To label anyone from any community as a traitor is unacceptable. Parliamentary discourse, both outside and inside the parliament, has to be grounded in decency and in decent language,\" Puri said.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_17",
    "text": "The word he used is unacceptable. To label anyone from any community as a traitor is unacceptable. Parliamentary discourse, both outside and inside the parliament, has to be grounded in decency and in decent language,\" Puri said. Another former Congress and now-BJP leader Jaiveer Shergill - also reacted to the remarks and accused Rahul Gandhi of displaying anti-Sikh mindset. As per Rahul Gandhi, anybody who serves the nation is a traitor and anybody who falls on his feet is a loyalist.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_18",
    "text": "Parliamentary discourse, both outside and inside the parliament, has to be grounded in decency and in decent language,\" Puri said. Another former Congress and now-BJP leader Jaiveer Shergill - also reacted to the remarks and accused Rahul Gandhi of displaying anti-Sikh mindset. As per Rahul Gandhi, anybody who serves the nation is a traitor and anybody who falls on his feet is a loyalist. By calling Sardar Ravneet Singh Bittu a traitor, Rahul Gandhi has insulted the entire Sikh community, has once again displayed his anti-Sukh mindset, displayed his high-headedness, his crassness and once again proven that he is not fit to be an LoP, Shergill said.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_19",
    "text": "Another former Congress and now-BJP leader Jaiveer Shergill - also reacted to the remarks and accused Rahul Gandhi of displaying anti-Sikh mindset. As per Rahul Gandhi, anybody who serves the nation is a traitor and anybody who falls on his feet is a loyalist. By calling Sardar Ravneet Singh Bittu a traitor, Rahul Gandhi has insulted the entire Sikh community, has once again displayed his anti-Sukh mindset, displayed his high-headedness, his crassness and once again proven that he is not fit to be an LoP, Shergill said. Rahul Gandhi should not forget that it is the Sikh community which has always been protecting and serving the nation, unlike him, who questions the Army, defames the nation, and is always eager to become a hero in Pakistani newspapers, he said.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_20",
    "text": "As per Rahul Gandhi, anybody who serves the nation is a traitor and anybody who falls on his feet is a loyalist. By calling Sardar Ravneet Singh Bittu a traitor, Rahul Gandhi has insulted the entire Sikh community, has once again displayed his anti-Sukh mindset, displayed his high-headedness, his crassness and once again proven that he is not fit to be an LoP, Shergill said. Rahul Gandhi should not forget that it is the Sikh community which has always been protecting and serving the nation, unlike him, who questions the Army, defames the nation, and is always eager to become a hero in Pakistani newspapers, he said. Rahul Gandhi's conduct today in the Parliament is shameful, disgusting and unbecoming of a LoP, he added.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_21",
    "text": "By calling Sardar Ravneet Singh Bittu a traitor, Rahul Gandhi has insulted the entire Sikh community, has once again displayed his anti-Sukh mindset, displayed his high-headedness, his crassness and once again proven that he is not fit to be an LoP, Shergill said. Rahul Gandhi should not forget that it is the Sikh community which has always been protecting and serving the nation, unlike him, who questions the Army, defames the nation, and is always eager to become a hero in Pakistani newspapers, he said. Rahul Gandhi's conduct today in the Parliament is shameful, disgusting and unbecoming of a LoP, he added. Parliament saw disruptions for the third straight day on Wednesday amid showdown between opposition MPs, led by LoP Rahul Gandhi, over the unpublished memoir, part of Naravanes book which was supposed to be published in January 2024.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_22",
    "text": "Rahul Gandhi should not forget that it is the Sikh community which has always been protecting and serving the nation, unlike him, who questions the Army, defames the nation, and is always eager to become a hero in Pakistani newspapers, he said. Rahul Gandhi's conduct today in the Parliament is shameful, disgusting and unbecoming of a LoP, he added. Parliament saw disruptions for the third straight day on Wednesday amid showdown between opposition MPs, led by LoP Rahul Gandhi, over the unpublished memoir, part of Naravanes book which was supposed to be published in January 2024. After an extract appeared in December 2023, its publication was deferred because it had not received clearance from the army.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  },
  {
    "chunk_id": "article_31_clean.json_23",
    "text": "Rahul Gandhi's conduct today in the Parliament is shameful, disgusting and unbecoming of a LoP, he added. Parliament saw disruptions for the third straight day on Wednesday amid showdown between opposition MPs, led by LoP Rahul Gandhi, over the unpublished memoir, part of Naravanes book which was supposed to be published in January 2024. After an extract appeared in December 2023, its publication was deferred because it had not received clearance from the army. The unpublished memoir in question pertains to the content of an article in Caravan magazine on former army chief Manoj Mukund Naravanes account that seemed to suggest that the political leadership appeared indecisive during the face-off between India and China in 2020.",
    "metadata": {
      "title": "Here's a traitor: Rahul Gandhi's remark at Bittu in Parliament sparks major row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:29.741247"
    }
  }
]