[
  {
    "chunk_id": "article_25_clean.json_0",
    "text": "TITLE: Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nTwo terrorists of the Jaish-e-Mohammad (JeM) terror outfit were killed after an encounter with the security forces in J&K's Udhampur district on Wednesday, police said. The anti-terror operation was jointly conducted by the J&K police, Indian Army and CRPF.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_1",
    "text": "TITLE: Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nTwo terrorists of the Jaish-e-Mohammad (JeM) terror outfit were killed after an encounter with the security forces in J&K's Udhampur district on Wednesday, police said. The anti-terror operation was jointly conducted by the J&K police, Indian Army and CRPF. Also read: 'Sorry papa' note, crying caricature: Freak details in suicide of 'game-obsessed' sisters in UP's Ghaziabad The slain terrorists have been identified as JeM commanders Mavi and Zubair and an AK 47 and an M4 carbine have been recovered from their possession as the bodies have been retrieved, HT has learnt.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_2",
    "text": "TITLE: Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nTwo terrorists of the Jaish-e-Mohammad (JeM) terror outfit were killed after an encounter with the security forces in J&K's Udhampur district on Wednesday, police said. The anti-terror operation was jointly conducted by the J&K police, Indian Army and CRPF. Also read: 'Sorry papa' note, crying caricature: Freak details in suicide of 'game-obsessed' sisters in UP's Ghaziabad The slain terrorists have been identified as JeM commanders Mavi and Zubair and an AK 47 and an M4 carbine have been recovered from their possession as the bodies have been retrieved, HT has learnt. The terrorists were located inside a natural cave by security personnel in the Jaffer forest area of Ramnagar around 4 pm on Tuesday, news agency PTI reported.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_3",
    "text": "The anti-terror operation was jointly conducted by the J&K police, Indian Army and CRPF. Also read: 'Sorry papa' note, crying caricature: Freak details in suicide of 'game-obsessed' sisters in UP's Ghaziabad The slain terrorists have been identified as JeM commanders Mavi and Zubair and an AK 47 and an M4 carbine have been recovered from their possession as the bodies have been retrieved, HT has learnt. The terrorists were located inside a natural cave by security personnel in the Jaffer forest area of Ramnagar around 4 pm on Tuesday, news agency PTI reported. A gunbattle broke out between the two sides soon after and reportedly lasted for more than an hour.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_4",
    "text": "Also read: 'Sorry papa' note, crying caricature: Freak details in suicide of 'game-obsessed' sisters in UP's Ghaziabad The slain terrorists have been identified as JeM commanders Mavi and Zubair and an AK 47 and an M4 carbine have been recovered from their possession as the bodies have been retrieved, HT has learnt. The terrorists were located inside a natural cave by security personnel in the Jaffer forest area of Ramnagar around 4 pm on Tuesday, news agency PTI reported. A gunbattle broke out between the two sides soon after and reportedly lasted for more than an hour. Also read: Sensitive sectors like agriculture safe, US tariffs on India lower than others: Piyush Goyal in Lok Sabha Firing resumed briefly at around 7:30 pm when the terrorists tried to escape under the cover of darkness, the officials were quoted as saying.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_5",
    "text": "The terrorists were located inside a natural cave by security personnel in the Jaffer forest area of Ramnagar around 4 pm on Tuesday, news agency PTI reported. A gunbattle broke out between the two sides soon after and reportedly lasted for more than an hour. Also read: Sensitive sectors like agriculture safe, US tariffs on India lower than others: Piyush Goyal in Lok Sabha Firing resumed briefly at around 7:30 pm when the terrorists tried to escape under the cover of darkness, the officials were quoted as saying. Army reinforcements, including paratroopers and dog squads, were rushed in to further tighten the cordon.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_6",
    "text": "A gunbattle broke out between the two sides soon after and reportedly lasted for more than an hour. Also read: Sensitive sectors like agriculture safe, US tariffs on India lower than others: Piyush Goyal in Lok Sabha Firing resumed briefly at around 7:30 pm when the terrorists tried to escape under the cover of darkness, the officials were quoted as saying. Army reinforcements, including paratroopers and dog squads, were rushed in to further tighten the cordon. No exchange of fire was reported during the night and the security forces prepared for a final assault on the holed up terrorists on Wednesday morning.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_7",
    "text": "Also read: Sensitive sectors like agriculture safe, US tariffs on India lower than others: Piyush Goyal in Lok Sabha Firing resumed briefly at around 7:30 pm when the terrorists tried to escape under the cover of darkness, the officials were quoted as saying. Army reinforcements, including paratroopers and dog squads, were rushed in to further tighten the cordon. No exchange of fire was reported during the night and the security forces prepared for a final assault on the holed up terrorists on Wednesday morning. Following the ramped up operations, the two Jaish terrorists were reportedly killed.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_8",
    "text": "Army reinforcements, including paratroopers and dog squads, were rushed in to further tighten the cordon. No exchange of fire was reported during the night and the security forces prepared for a final assault on the holed up terrorists on Wednesday morning. Following the ramped up operations, the two Jaish terrorists were reportedly killed. Security officials said the terrorists were killed under Operation Kiya after they received specific intelligence input over the presence of terrorists in Jophar Forest of Udhampur district.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_9",
    "text": "No exchange of fire was reported during the night and the security forces prepared for a final assault on the holed up terrorists on Wednesday morning. Following the ramped up operations, the two Jaish terrorists were reportedly killed. Security officials said the terrorists were killed under Operation Kiya after they received specific intelligence input over the presence of terrorists in Jophar Forest of Udhampur district. Contact with terrorists was established yesterday and since then, terrorists were prevented from breaking contact.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_10",
    "text": "Following the ramped up operations, the two Jaish terrorists were reportedly killed. Security officials said the terrorists were killed under Operation Kiya after they received specific intelligence input over the presence of terrorists in Jophar Forest of Udhampur district. Contact with terrorists was established yesterday and since then, terrorists were prevented from breaking contact. Following a calibrated and coordinated response, two terrorists have been successfully neutralised.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_11",
    "text": "Security officials said the terrorists were killed under Operation Kiya after they received specific intelligence input over the presence of terrorists in Jophar Forest of Udhampur district. Contact with terrorists was established yesterday and since then, terrorists were prevented from breaking contact. Following a calibrated and coordinated response, two terrorists have been successfully neutralised. The operation highlighted seamless inter-agency coordination, tactical precision and high standards of professionalism, officials said.",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  },
  {
    "chunk_id": "article_25_clean.json_12",
    "text": "Contact with terrorists was established yesterday and since then, terrorists were prevented from breaking contact. Following a calibrated and coordinated response, two terrorists have been successfully neutralised. The operation highlighted seamless inter-agency coordination, tactical precision and high standards of professionalism, officials said. With inputs from Ravi Krishnan Khajuria",
    "metadata": {
      "title": "Two Jaish terrorists killed in J&amp;K's Udhampur after encounter with security forces| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:27.401992"
    }
  }
]