[
  {
    "chunk_id": "article_12_clean.json_0",
    "text": "TITLE: Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nIn connection with a 10.98-crore cyber fraud case, the South Mumbai Cyber Cell on Tuesday arrested seven people from five states, including Uttar Pradesh, Bihar, Odisha, Haryana and Maharashtra.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_1",
    "text": "TITLE: Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nIn connection with a 10.98-crore cyber fraud case, the South Mumbai Cyber Cell on Tuesday arrested seven people from five states, including Uttar Pradesh, Bihar, Odisha, Haryana and Maharashtra. Around 2.06 crore was credited to the accused persons bank accounts in the present case, while transactions worth nearly 13 crore linked to 91 other cyber fraud cases were also detected, said a police officer.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_2",
    "text": "TITLE: Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nIn connection with a 10.98-crore cyber fraud case, the South Mumbai Cyber Cell on Tuesday arrested seven people from five states, including Uttar Pradesh, Bihar, Odisha, Haryana and Maharashtra. Around 2.06 crore was credited to the accused persons bank accounts in the present case, while transactions worth nearly 13 crore linked to 91 other cyber fraud cases were also detected, said a police officer. The arrested accused have been identified as Kuvarlal Yele from Gondia in Maharashtra, Adarshen Anand from Uttar Pradesh, Sunil Gupta from Odisha, Rasraj Bauri from Bihar, Sanjay Singh from Punjab and Khirod Sahoo from Odisha, the officer said, adding that further arrests are likely as the investigation progresses.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_3",
    "text": "TITLE: Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nIn connection with a 10.98-crore cyber fraud case, the South Mumbai Cyber Cell on Tuesday arrested seven people from five states, including Uttar Pradesh, Bihar, Odisha, Haryana and Maharashtra. Around 2.06 crore was credited to the accused persons bank accounts in the present case, while transactions worth nearly 13 crore linked to 91 other cyber fraud cases were also detected, said a police officer. The arrested accused have been identified as Kuvarlal Yele from Gondia in Maharashtra, Adarshen Anand from Uttar Pradesh, Sunil Gupta from Odisha, Rasraj Bauri from Bihar, Sanjay Singh from Punjab and Khirod Sahoo from Odisha, the officer said, adding that further arrests are likely as the investigation progresses. Also read| Delhi cybercrime: 376 cases of over 50 lakh fraud in 2025 Police said nine police teams were formed to crack the case.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_4",
    "text": "Around 2.06 crore was credited to the accused persons bank accounts in the present case, while transactions worth nearly 13 crore linked to 91 other cyber fraud cases were also detected, said a police officer. The arrested accused have been identified as Kuvarlal Yele from Gondia in Maharashtra, Adarshen Anand from Uttar Pradesh, Sunil Gupta from Odisha, Rasraj Bauri from Bihar, Sanjay Singh from Punjab and Khirod Sahoo from Odisha, the officer said, adding that further arrests are likely as the investigation progresses. Also read| Delhi cybercrime: 376 cases of over 50 lakh fraud in 2025 Police said nine police teams were formed to crack the case. The accused formed the first layer of the fraud network, with victims directly transferring money into their bank accounts.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_5",
    "text": "The arrested accused have been identified as Kuvarlal Yele from Gondia in Maharashtra, Adarshen Anand from Uttar Pradesh, Sunil Gupta from Odisha, Rasraj Bauri from Bihar, Sanjay Singh from Punjab and Khirod Sahoo from Odisha, the officer said, adding that further arrests are likely as the investigation progresses. Also read| Delhi cybercrime: 376 cases of over 50 lakh fraud in 2025 Police said nine police teams were formed to crack the case. The accused formed the first layer of the fraud network, with victims directly transferring money into their bank accounts. These accounts were projected as belonging to a US-based investment firm, while in reality, they were operated from different parts of India, making tracing difficult.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_6",
    "text": "Also read| Delhi cybercrime: 376 cases of over 50 lakh fraud in 2025 Police said nine police teams were formed to crack the case. The accused formed the first layer of the fraud network, with victims directly transferring money into their bank accounts. These accounts were projected as belonging to a US-based investment firm, while in reality, they were operated from different parts of India, making tracing difficult. The frauds have given bank accounts from various parts of India, making it difficult for the investigators to trace them, the officer added.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_7",
    "text": "The accused formed the first layer of the fraud network, with victims directly transferring money into their bank accounts. These accounts were projected as belonging to a US-based investment firm, while in reality, they were operated from different parts of India, making tracing difficult. The frauds have given bank accounts from various parts of India, making it difficult for the investigators to trace them, the officer added. During further investigation, police found that the same bank accounts were used to cheat at least 91 other victims, with deposits totalling about 13 crore.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_8",
    "text": "These accounts were projected as belonging to a US-based investment firm, while in reality, they were operated from different parts of India, making tracing difficult. The frauds have given bank accounts from various parts of India, making it difficult for the investigators to trace them, the officer added. During further investigation, police found that the same bank accounts were used to cheat at least 91 other victims, with deposits totalling about 13 crore. So far, we have frozen around 2.13 crore in this 10.98-crore cheating case, he said.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_9",
    "text": "The frauds have given bank accounts from various parts of India, making it difficult for the investigators to trace them, the officer added. During further investigation, police found that the same bank accounts were used to cheat at least 91 other victims, with deposits totalling about 13 crore. So far, we have frozen around 2.13 crore in this 10.98-crore cheating case, he said. The case was registered on January 20 following a complaint by a 68-year-old businessman from Churchgate, who was allegedly duped of 10.98 crore by cyber fraudsters posing as investment advisors.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_10",
    "text": "During further investigation, police found that the same bank accounts were used to cheat at least 91 other victims, with deposits totalling about 13 crore. So far, we have frozen around 2.13 crore in this 10.98-crore cheating case, he said. The case was registered on January 20 following a complaint by a 68-year-old businessman from Churchgate, who was allegedly duped of 10.98 crore by cyber fraudsters posing as investment advisors. According to the police, the complainant is a regular share market investor and was looking for some other investment options when he received a call from an unknown number.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_11",
    "text": "So far, we have frozen around 2.13 crore in this 10.98-crore cheating case, he said. The case was registered on January 20 following a complaint by a 68-year-old businessman from Churchgate, who was allegedly duped of 10.98 crore by cyber fraudsters posing as investment advisors. According to the police, the complainant is a regular share market investor and was looking for some other investment options when he received a call from an unknown number. The caller identified himself as Mohan Sharma and informed him that he can make high profits by investing through their firm.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_12",
    "text": "The case was registered on January 20 following a complaint by a 68-year-old businessman from Churchgate, who was allegedly duped of 10.98 crore by cyber fraudsters posing as investment advisors. According to the police, the complainant is a regular share market investor and was looking for some other investment options when he received a call from an unknown number. The caller identified himself as Mohan Sharma and informed him that he can make high profits by investing through their firm. Sharma asked him to join a WhatsApp group, named Trader Titan VIP group, where tips were being shared for making higher profits on investment in the share market and members of the group were also sharing details of the profits that they had made.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_13",
    "text": "According to the police, the complainant is a regular share market investor and was looking for some other investment options when he received a call from an unknown number. The caller identified himself as Mohan Sharma and informed him that he can make high profits by investing through their firm. Sharma asked him to join a WhatsApp group, named Trader Titan VIP group, where tips were being shared for making higher profits on investment in the share market and members of the group were also sharing details of the profits that they had made. Impressed by the tips and lured by the high returns, the 68-year-old expressed his willingness to invest through the firm of the accused.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_14",
    "text": "The caller identified himself as Mohan Sharma and informed him that he can make high profits by investing through their firm. Sharma asked him to join a WhatsApp group, named Trader Titan VIP group, where tips were being shared for making higher profits on investment in the share market and members of the group were also sharing details of the profits that they had made. Impressed by the tips and lured by the high returns, the 68-year-old expressed his willingness to invest through the firm of the accused. Sharma then introduced him to one Alex, who claimed to be the general manager and part of an American private equity firm, and added the complainant to another WhatsApp group, which they claimed was a premium group.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_15",
    "text": "Sharma asked him to join a WhatsApp group, named Trader Titan VIP group, where tips were being shared for making higher profits on investment in the share market and members of the group were also sharing details of the profits that they had made. Impressed by the tips and lured by the high returns, the 68-year-old expressed his willingness to invest through the firm of the accused. Sharma then introduced him to one Alex, who claimed to be the general manager and part of an American private equity firm, and added the complainant to another WhatsApp group, which they claimed was a premium group. Between December 30, 2025 and January 17, 2026, the 68-year-old ended up investing around 10.98 crore through the fraud application of the racket, a police officer said.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_16",
    "text": "Impressed by the tips and lured by the high returns, the 68-year-old expressed his willingness to invest through the firm of the accused. Sharma then introduced him to one Alex, who claimed to be the general manager and part of an American private equity firm, and added the complainant to another WhatsApp group, which they claimed was a premium group. Between December 30, 2025 and January 17, 2026, the 68-year-old ended up investing around 10.98 crore through the fraud application of the racket, a police officer said. On January 17, the complainant could not withdraw any money from his account and also noticed that the activity on the WhatsApp group had stopped abruptly, the officer added.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  },
  {
    "chunk_id": "article_12_clean.json_17",
    "text": "Sharma then introduced him to one Alex, who claimed to be the general manager and part of an American private equity firm, and added the complainant to another WhatsApp group, which they claimed was a premium group. Between December 30, 2025 and January 17, 2026, the 68-year-old ended up investing around 10.98 crore through the fraud application of the racket, a police officer said. On January 17, the complainant could not withdraw any money from his account and also noticed that the activity on the WhatsApp group had stopped abruptly, the officer added. He added that the accused also threatened to block his account and all his investments if he failed to invest 8 crore more, after which the complainant suspected something was wrong and approached the police on January 20.",
    "metadata": {
      "title": "Mumbai police arrests seven from five states in 11-crore cyber fraud case| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:22.769042"
    }
  }
]