[
  {
    "chunk_id": "article_33_clean.json_0",
    "text": "TITLE: Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi: The Union government has proposed increasing the permissible vehicle height from 4 metres to 4.5 metres for N2 and N3 category trucks and semi-trailers used to transport white goods and photovoltaic solar panels, according to a draft notification issued by the ministry of road transport and highways.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_1",
    "text": "TITLE: Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi: The Union government has proposed increasing the permissible vehicle height from 4 metres to 4.5 metres for N2 and N3 category trucks and semi-trailers used to transport white goods and photovoltaic solar panels, according to a draft notification issued by the ministry of road transport and highways. The N2 category covers vehicles weighing over 3.5 tonnes and up to 12 tonnes, such as light and intermediate trucks, while N3 includes vehicles over 12 tonnes, such as heavy trucks.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_2",
    "text": "TITLE: Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi: The Union government has proposed increasing the permissible vehicle height from 4 metres to 4.5 metres for N2 and N3 category trucks and semi-trailers used to transport white goods and photovoltaic solar panels, according to a draft notification issued by the ministry of road transport and highways. The N2 category covers vehicles weighing over 3.5 tonnes and up to 12 tonnes, such as light and intermediate trucks, while N3 includes vehicles over 12 tonnes, such as heavy trucks. The proposal, published in the Gazette of India on January 30, seeks to amend Rule 93 of the Central Motor Vehicles Rules, 1989, and will apply to N2 and N3 category motor vehicles as well as semi-trailers attached to tractors when the cargo is packaged and stacked in multiple layers on the load body.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_3",
    "text": "TITLE: Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi: The Union government has proposed increasing the permissible vehicle height from 4 metres to 4.5 metres for N2 and N3 category trucks and semi-trailers used to transport white goods and photovoltaic solar panels, according to a draft notification issued by the ministry of road transport and highways. The N2 category covers vehicles weighing over 3.5 tonnes and up to 12 tonnes, such as light and intermediate trucks, while N3 includes vehicles over 12 tonnes, such as heavy trucks. The proposal, published in the Gazette of India on January 30, seeks to amend Rule 93 of the Central Motor Vehicles Rules, 1989, and will apply to N2 and N3 category motor vehicles as well as semi-trailers attached to tractors when the cargo is packaged and stacked in multiple layers on the load body. As per the draft rules, trucks in the N2 and N3 categories transporting white goods or solar panels/modules will be permitted an overall height of up to 4.5 metres, provided the cargo is packed and stacked in multiple layers.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_4",
    "text": "The N2 category covers vehicles weighing over 3.5 tonnes and up to 12 tonnes, such as light and intermediate trucks, while N3 includes vehicles over 12 tonnes, such as heavy trucks. The proposal, published in the Gazette of India on January 30, seeks to amend Rule 93 of the Central Motor Vehicles Rules, 1989, and will apply to N2 and N3 category motor vehicles as well as semi-trailers attached to tractors when the cargo is packaged and stacked in multiple layers on the load body. As per the draft rules, trucks in the N2 and N3 categories transporting white goods or solar panels/modules will be permitted an overall height of up to 4.5 metres, provided the cargo is packed and stacked in multiple layers. A similar height limit has been proposed for semi-trailers with tractors carrying the same category of goods.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_5",
    "text": "The proposal, published in the Gazette of India on January 30, seeks to amend Rule 93 of the Central Motor Vehicles Rules, 1989, and will apply to N2 and N3 category motor vehicles as well as semi-trailers attached to tractors when the cargo is packaged and stacked in multiple layers on the load body. As per the draft rules, trucks in the N2 and N3 categories transporting white goods or solar panels/modules will be permitted an overall height of up to 4.5 metres, provided the cargo is packed and stacked in multiple layers. A similar height limit has been proposed for semi-trailers with tractors carrying the same category of goods. The ministry has invited objections and suggestions from stakeholders and the general public within 30 days from the date the notification is made available, after which the draft rules will be taken up for consideration by the Centre.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_6",
    "text": "As per the draft rules, trucks in the N2 and N3 categories transporting white goods or solar panels/modules will be permitted an overall height of up to 4.5 metres, provided the cargo is packed and stacked in multiple layers. A similar height limit has been proposed for semi-trailers with tractors carrying the same category of goods. The ministry has invited objections and suggestions from stakeholders and the general public within 30 days from the date the notification is made available, after which the draft rules will be taken up for consideration by the Centre. Welcoming the proposed amendment as a practical and welcome step, general secretary of the All India Truckers Welfare Association (AITWA) Abhishek Gupta said, It will help reduce logistics costs, improve vehicle utilisation, and lower emissions by cutting down the number of trips required.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_7",
    "text": "A similar height limit has been proposed for semi-trailers with tractors carrying the same category of goods. The ministry has invited objections and suggestions from stakeholders and the general public within 30 days from the date the notification is made available, after which the draft rules will be taken up for consideration by the Centre. Welcoming the proposed amendment as a practical and welcome step, general secretary of the All India Truckers Welfare Association (AITWA) Abhishek Gupta said, It will help reduce logistics costs, improve vehicle utilisation, and lower emissions by cutting down the number of trips required. However, from an industry perspective, this should be seen as a starting point.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_8",
    "text": "The ministry has invited objections and suggestions from stakeholders and the general public within 30 days from the date the notification is made available, after which the draft rules will be taken up for consideration by the Centre. Welcoming the proposed amendment as a practical and welcome step, general secretary of the All India Truckers Welfare Association (AITWA) Abhishek Gupta said, It will help reduce logistics costs, improve vehicle utilisation, and lower emissions by cutting down the number of trips required. However, from an industry perspective, this should be seen as a starting point. The trucking sector would benefit from a broader, well-defined relaxation in height norms across transport categories, aligned with safety standards, to improve overall efficiency and competitiveness.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_9",
    "text": "Welcoming the proposed amendment as a practical and welcome step, general secretary of the All India Truckers Welfare Association (AITWA) Abhishek Gupta said, It will help reduce logistics costs, improve vehicle utilisation, and lower emissions by cutting down the number of trips required. However, from an industry perspective, this should be seen as a starting point. The trucking sector would benefit from a broader, well-defined relaxation in height norms across transport categories, aligned with safety standards, to improve overall efficiency and competitiveness. India managing director at the International Council on Clean Transportation (ICCT) Amit Bhatt said, India has committed to achieving 500 GW of non-fossil electricity capacity by 2030, with solar expected to contribute the largest share.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_10",
    "text": "However, from an industry perspective, this should be seen as a starting point. The trucking sector would benefit from a broader, well-defined relaxation in height norms across transport categories, aligned with safety standards, to improve overall efficiency and competitiveness. India managing director at the International Council on Clean Transportation (ICCT) Amit Bhatt said, India has committed to achieving 500 GW of non-fossil electricity capacity by 2030, with solar expected to contribute the largest share. Regulatory clarity on the safe and efficient movement of photovoltaic modules, as provided through this amendment, is a small but important enabler of that transition.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  },
  {
    "chunk_id": "article_33_clean.json_11",
    "text": "The trucking sector would benefit from a broader, well-defined relaxation in height norms across transport categories, aligned with safety standards, to improve overall efficiency and competitiveness. India managing director at the International Council on Clean Transportation (ICCT) Amit Bhatt said, India has committed to achieving 500 GW of non-fossil electricity capacity by 2030, with solar expected to contribute the largest share. Regulatory clarity on the safe and efficient movement of photovoltaic modules, as provided through this amendment, is a small but important enabler of that transition. By reducing uncertainty and bottlenecks in the transport of solar equipment, such measures help accelerate project execution timelines and support Indias broader decarbonisation and energy transition goals.",
    "metadata": {
      "title": "Centre proposes raising truck height limit to 4.5 m for white goods, solar panels| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.392089"
    }
  }
]