[
  {
    "chunk_id": "article_4_clean.json_0",
    "text": "TITLE: All eyes on Rubio and Jaishankars meeting today| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nExternal affairs minister S Jaishankars meeting with US secretary of state Marco Rubio in Washington on Wednesday is being closely watched for further steps to put India-US ties on an even keel after a year of unprecedented strains following the finalisation of a trade deal, people familiar with the matter said on Tuesday.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_1",
    "text": "TITLE: All eyes on Rubio and Jaishankars meeting today| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nExternal affairs minister S Jaishankars meeting with US secretary of state Marco Rubio in Washington on Wednesday is being closely watched for further steps to put India-US ties on an even keel after a year of unprecedented strains following the finalisation of a trade deal, people familiar with the matter said on Tuesday. Jaishankar, in the US to participate in a ministerial meeting on critical minerals convened by Rubio on February 4, is set to meet the secretary of state in the early hours of Wednesday (Indian time), a day after the surprise announcement by Prime Minister Narendra Modi and President Donald Trump of the reduction of US tariffs on Indian exports from 50% to 18% under the trade deal.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_2",
    "text": "TITLE: All eyes on Rubio and Jaishankars meeting today| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nExternal affairs minister S Jaishankars meeting with US secretary of state Marco Rubio in Washington on Wednesday is being closely watched for further steps to put India-US ties on an even keel after a year of unprecedented strains following the finalisation of a trade deal, people familiar with the matter said on Tuesday. Jaishankar, in the US to participate in a ministerial meeting on critical minerals convened by Rubio on February 4, is set to meet the secretary of state in the early hours of Wednesday (Indian time), a day after the surprise announcement by Prime Minister Narendra Modi and President Donald Trump of the reduction of US tariffs on Indian exports from 50% to 18% under the trade deal. Other than a confirmation about the slashing of the US tariffs, including the removal of a 25% punitive levy imposed by Trump over Russian energy purchases, few concrete details of the trade deal have emerged so far.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_3",
    "text": "TITLE: All eyes on Rubio and Jaishankars meeting today| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nExternal affairs minister S Jaishankars meeting with US secretary of state Marco Rubio in Washington on Wednesday is being closely watched for further steps to put India-US ties on an even keel after a year of unprecedented strains following the finalisation of a trade deal, people familiar with the matter said on Tuesday. Jaishankar, in the US to participate in a ministerial meeting on critical minerals convened by Rubio on February 4, is set to meet the secretary of state in the early hours of Wednesday (Indian time), a day after the surprise announcement by Prime Minister Narendra Modi and President Donald Trump of the reduction of US tariffs on Indian exports from 50% to 18% under the trade deal. Other than a confirmation about the slashing of the US tariffs, including the removal of a 25% punitive levy imposed by Trump over Russian energy purchases, few concrete details of the trade deal have emerged so far. The people cited above said on condition of anonymity that details about the next steps in repairing bilateral relations are expected to emerge following Jaishankars meetings with Rubio and other senior US officials, including those dealing with trade.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_4",
    "text": "Jaishankar, in the US to participate in a ministerial meeting on critical minerals convened by Rubio on February 4, is set to meet the secretary of state in the early hours of Wednesday (Indian time), a day after the surprise announcement by Prime Minister Narendra Modi and President Donald Trump of the reduction of US tariffs on Indian exports from 50% to 18% under the trade deal. Other than a confirmation about the slashing of the US tariffs, including the removal of a 25% punitive levy imposed by Trump over Russian energy purchases, few concrete details of the trade deal have emerged so far. The people cited above said on condition of anonymity that details about the next steps in repairing bilateral relations are expected to emerge following Jaishankars meetings with Rubio and other senior US officials, including those dealing with trade. The people added that there is a possibility of a joint statement to be unveiled later this week that will lay out the contours of the trade deal and the steps to be taken by both sides to implement the arrangements.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_5",
    "text": "Other than a confirmation about the slashing of the US tariffs, including the removal of a 25% punitive levy imposed by Trump over Russian energy purchases, few concrete details of the trade deal have emerged so far. The people cited above said on condition of anonymity that details about the next steps in repairing bilateral relations are expected to emerge following Jaishankars meetings with Rubio and other senior US officials, including those dealing with trade. The people added that there is a possibility of a joint statement to be unveiled later this week that will lay out the contours of the trade deal and the steps to be taken by both sides to implement the arrangements. A range of issues have been linked to the successful conclusion of the India-US trade deal, including a possible visit to India by Trump for a Quad Leaders Summit, which was originally to be hosted by India last year.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_6",
    "text": "The people cited above said on condition of anonymity that details about the next steps in repairing bilateral relations are expected to emerge following Jaishankars meetings with Rubio and other senior US officials, including those dealing with trade. The people added that there is a possibility of a joint statement to be unveiled later this week that will lay out the contours of the trade deal and the steps to be taken by both sides to implement the arrangements. A range of issues have been linked to the successful conclusion of the India-US trade deal, including a possible visit to India by Trump for a Quad Leaders Summit, which was originally to be hosted by India last year. The people said these issues are expected to figure in Jaishankars meetings in Washington.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_7",
    "text": "The people added that there is a possibility of a joint statement to be unveiled later this week that will lay out the contours of the trade deal and the steps to be taken by both sides to implement the arrangements. A range of issues have been linked to the successful conclusion of the India-US trade deal, including a possible visit to India by Trump for a Quad Leaders Summit, which was originally to be hosted by India last year. The people said these issues are expected to figure in Jaishankars meetings in Washington. While Indian officials have spoken about the trade deal, especially the reduction of tariffs, opening up new trade opportunities and collaboration in areas ranging from technology to manufacturing, Trump contended in a social media post that India had also agreed to stop buying Russian oil, and to buy more from the US and Venezuela, to reduce tariffs on US goods to zero, and to buy American goods, including energy and agricultural products, worth $500 billion.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_8",
    "text": "A range of issues have been linked to the successful conclusion of the India-US trade deal, including a possible visit to India by Trump for a Quad Leaders Summit, which was originally to be hosted by India last year. The people said these issues are expected to figure in Jaishankars meetings in Washington. While Indian officials have spoken about the trade deal, especially the reduction of tariffs, opening up new trade opportunities and collaboration in areas ranging from technology to manufacturing, Trump contended in a social media post that India had also agreed to stop buying Russian oil, and to buy more from the US and Venezuela, to reduce tariffs on US goods to zero, and to buy American goods, including energy and agricultural products, worth $500 billion. India-US relations were hit by strains not witnessed in the past two decades after Trump hit Indian goods with 50% tariffs last year, and there were few concrete signs of progress in concluding a bilateral trade agreement despite several rounds of formal and informal negotiations that continued till last month.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_9",
    "text": "The people said these issues are expected to figure in Jaishankars meetings in Washington. While Indian officials have spoken about the trade deal, especially the reduction of tariffs, opening up new trade opportunities and collaboration in areas ranging from technology to manufacturing, Trump contended in a social media post that India had also agreed to stop buying Russian oil, and to buy more from the US and Venezuela, to reduce tariffs on US goods to zero, and to buy American goods, including energy and agricultural products, worth $500 billion. India-US relations were hit by strains not witnessed in the past two decades after Trump hit Indian goods with 50% tariffs last year, and there were few concrete signs of progress in concluding a bilateral trade agreement despite several rounds of formal and informal negotiations that continued till last month. However, even as India concluded a massive trade deal with the European Union (EU) last month, Indian officials said New Delhi and Washington continued to be in touch and were hopeful of a positive outcome.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_10",
    "text": "While Indian officials have spoken about the trade deal, especially the reduction of tariffs, opening up new trade opportunities and collaboration in areas ranging from technology to manufacturing, Trump contended in a social media post that India had also agreed to stop buying Russian oil, and to buy more from the US and Venezuela, to reduce tariffs on US goods to zero, and to buy American goods, including energy and agricultural products, worth $500 billion. India-US relations were hit by strains not witnessed in the past two decades after Trump hit Indian goods with 50% tariffs last year, and there were few concrete signs of progress in concluding a bilateral trade agreement despite several rounds of formal and informal negotiations that continued till last month. However, even as India concluded a massive trade deal with the European Union (EU) last month, Indian officials said New Delhi and Washington continued to be in touch and were hopeful of a positive outcome. The ministerial meeting on critical minerals to be attended by representatives of the G7 member states and mineral-rich countries such as Congo, Guinea and Kenya will focus on supply chain resilience and strategic cooperation in rare earths.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  },
  {
    "chunk_id": "article_4_clean.json_11",
    "text": "India-US relations were hit by strains not witnessed in the past two decades after Trump hit Indian goods with 50% tariffs last year, and there were few concrete signs of progress in concluding a bilateral trade agreement despite several rounds of formal and informal negotiations that continued till last month. However, even as India concluded a massive trade deal with the European Union (EU) last month, Indian officials said New Delhi and Washington continued to be in touch and were hopeful of a positive outcome. The ministerial meeting on critical minerals to be attended by representatives of the G7 member states and mineral-rich countries such as Congo, Guinea and Kenya will focus on supply chain resilience and strategic cooperation in rare earths. India is also expected to join Pax Silica, the flagship US initiative to build a secure global supply chain for semiconductors and AI technology, after being left out when the venture was launched last year.",
    "metadata": {
      "title": "All eyes on Rubio and Jaishankars meeting today| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.595347"
    }
  }
]