[
  {
    "chunk_id": "article_15_clean.json_0",
    "text": "TITLE: Drama in House as UDF MLAs move to Speakers dais| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe Kerala Assembly on Tuesday witnessed heated scenes as opposition UDF MLAs attempted to enter the Speakers dais as part of their protests against the LDF government over the alleged slow pace of investigation in the Sabarimala gold theft case.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_1",
    "text": "TITLE: Drama in House as UDF MLAs move to Speakers dais| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe Kerala Assembly on Tuesday witnessed heated scenes as opposition UDF MLAs attempted to enter the Speakers dais as part of their protests against the LDF government over the alleged slow pace of investigation in the Sabarimala gold theft case. Since the beginning of the current session of the Assembly, the UDF led by the Congress has demanded the resignation of the state Devaswom minister VN Vasavan, citing his alleged lapses in overseeing a department in which several top officials are currently in jail for their involvement in the misappropriation of gold assets from the hill shrine.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_2",
    "text": "TITLE: Drama in House as UDF MLAs move to Speakers dais| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe Kerala Assembly on Tuesday witnessed heated scenes as opposition UDF MLAs attempted to enter the Speakers dais as part of their protests against the LDF government over the alleged slow pace of investigation in the Sabarimala gold theft case. Since the beginning of the current session of the Assembly, the UDF led by the Congress has demanded the resignation of the state Devaswom minister VN Vasavan, citing his alleged lapses in overseeing a department in which several top officials are currently in jail for their involvement in the misappropriation of gold assets from the hill shrine. The UDF has also alleged that the probe being conducted by the special investigation team (SIT) of the Kerala police and monitored by the high court has entered a slow phase with constant interference from the chief ministers office due to the upcoming Assembly elections.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_3",
    "text": "TITLE: Drama in House as UDF MLAs move to Speakers dais| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe Kerala Assembly on Tuesday witnessed heated scenes as opposition UDF MLAs attempted to enter the Speakers dais as part of their protests against the LDF government over the alleged slow pace of investigation in the Sabarimala gold theft case. Since the beginning of the current session of the Assembly, the UDF led by the Congress has demanded the resignation of the state Devaswom minister VN Vasavan, citing his alleged lapses in overseeing a department in which several top officials are currently in jail for their involvement in the misappropriation of gold assets from the hill shrine. The UDF has also alleged that the probe being conducted by the special investigation team (SIT) of the Kerala police and monitored by the high court has entered a slow phase with constant interference from the chief ministers office due to the upcoming Assembly elections. He said that the high court also observed that there was a laxity in the SIT probe.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_4",
    "text": "Since the beginning of the current session of the Assembly, the UDF led by the Congress has demanded the resignation of the state Devaswom minister VN Vasavan, citing his alleged lapses in overseeing a department in which several top officials are currently in jail for their involvement in the misappropriation of gold assets from the hill shrine. The UDF has also alleged that the probe being conducted by the special investigation team (SIT) of the Kerala police and monitored by the high court has entered a slow phase with constant interference from the chief ministers office due to the upcoming Assembly elections. He said that the high court also observed that there was a laxity in the SIT probe. On Tuesday, within seconds of the Question hour beginning in the Assembly, UDF MLAs trooped into the well of the House raising slogans against Vasavan and the LDF government and displaying a giant banner in front of the Speaker AN Shamseers dais, obstructing his view of the House proceedings.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_5",
    "text": "The UDF has also alleged that the probe being conducted by the special investigation team (SIT) of the Kerala police and monitored by the high court has entered a slow phase with constant interference from the chief ministers office due to the upcoming Assembly elections. He said that the high court also observed that there was a laxity in the SIT probe. On Tuesday, within seconds of the Question hour beginning in the Assembly, UDF MLAs trooped into the well of the House raising slogans against Vasavan and the LDF government and displaying a giant banner in front of the Speaker AN Shamseers dais, obstructing his view of the House proceedings. The Speaker objected to the UDF MLAs move and asked them to remove the banner so that he could conduct the House.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_6",
    "text": "He said that the high court also observed that there was a laxity in the SIT probe. On Tuesday, within seconds of the Question hour beginning in the Assembly, UDF MLAs trooped into the well of the House raising slogans against Vasavan and the LDF government and displaying a giant banner in front of the Speaker AN Shamseers dais, obstructing his view of the House proceedings. The Speaker objected to the UDF MLAs move and asked them to remove the banner so that he could conduct the House. The personnel of the watch and ward team struggled to control the MLAs.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_7",
    "text": "On Tuesday, within seconds of the Question hour beginning in the Assembly, UDF MLAs trooped into the well of the House raising slogans against Vasavan and the LDF government and displaying a giant banner in front of the Speaker AN Shamseers dais, obstructing his view of the House proceedings. The Speaker objected to the UDF MLAs move and asked them to remove the banner so that he could conduct the House. The personnel of the watch and ward team struggled to control the MLAs. During the heated protests, Congress MLA Anvar Sadath and IUML MLA TV Ibrahim attempted to breach the watch-and-ward cordon and advance towards Speakers chair.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_8",
    "text": "The Speaker objected to the UDF MLAs move and asked them to remove the banner so that he could conduct the House. The personnel of the watch and ward team struggled to control the MLAs. During the heated protests, Congress MLA Anvar Sadath and IUML MLA TV Ibrahim attempted to breach the watch-and-ward cordon and advance towards Speakers chair. At this point, the Speaker stood up from his chair and adjourned the House for a few minutes around 9.40 am.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_9",
    "text": "The personnel of the watch and ward team struggled to control the MLAs. During the heated protests, Congress MLA Anvar Sadath and IUML MLA TV Ibrahim attempted to breach the watch-and-ward cordon and advance towards Speakers chair. At this point, the Speaker stood up from his chair and adjourned the House for a few minutes around 9.40 am. When the House reconvened, the UDF MLAs resumed their protests, drowning its proceedings and obstructing the Question Hour.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_10",
    "text": "During the heated protests, Congress MLA Anvar Sadath and IUML MLA TV Ibrahim attempted to breach the watch-and-ward cordon and advance towards Speakers chair. At this point, the Speaker stood up from his chair and adjourned the House for a few minutes around 9.40 am. When the House reconvened, the UDF MLAs resumed their protests, drowning its proceedings and obstructing the Question Hour. This forced the Speaker to take a second break to restore normalcy in the House.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_11",
    "text": "At this point, the Speaker stood up from his chair and adjourned the House for a few minutes around 9.40 am. When the House reconvened, the UDF MLAs resumed their protests, drowning its proceedings and obstructing the Question Hour. This forced the Speaker to take a second break to restore normalcy in the House. Upon resumption of the House, Leader of the opposition VD Satheesan declared that the UDF would stage a walk out from the Assembly in protest against the Speakers denial to hold an adjournment motion discussion on the Sabarimala theft case and the ongoing SIT investigation.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_12",
    "text": "When the House reconvened, the UDF MLAs resumed their protests, drowning its proceedings and obstructing the Question Hour. This forced the Speaker to take a second break to restore normalcy in the House. Upon resumption of the House, Leader of the opposition VD Satheesan declared that the UDF would stage a walk out from the Assembly in protest against the Speakers denial to hold an adjournment motion discussion on the Sabarimala theft case and the ongoing SIT investigation. Satheesan later told reporters, The SIT probe in the Sabarimala case has come to a grinding halt.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_13",
    "text": "This forced the Speaker to take a second break to restore normalcy in the House. Upon resumption of the House, Leader of the opposition VD Satheesan declared that the UDF would stage a walk out from the Assembly in protest against the Speakers denial to hold an adjournment motion discussion on the Sabarimala theft case and the ongoing SIT investigation. Satheesan later told reporters, The SIT probe in the Sabarimala case has come to a grinding halt. With the preliminary charge sheet not being filed within 90 days, all the accused are being released on bail.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_14",
    "text": "Upon resumption of the House, Leader of the opposition VD Satheesan declared that the UDF would stage a walk out from the Assembly in protest against the Speakers denial to hold an adjournment motion discussion on the Sabarimala theft case and the ongoing SIT investigation. Satheesan later told reporters, The SIT probe in the Sabarimala case has come to a grinding halt. With the preliminary charge sheet not being filed within 90 days, all the accused are being released on bail. The main accused Unnikrishnan Potty and three CPM leaders will come out of jail soon.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_15",
    "text": "Satheesan later told reporters, The SIT probe in the Sabarimala case has come to a grinding halt. With the preliminary charge sheet not being filed within 90 days, all the accused are being released on bail. The main accused Unnikrishnan Potty and three CPM leaders will come out of jail soon. There are efforts to get all the accused out and destroy evidence in the case so that the investigation reaches nowhere. The UDF has only conducted protests inside and outside the House against this.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_16",
    "text": "The main accused Unnikrishnan Potty and three CPM leaders will come out of jail soon. There are efforts to get all the accused out and destroy evidence in the case so that the investigation reaches nowhere. The UDF has only conducted protests inside and outside the House against this. Regarding the opposition conduct in the House, Satheesan said that the watch-and-ward personnel provoked the opposition by tearing away their banner.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_17",
    "text": "There are efforts to get all the accused out and destroy evidence in the case so that the investigation reaches nowhere. The UDF has only conducted protests inside and outside the House against this. Regarding the opposition conduct in the House, Satheesan said that the watch-and-ward personnel provoked the opposition by tearing away their banner. Speaker AN Shamseer hit back, stating that the democratic rights in the House belonged not to the opposition alone, but also to the Speaker.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_18",
    "text": "The UDF has only conducted protests inside and outside the House against this. Regarding the opposition conduct in the House, Satheesan said that the watch-and-ward personnel provoked the opposition by tearing away their banner. Speaker AN Shamseer hit back, stating that the democratic rights in the House belonged not to the opposition alone, but also to the Speaker. You tried to make the Speaker blind. You obstructed the Speakers vision.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_19",
    "text": "Speaker AN Shamseer hit back, stating that the democratic rights in the House belonged not to the opposition alone, but also to the Speaker. You tried to make the Speaker blind. You obstructed the Speakers vision. You should think whether what you did was right or wrong, he said. Chief minister Pinarayi Vijayan termed the opposition conduct as unfortunate and deplorable.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_20",
    "text": "You obstructed the Speakers vision. You should think whether what you did was right or wrong, he said. Chief minister Pinarayi Vijayan termed the opposition conduct as unfortunate and deplorable. The CM also said that it was the division bench of the high court which was monitoring the SIT probe and that it has not said anything adverse about the investigation.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_21",
    "text": "You should think whether what you did was right or wrong, he said. Chief minister Pinarayi Vijayan termed the opposition conduct as unfortunate and deplorable. The CM also said that it was the division bench of the high court which was monitoring the SIT probe and that it has not said anything adverse about the investigation. Law and industries minister P Rajeev said the opposition has betrayed its earlier stated position that it would serve as a creative opposition.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_22",
    "text": "Chief minister Pinarayi Vijayan termed the opposition conduct as unfortunate and deplorable. The CM also said that it was the division bench of the high court which was monitoring the SIT probe and that it has not said anything adverse about the investigation. Law and industries minister P Rajeev said the opposition has betrayed its earlier stated position that it would serve as a creative opposition. The opposition did not submit any notice for the discussion. It doesnt want a discussion.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  },
  {
    "chunk_id": "article_15_clean.json_23",
    "text": "Law and industries minister P Rajeev said the opposition has betrayed its earlier stated position that it would serve as a creative opposition. The opposition did not submit any notice for the discussion. It doesnt want a discussion. Rather, it wants to avoid a discussion on the issue, he said.",
    "metadata": {
      "title": "Drama in House as UDF MLAs move to Speakers dais| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.944026"
    }
  }
]