[
  {
    "chunk_id": "article_14_clean.json_0",
    "text": "",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_1",
    "text": "TITLE: YSRCP MPs protest against attacks on leaders before Parliament| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe YSR Congress Party (YSRCP) parliamentarians on Tuesday staged a protest demonstration at Parliament House in New Delhi against the attacks on their party leaders and former ministers Ambati Rambabu and Jogi Ramesh allegedly by the Telugu Desam Party cadre in Andhra Pradesh and demanded imposition of Presidents Rule in the state in the wake of deterioration of law-and-order.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_2",
    "text": "TITLE: YSRCP MPs protest against attacks on leaders before Parliament| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe YSR Congress Party (YSRCP) parliamentarians on Tuesday staged a protest demonstration at Parliament House in New Delhi against the attacks on their party leaders and former ministers Ambati Rambabu and Jogi Ramesh allegedly by the Telugu Desam Party cadre in Andhra Pradesh and demanded imposition of Presidents Rule in the state in the wake of deterioration of law-and-order. Party MPs YS Avinash Reddy, Maddila Gurumoorthy, P V Mithun Reddy and G Tanuja from Lok Sabha, YV Subba Reddy, Golla Babu Rao, Meda Raghunath Reddy and Pilli Subhash Chandra Bose from Rajya Sabha took part in the protests.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_3",
    "text": "TITLE: YSRCP MPs protest against attacks on leaders before Parliament| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe YSR Congress Party (YSRCP) parliamentarians on Tuesday staged a protest demonstration at Parliament House in New Delhi against the attacks on their party leaders and former ministers Ambati Rambabu and Jogi Ramesh allegedly by the Telugu Desam Party cadre in Andhra Pradesh and demanded imposition of Presidents Rule in the state in the wake of deterioration of law-and-order. Party MPs YS Avinash Reddy, Maddila Gurumoorthy, P V Mithun Reddy and G Tanuja from Lok Sabha, YV Subba Reddy, Golla Babu Rao, Meda Raghunath Reddy and Pilli Subhash Chandra Bose from Rajya Sabha took part in the protests. The MPs displayed the photographs of the vandalism and arson allegedly resorted to by the TDP cadre at the residences of the YSRCP leaders in Guntur and Ibrahimpatnam in NTR district on Saturday and Sunday.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_4",
    "text": "TITLE: YSRCP MPs protest against attacks on leaders before Parliament| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe YSR Congress Party (YSRCP) parliamentarians on Tuesday staged a protest demonstration at Parliament House in New Delhi against the attacks on their party leaders and former ministers Ambati Rambabu and Jogi Ramesh allegedly by the Telugu Desam Party cadre in Andhra Pradesh and demanded imposition of Presidents Rule in the state in the wake of deterioration of law-and-order. Party MPs YS Avinash Reddy, Maddila Gurumoorthy, P V Mithun Reddy and G Tanuja from Lok Sabha, YV Subba Reddy, Golla Babu Rao, Meda Raghunath Reddy and Pilli Subhash Chandra Bose from Rajya Sabha took part in the protests. The MPs displayed the photographs of the vandalism and arson allegedly resorted to by the TDP cadre at the residences of the YSRCP leaders in Guntur and Ibrahimpatnam in NTR district on Saturday and Sunday. They raised slogans and demanded deployment of central forces in the state and promulgation of Presidents Rule in the state, a party statement said.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_5",
    "text": "Party MPs YS Avinash Reddy, Maddila Gurumoorthy, P V Mithun Reddy and G Tanuja from Lok Sabha, YV Subba Reddy, Golla Babu Rao, Meda Raghunath Reddy and Pilli Subhash Chandra Bose from Rajya Sabha took part in the protests. The MPs displayed the photographs of the vandalism and arson allegedly resorted to by the TDP cadre at the residences of the YSRCP leaders in Guntur and Ibrahimpatnam in NTR district on Saturday and Sunday. They raised slogans and demanded deployment of central forces in the state and promulgation of Presidents Rule in the state, a party statement said. Raising the issue in Rajya Sabha, YSRCP MP Golla Babu Rao alleged that law-and-order was deteriorating in the state and sought Central intervention.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_6",
    "text": "The MPs displayed the photographs of the vandalism and arson allegedly resorted to by the TDP cadre at the residences of the YSRCP leaders in Guntur and Ibrahimpatnam in NTR district on Saturday and Sunday. They raised slogans and demanded deployment of central forces in the state and promulgation of Presidents Rule in the state, a party statement said. Raising the issue in Rajya Sabha, YSRCP MP Golla Babu Rao alleged that law-and-order was deteriorating in the state and sought Central intervention. Participating in the debate on the motion of thanks to the Presidents address, Babu Rao told the Upper House that the law-and-order situation in the state had turned from bad to worse.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_7",
    "text": "They raised slogans and demanded deployment of central forces in the state and promulgation of Presidents Rule in the state, a party statement said. Raising the issue in Rajya Sabha, YSRCP MP Golla Babu Rao alleged that law-and-order was deteriorating in the state and sought Central intervention. Participating in the debate on the motion of thanks to the Presidents address, Babu Rao told the Upper House that the law-and-order situation in the state had turned from bad to worse. PM Narendra Modi and Union home minister Amit Shah should intervene, as lawlessness is prevailing in the State, with unabated attacks on political opponents, destruction of their houses, and arson, he said.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_8",
    "text": "Raising the issue in Rajya Sabha, YSRCP MP Golla Babu Rao alleged that law-and-order was deteriorating in the state and sought Central intervention. Participating in the debate on the motion of thanks to the Presidents address, Babu Rao told the Upper House that the law-and-order situation in the state had turned from bad to worse. PM Narendra Modi and Union home minister Amit Shah should intervene, as lawlessness is prevailing in the State, with unabated attacks on political opponents, destruction of their houses, and arson, he said. Meanwhile, the Pattabhipuram police in Guntur on Tuesday registered a case against TDP lawmaker from Guntur (West) Galla Madhavi in connection with the alleged attack on the office and residence of Ambati Rambabu.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_9",
    "text": "Participating in the debate on the motion of thanks to the Presidents address, Babu Rao told the Upper House that the law-and-order situation in the state had turned from bad to worse. PM Narendra Modi and Union home minister Amit Shah should intervene, as lawlessness is prevailing in the State, with unabated attacks on political opponents, destruction of their houses, and arson, he said. Meanwhile, the Pattabhipuram police in Guntur on Tuesday registered a case against TDP lawmaker from Guntur (West) Galla Madhavi in connection with the alleged attack on the office and residence of Ambati Rambabu. A police statement said cases have been lodged against Madhavi, her husband Galla Ramachandra Rao and 30 other TDP leaders and workers in relation to the incident under BNS sections 189(2), 190, 292 and 324(4).",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_10",
    "text": "PM Narendra Modi and Union home minister Amit Shah should intervene, as lawlessness is prevailing in the State, with unabated attacks on political opponents, destruction of their houses, and arson, he said. Meanwhile, the Pattabhipuram police in Guntur on Tuesday registered a case against TDP lawmaker from Guntur (West) Galla Madhavi in connection with the alleged attack on the office and residence of Ambati Rambabu. A police statement said cases have been lodged against Madhavi, her husband Galla Ramachandra Rao and 30 other TDP leaders and workers in relation to the incident under BNS sections 189(2), 190, 292 and 324(4). Reacting to the case, Madhavi dismissed allegations that she had instigated party workers and questioned the basis of the charges.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_11",
    "text": "Meanwhile, the Pattabhipuram police in Guntur on Tuesday registered a case against TDP lawmaker from Guntur (West) Galla Madhavi in connection with the alleged attack on the office and residence of Ambati Rambabu. A police statement said cases have been lodged against Madhavi, her husband Galla Ramachandra Rao and 30 other TDP leaders and workers in relation to the incident under BNS sections 189(2), 190, 292 and 324(4). Reacting to the case, Madhavi dismissed allegations that she had instigated party workers and questioned the basis of the charges. Where is the evidence that I provoked the activists?",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_12",
    "text": "A police statement said cases have been lodged against Madhavi, her husband Galla Ramachandra Rao and 30 other TDP leaders and workers in relation to the incident under BNS sections 189(2), 190, 292 and 324(4). Reacting to the case, Madhavi dismissed allegations that she had instigated party workers and questioned the basis of the charges. Where is the evidence that I provoked the activists? She also criticised Rambabu for allegedly changing his statements regarding comments made against chief minister N Chandrababu Naidu, calling it laughable that he now claims the remarks were made spur of the moment.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_13",
    "text": "Reacting to the case, Madhavi dismissed allegations that she had instigated party workers and questioned the basis of the charges. Where is the evidence that I provoked the activists? She also criticised Rambabu for allegedly changing his statements regarding comments made against chief minister N Chandrababu Naidu, calling it laughable that he now claims the remarks were made spur of the moment. Referring to attacks on women workers, Madhavi pointed out what she termed as selective outrage.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_14",
    "text": "Where is the evidence that I provoked the activists? She also criticised Rambabu for allegedly changing his statements regarding comments made against chief minister N Chandrababu Naidu, calling it laughable that he now claims the remarks were made spur of the moment. Referring to attacks on women workers, Madhavi pointed out what she termed as selective outrage. Ambatis daughter speaks about attacks on women, but why didnt she question her father when our woman activist was attacked near his office?",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_15",
    "text": "She also criticised Rambabu for allegedly changing his statements regarding comments made against chief minister N Chandrababu Naidu, calling it laughable that he now claims the remarks were made spur of the moment. Referring to attacks on women workers, Madhavi pointed out what she termed as selective outrage. Ambatis daughter speaks about attacks on women, but why didnt she question her father when our woman activist was attacked near his office? she said.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  },
  {
    "chunk_id": "article_14_clean.json_16",
    "text": "Referring to attacks on women workers, Madhavi pointed out what she termed as selective outrage. Ambatis daughter speaks about attacks on women, but why didnt she question her father when our woman activist was attacked near his office? she said. Madhavi also accused her opponents of using caste for political mileage. When your father spoke about Pawan Kalyan, didnt caste come to mind then? Why is caste being used now? she questioned.",
    "metadata": {
      "title": "YSRCP MPs protest against attacks on leaders before Parliament| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.586681"
    }
  }
]