[
  {
    "chunk_id": "article_16_clean.json_0",
    "text": "TITLE: Annamalai steps down as election in-charge of six assembly seats| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nFormer Tamil Nadu BJP president K Annamalai on Tuesday stepped down from the responsibility of being the partys election in-charge for six assembly constituencies for the upcoming assembly elections.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_1",
    "text": "TITLE: Annamalai steps down as election in-charge of six assembly seats| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nFormer Tamil Nadu BJP president K Annamalai on Tuesday stepped down from the responsibility of being the partys election in-charge for six assembly constituencies for the upcoming assembly elections. Although Annamalai had cited his fathers ill-health as reason, people aware of the matter said that the leader was upset over being restricted with only six out of the 234 assembly seats.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_2",
    "text": "TITLE: Annamalai steps down as election in-charge of six assembly seats| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nFormer Tamil Nadu BJP president K Annamalai on Tuesday stepped down from the responsibility of being the partys election in-charge for six assembly constituencies for the upcoming assembly elections. Although Annamalai had cited his fathers ill-health as reason, people aware of the matter said that the leader was upset over being restricted with only six out of the 234 assembly seats. ALSO READ | Annamalai namesake and Shiv Sena (UBT) candidate shrugs off row Annamalai had said that he had to stay put in Coimbatore district where his family is based to help his father so he wouldnt be able to travel on election duty.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_3",
    "text": "TITLE: Annamalai steps down as election in-charge of six assembly seats| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nFormer Tamil Nadu BJP president K Annamalai on Tuesday stepped down from the responsibility of being the partys election in-charge for six assembly constituencies for the upcoming assembly elections. Although Annamalai had cited his fathers ill-health as reason, people aware of the matter said that the leader was upset over being restricted with only six out of the 234 assembly seats. ALSO READ | Annamalai namesake and Shiv Sena (UBT) candidate shrugs off row Annamalai had said that he had to stay put in Coimbatore district where his family is based to help his father so he wouldnt be able to travel on election duty. I have conveyed to the High Command that I wont be able to carry out my responsibilities since my father is unwell and I have to care for him..I wont be able to travel muchthats why you will see me often in Coimbatore, Annamalai said on Tuesday.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_4",
    "text": "Although Annamalai had cited his fathers ill-health as reason, people aware of the matter said that the leader was upset over being restricted with only six out of the 234 assembly seats. ALSO READ | Annamalai namesake and Shiv Sena (UBT) candidate shrugs off row Annamalai had said that he had to stay put in Coimbatore district where his family is based to help his father so he wouldnt be able to travel on election duty. I have conveyed to the High Command that I wont be able to carry out my responsibilities since my father is unwell and I have to care for him..I wont be able to travel muchthats why you will see me often in Coimbatore, Annamalai said on Tuesday. ALSO READ | I am not afraid of Thackeray familys threats: Annamalai However, he said that he would campaign for the party and its allies.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_5",
    "text": "ALSO READ | Annamalai namesake and Shiv Sena (UBT) candidate shrugs off row Annamalai had said that he had to stay put in Coimbatore district where his family is based to help his father so he wouldnt be able to travel on election duty. I have conveyed to the High Command that I wont be able to carry out my responsibilities since my father is unwell and I have to care for him..I wont be able to travel muchthats why you will see me often in Coimbatore, Annamalai said on Tuesday. ALSO READ | I am not afraid of Thackeray familys threats: Annamalai However, he said that he would campaign for the party and its allies. Annamalai evaded a question on whether he would contest the assembly elections.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_6",
    "text": "I have conveyed to the High Command that I wont be able to carry out my responsibilities since my father is unwell and I have to care for him..I wont be able to travel muchthats why you will see me often in Coimbatore, Annamalai said on Tuesday. ALSO READ | I am not afraid of Thackeray familys threats: Annamalai However, he said that he would campaign for the party and its allies. Annamalai evaded a question on whether he would contest the assembly elections. Annamalai, had earlier stepped down as the state head to bring back the AIADMK into the BJPs fold back in April 2025.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_7",
    "text": "ALSO READ | I am not afraid of Thackeray familys threats: Annamalai However, he said that he would campaign for the party and its allies. Annamalai evaded a question on whether he would contest the assembly elections. Annamalai, had earlier stepped down as the state head to bring back the AIADMK into the BJPs fold back in April 2025. The AIADMK had in 2024 quit the BJP-led NDA blaming Annamalai for calling Dravidian stalwarts corrupt.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_8",
    "text": "Annamalai evaded a question on whether he would contest the assembly elections. Annamalai, had earlier stepped down as the state head to bring back the AIADMK into the BJPs fold back in April 2025. The AIADMK had in 2024 quit the BJP-led NDA blaming Annamalai for calling Dravidian stalwarts corrupt. Annamalai had been against an alliance with the AIADMK but after the reunion he committed to working for the alliance. ALSO READ | Tamil Nadu BJP set to get next chief; what now for Annamalai?",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_9",
    "text": "The AIADMK had in 2024 quit the BJP-led NDA blaming Annamalai for calling Dravidian stalwarts corrupt. Annamalai had been against an alliance with the AIADMK but after the reunion he committed to working for the alliance. ALSO READ | Tamil Nadu BJP set to get next chief; what now for Annamalai? Amit Shah answers Current Tamil Nadu BJP president Nainar Nagenthiran had last week appointed Annamalai as the election in-charge for assembly constituencies of Karaikudi, Singanallur, Srivaikuntam, Virugambakkam, Madurai (South), and Padmanabhapuram.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_10",
    "text": "Annamalai had been against an alliance with the AIADMK but after the reunion he committed to working for the alliance. ALSO READ | Tamil Nadu BJP set to get next chief; what now for Annamalai? Amit Shah answers Current Tamil Nadu BJP president Nainar Nagenthiran had last week appointed Annamalai as the election in-charge for assembly constituencies of Karaikudi, Singanallur, Srivaikuntam, Virugambakkam, Madurai (South), and Padmanabhapuram. He brought the BJP to the spotlight in Tamil Nadu.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  },
  {
    "chunk_id": "article_16_clean.json_11",
    "text": "ALSO READ | Tamil Nadu BJP set to get next chief; what now for Annamalai? Amit Shah answers Current Tamil Nadu BJP president Nainar Nagenthiran had last week appointed Annamalai as the election in-charge for assembly constituencies of Karaikudi, Singanallur, Srivaikuntam, Virugambakkam, Madurai (South), and Padmanabhapuram. He brought the BJP to the spotlight in Tamil Nadu. He should have been one of the star campaigners, said a BJP state leader, on the condition of anonymity.",
    "metadata": {
      "title": "Annamalai steps down as election in-charge of six assembly seats| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:24.293022"
    }
  }
]