[
  {
    "chunk_id": "article_34_clean.json_0",
    "text": "TITLE: Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA Turkish Airlines flight travelling from Kathmandu to Istanbul with 236 passengers and 11 crew members made an emergency landing at Netaji Subhash Chandra Bose International Airport in West Bengal on Wednesday afternoon after the pilot suspected that the right engine had caught fire, airport officials said.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_1",
    "text": "TITLE: Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA Turkish Airlines flight travelling from Kathmandu to Istanbul with 236 passengers and 11 crew members made an emergency landing at Netaji Subhash Chandra Bose International Airport in West Bengal on Wednesday afternoon after the pilot suspected that the right engine had caught fire, airport officials said. The pilot contacted the Kolkata air traffic control (ATC), saying he needed to make an emergency landing.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_2",
    "text": "TITLE: Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA Turkish Airlines flight travelling from Kathmandu to Istanbul with 236 passengers and 11 crew members made an emergency landing at Netaji Subhash Chandra Bose International Airport in West Bengal on Wednesday afternoon after the pilot suspected that the right engine had caught fire, airport officials said. The pilot contacted the Kolkata air traffic control (ATC), saying he needed to make an emergency landing. All emergency procedures were followed and fire tenders were called in.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_3",
    "text": "TITLE: Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA Turkish Airlines flight travelling from Kathmandu to Istanbul with 236 passengers and 11 crew members made an emergency landing at Netaji Subhash Chandra Bose International Airport in West Bengal on Wednesday afternoon after the pilot suspected that the right engine had caught fire, airport officials said. The pilot contacted the Kolkata air traffic control (ATC), saying he needed to make an emergency landing. All emergency procedures were followed and fire tenders were called in. The plane, however, landed safely, although it flew with only one engine for more than an hour, an airport official said.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_4",
    "text": "The pilot contacted the Kolkata air traffic control (ATC), saying he needed to make an emergency landing. All emergency procedures were followed and fire tenders were called in. The plane, however, landed safely, although it flew with only one engine for more than an hour, an airport official said. Also Read | Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport An alert was reportedly heard at Tribhuvan International Airport in Kathmandu as the right engine caught fire soon after take-off.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_5",
    "text": "All emergency procedures were followed and fire tenders were called in. The plane, however, landed safely, although it flew with only one engine for more than an hour, an airport official said. Also Read | Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport An alert was reportedly heard at Tribhuvan International Airport in Kathmandu as the right engine caught fire soon after take-off. The pilot shut off the right engine immediately after he suspected the fire.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_6",
    "text": "The plane, however, landed safely, although it flew with only one engine for more than an hour, an airport official said. Also Read | Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport An alert was reportedly heard at Tribhuvan International Airport in Kathmandu as the right engine caught fire soon after take-off. The pilot shut off the right engine immediately after he suspected the fire. Instead of returning to Kathmandu, the plane landed at the Kolkata airport at 2.50 pm and was taken to a safe area for inspection after the passengers and crew disembarked, the official added.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  },
  {
    "chunk_id": "article_34_clean.json_7",
    "text": "Also Read | Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport An alert was reportedly heard at Tribhuvan International Airport in Kathmandu as the right engine caught fire soon after take-off. The pilot shut off the right engine immediately after he suspected the fire. Instead of returning to Kathmandu, the plane landed at the Kolkata airport at 2.50 pm and was taken to a safe area for inspection after the passengers and crew disembarked, the official added. The Turkish Airlines flight number THY-727 caught fire within four minutes of take-off at 1:28 pm (local time), general manager of Tribhuvan International Airport Teknath Sitaula told ANI.",
    "metadata": {
      "title": "Kathmandu-Istanbul Turkish Airlines flight makes emergency landing at Kolkata airport over engine fire| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:30.723072"
    }
  }
]