[
  {
    "chunk_id": "article_1_clean.json_0",
    "text": "TITLE: Exciting opportunity: Trump admin officials hail India deal| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nSenior Trump administration officials on Tuesday welcomed the India-US trade deal announced by Prime Minister Narendra Modi and US President Donald Trump, citing increased market access for US products to the Indian market.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_1",
    "text": "TITLE: Exciting opportunity: Trump admin officials hail India deal| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nSenior Trump administration officials on Tuesday welcomed the India-US trade deal announced by Prime Minister Narendra Modi and US President Donald Trump, citing increased market access for US products to the Indian market. US agriculture secretary Brooke Rollins and trade representative Jamieson Greer argued that the deal would help America manage its roughly $46 billion trade deficit with India.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_2",
    "text": "TITLE: Exciting opportunity: Trump admin officials hail India deal| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nSenior Trump administration officials on Tuesday welcomed the India-US trade deal announced by Prime Minister Narendra Modi and US President Donald Trump, citing increased market access for US products to the Indian market. US agriculture secretary Brooke Rollins and trade representative Jamieson Greer argued that the deal would help America manage its roughly $46 billion trade deficit with India. Now, we have the deal we will finish papering it.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_3",
    "text": "TITLE: Exciting opportunity: Trump admin officials hail India deal| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nSenior Trump administration officials on Tuesday welcomed the India-US trade deal announced by Prime Minister Narendra Modi and US President Donald Trump, citing increased market access for US products to the Indian market. US agriculture secretary Brooke Rollins and trade representative Jamieson Greer argued that the deal would help America manage its roughly $46 billion trade deficit with India. Now, we have the deal we will finish papering it. We know the specifics.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_4",
    "text": "US agriculture secretary Brooke Rollins and trade representative Jamieson Greer argued that the deal would help America manage its roughly $46 billion trade deficit with India. Now, we have the deal we will finish papering it. We know the specifics. We know the details. Its a very exciting opportunity.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_5",
    "text": "We know the specifics. We know the details. Its a very exciting opportunity. On the one hand, well continue to maintain some level of tariff against India at 18% because we have this giant trade deficit with them but theyve also agreed to reduce their tariffs for us on a variety of agricultural products, manufactured goods, chemicals, medical devices, etc, Greer said in a television interview on Tuesday.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_6",
    "text": "We know the details. Its a very exciting opportunity. On the one hand, well continue to maintain some level of tariff against India at 18% because we have this giant trade deficit with them but theyve also agreed to reduce their tariffs for us on a variety of agricultural products, manufactured goods, chemicals, medical devices, etc, Greer said in a television interview on Tuesday. As Americas top trade official, Greer has played a key role in negotiating the trade agreement with India along with Assistant US Trade Representative Brendan Lynch.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_7",
    "text": "Its a very exciting opportunity. On the one hand, well continue to maintain some level of tariff against India at 18% because we have this giant trade deficit with them but theyve also agreed to reduce their tariffs for us on a variety of agricultural products, manufactured goods, chemicals, medical devices, etc, Greer said in a television interview on Tuesday. As Americas top trade official, Greer has played a key role in negotiating the trade agreement with India along with Assistant US Trade Representative Brendan Lynch. In addition, Greer stated that Indias average industrial tariff of 13.5% would go to zero on virtually all goods, while agricultural tariffs would also be cut to zero for a number of goods.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_8",
    "text": "On the one hand, well continue to maintain some level of tariff against India at 18% because we have this giant trade deficit with them but theyve also agreed to reduce their tariffs for us on a variety of agricultural products, manufactured goods, chemicals, medical devices, etc, Greer said in a television interview on Tuesday. As Americas top trade official, Greer has played a key role in negotiating the trade agreement with India along with Assistant US Trade Representative Brendan Lynch. In addition, Greer stated that Indias average industrial tariff of 13.5% would go to zero on virtually all goods, while agricultural tariffs would also be cut to zero for a number of goods. Greer, however, noted that India would continue to maintain some protection on agricultural products.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_9",
    "text": "As Americas top trade official, Greer has played a key role in negotiating the trade agreement with India along with Assistant US Trade Representative Brendan Lynch. In addition, Greer stated that Indias average industrial tariff of 13.5% would go to zero on virtually all goods, while agricultural tariffs would also be cut to zero for a number of goods. Greer, however, noted that India would continue to maintain some protection on agricultural products. On the agricultural side, there is a vast array of agricultural goods that will go to zero.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_10",
    "text": "In addition, Greer stated that Indias average industrial tariff of 13.5% would go to zero on virtually all goods, while agricultural tariffs would also be cut to zero for a number of goods. Greer, however, noted that India would continue to maintain some protection on agricultural products. On the agricultural side, there is a vast array of agricultural goods that will go to zero. India, like every country in the world including the United States, has some protection around some certain key areas and they will continue to control that.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_11",
    "text": "Greer, however, noted that India would continue to maintain some protection on agricultural products. On the agricultural side, there is a vast array of agricultural goods that will go to zero. India, like every country in the world including the United States, has some protection around some certain key areas and they will continue to control that. We will continue to work on access.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_12",
    "text": "On the agricultural side, there is a vast array of agricultural goods that will go to zero. India, like every country in the world including the United States, has some protection around some certain key areas and they will continue to control that. We will continue to work on access. But, for a variety of products like tree nuts, wines, spirits, fruits and vegetables, they (tariffs) are going down to zero. This is a big win, Greer said.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_13",
    "text": "We will continue to work on access. But, for a variety of products like tree nuts, wines, spirits, fruits and vegetables, they (tariffs) are going down to zero. This is a big win, Greer said. He added that the two sides have also reached an understanding that technical barriers to trade and non-tariff barriers would also be addressed. This would include a process to accept US standards, which would be a key part of the trade agreement.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_14",
    "text": "This is a big win, Greer said. He added that the two sides have also reached an understanding that technical barriers to trade and non-tariff barriers would also be addressed. This would include a process to accept US standards, which would be a key part of the trade agreement. Greer also said the US was monitoring Indian purchases of energy from Russia and the United States.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_15",
    "text": "He added that the two sides have also reached an understanding that technical barriers to trade and non-tariff barriers would also be addressed. This would include a process to accept US standards, which would be a key part of the trade agreement. Greer also said the US was monitoring Indian purchases of energy from Russia and the United States. Agriculture Secretary Brooke Rollins, meanwhile, highlighted the prospect of reducing Americas $1.3 billion agricultural trade deficit in India.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_16",
    "text": "This would include a process to accept US standards, which would be a key part of the trade agreement. Greer also said the US was monitoring Indian purchases of energy from Russia and the United States. Agriculture Secretary Brooke Rollins, meanwhile, highlighted the prospect of reducing Americas $1.3 billion agricultural trade deficit in India. Thank you @POTUS for ONCE AGAIN delivering for our American farmers.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_17",
    "text": "Greer also said the US was monitoring Indian purchases of energy from Russia and the United States. Agriculture Secretary Brooke Rollins, meanwhile, highlighted the prospect of reducing Americas $1.3 billion agricultural trade deficit in India. Thank you @POTUS for ONCE AGAIN delivering for our American farmers. New US-India deal will export more American farm products to Indias massive market, lifting prices, and pumping cash into rural America.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_18",
    "text": "Agriculture Secretary Brooke Rollins, meanwhile, highlighted the prospect of reducing Americas $1.3 billion agricultural trade deficit in India. Thank you @POTUS for ONCE AGAIN delivering for our American farmers. New US-India deal will export more American farm products to Indias massive market, lifting prices, and pumping cash into rural America. In 2024, Americas agricultural trade deficit with India was $1.3 billion.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_19",
    "text": "Thank you @POTUS for ONCE AGAIN delivering for our American farmers. New US-India deal will export more American farm products to Indias massive market, lifting prices, and pumping cash into rural America. In 2024, Americas agricultural trade deficit with India was $1.3 billion. Indias growing population is an important market for American agricultural products and todays deal will go a long way to reducing this deficit.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_20",
    "text": "New US-India deal will export more American farm products to Indias massive market, lifting prices, and pumping cash into rural America. In 2024, Americas agricultural trade deficit with India was $1.3 billion. Indias growing population is an important market for American agricultural products and todays deal will go a long way to reducing this deficit. America First victory on top of the dozens of deals for ag, Rollins said in a post on X.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_21",
    "text": "In 2024, Americas agricultural trade deficit with India was $1.3 billion. Indias growing population is an important market for American agricultural products and todays deal will go a long way to reducing this deficit. America First victory on top of the dozens of deals for ag, Rollins said in a post on X. In addition, White House Press Secretary Karoline Leavitt shared an article on X suggesting that India had agreed to stop buying Russian oil as part of a trade deal with India.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_22",
    "text": "Indias growing population is an important market for American agricultural products and todays deal will go a long way to reducing this deficit. America First victory on top of the dozens of deals for ag, Rollins said in a post on X. In addition, White House Press Secretary Karoline Leavitt shared an article on X suggesting that India had agreed to stop buying Russian oil as part of a trade deal with India. The India-US trade deal, which was announced late on Monday, saw the 50% tariff on India slashed to 18%, one of the lowest tariff rates for an Asian economy.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_23",
    "text": "America First victory on top of the dozens of deals for ag, Rollins said in a post on X. In addition, White House Press Secretary Karoline Leavitt shared an article on X suggesting that India had agreed to stop buying Russian oil as part of a trade deal with India. The India-US trade deal, which was announced late on Monday, saw the 50% tariff on India slashed to 18%, one of the lowest tariff rates for an Asian economy. In a Truth Social post, President Trump claimed that New Delhi had committed to eliminating purchases of Russian energy and to buying $500 billion worth of US technology, energy and other products.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_24",
    "text": "In addition, White House Press Secretary Karoline Leavitt shared an article on X suggesting that India had agreed to stop buying Russian oil as part of a trade deal with India. The India-US trade deal, which was announced late on Monday, saw the 50% tariff on India slashed to 18%, one of the lowest tariff rates for an Asian economy. In a Truth Social post, President Trump claimed that New Delhi had committed to eliminating purchases of Russian energy and to buying $500 billion worth of US technology, energy and other products. In addition, Trump stated that India had agreed to eliminate tariff and non-tariff barriers to US exports.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_25",
    "text": "The India-US trade deal, which was announced late on Monday, saw the 50% tariff on India slashed to 18%, one of the lowest tariff rates for an Asian economy. In a Truth Social post, President Trump claimed that New Delhi had committed to eliminating purchases of Russian energy and to buying $500 billion worth of US technology, energy and other products. In addition, Trump stated that India had agreed to eliminate tariff and non-tariff barriers to US exports. However, PM Modis post on X announcing the terms of the deal did not make any mention of Indian commitments on Russian energy purchases or specific reductions in tariff barriers.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_26",
    "text": "In a Truth Social post, President Trump claimed that New Delhi had committed to eliminating purchases of Russian energy and to buying $500 billion worth of US technology, energy and other products. In addition, Trump stated that India had agreed to eliminate tariff and non-tariff barriers to US exports. However, PM Modis post on X announcing the terms of the deal did not make any mention of Indian commitments on Russian energy purchases or specific reductions in tariff barriers. According to persons aware of the matter, the two sides are now expected to negotiate a joint statement before releasing the text on the deal over the near future.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  },
  {
    "chunk_id": "article_1_clean.json_27",
    "text": "In addition, Trump stated that India had agreed to eliminate tariff and non-tariff barriers to US exports. However, PM Modis post on X announcing the terms of the deal did not make any mention of Indian commitments on Russian energy purchases or specific reductions in tariff barriers. According to persons aware of the matter, the two sides are now expected to negotiate a joint statement before releasing the text on the deal over the near future. Indias External Affairs Minister S Jaishankar will meet with US Secretary of State Marco Rubio on Tuesday afternoon for a bilateral meeting.",
    "metadata": {
      "title": "Exciting opportunity: Trump admin officials hail India deal| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:18.514775"
    }
  }
]