[
  {
    "chunk_id": "article_3_clean.json_0",
    "text": "TITLE: HT Interview| Exporters now have an edge over rivals: Finance Minister| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi : The trade deal between India and the US will act as a big relief to exporters and allow the China+1 strategy to fully play out, Union finance minister Nirmala Sitharaman said on Tuesday, adding that the Union Budget 2026-27 has set the roadmap for Viksit Bharat (Developed India).",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_1",
    "text": "TITLE: HT Interview| Exporters now have an edge over rivals: Finance Minister| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi : The trade deal between India and the US will act as a big relief to exporters and allow the China+1 strategy to fully play out, Union finance minister Nirmala Sitharaman said on Tuesday, adding that the Union Budget 2026-27 has set the roadmap for Viksit Bharat (Developed India). In an interview, the minister who presented her ninth consecutive Union Budget on Sunday also spoke about the importance of stability in political and financial policymaking, confirmed that the reform momentum will continue, underlined that the government was invested in improving implementation, and argued that the common man benefited directly and indirectly from the budget.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_2",
    "text": "TITLE: HT Interview| Exporters now have an edge over rivals: Finance Minister| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi : The trade deal between India and the US will act as a big relief to exporters and allow the China+1 strategy to fully play out, Union finance minister Nirmala Sitharaman said on Tuesday, adding that the Union Budget 2026-27 has set the roadmap for Viksit Bharat (Developed India). In an interview, the minister who presented her ninth consecutive Union Budget on Sunday also spoke about the importance of stability in political and financial policymaking, confirmed that the reform momentum will continue, underlined that the government was invested in improving implementation, and argued that the common man benefited directly and indirectly from the budget. It is a reduction in tariffs, specifically, down to 18%, which is very good news; it means our exporters now stand at an advantage compared to many of our competitors.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_3",
    "text": "TITLE: HT Interview| Exporters now have an edge over rivals: Finance Minister| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi : The trade deal between India and the US will act as a big relief to exporters and allow the China+1 strategy to fully play out, Union finance minister Nirmala Sitharaman said on Tuesday, adding that the Union Budget 2026-27 has set the roadmap for Viksit Bharat (Developed India). In an interview, the minister who presented her ninth consecutive Union Budget on Sunday also spoke about the importance of stability in political and financial policymaking, confirmed that the reform momentum will continue, underlined that the government was invested in improving implementation, and argued that the common man benefited directly and indirectly from the budget. It is a reduction in tariffs, specifically, down to 18%, which is very good news; it means our exporters now stand at an advantage compared to many of our competitors. It is a very welcome move and will be a big relief to our exporters, Sitharaman said.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_4",
    "text": "In an interview, the minister who presented her ninth consecutive Union Budget on Sunday also spoke about the importance of stability in political and financial policymaking, confirmed that the reform momentum will continue, underlined that the government was invested in improving implementation, and argued that the common man benefited directly and indirectly from the budget. It is a reduction in tariffs, specifically, down to 18%, which is very good news; it means our exporters now stand at an advantage compared to many of our competitors. It is a very welcome move and will be a big relief to our exporters, Sitharaman said. She also indicated that the deal could boost capital flows into India and benefit the rupee, which registered its highest single-day gain since March 2020 on Tuesday.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_5",
    "text": "It is a reduction in tariffs, specifically, down to 18%, which is very good news; it means our exporters now stand at an advantage compared to many of our competitors. It is a very welcome move and will be a big relief to our exporters, Sitharaman said. She also indicated that the deal could boost capital flows into India and benefit the rupee, which registered its highest single-day gain since March 2020 on Tuesday. Why is the rupee becoming weaker? Because our capital inflows are reducing.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_6",
    "text": "She also indicated that the deal could boost capital flows into India and benefit the rupee, which registered its highest single-day gain since March 2020 on Tuesday. Why is the rupee becoming weaker? Because our capital inflows are reducing. Why are capital inflows reducing?...But after last nights conversation, I think things will change. You will see the China+1 strategy play out fully now, she added.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_7",
    "text": "Because our capital inflows are reducing. Why are capital inflows reducing?...But after last nights conversation, I think things will change. You will see the China+1 strategy play out fully now, she added. The finance minister was referring to an approach where companies seek to mitigate supply chain risks by diversifying manufacturing to countries such as Vietnam and India while maintaining a presence in China.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_8",
    "text": "Why are capital inflows reducing?...But after last nights conversation, I think things will change. You will see the China+1 strategy play out fully now, she added. The finance minister was referring to an approach where companies seek to mitigate supply chain risks by diversifying manufacturing to countries such as Vietnam and India while maintaining a presence in China. Sitharamans comments came a day after PM Narendra Modi announced that Indian goods will face a reduced US tariff of 18% after a phone conversation with President Donald Trump, who said the two sides had concluded a trade deal whereby New Delhi will cut its tariffs to zero and buy American goods, including energy, worth more than $500 billion.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_9",
    "text": "You will see the China+1 strategy play out fully now, she added. The finance minister was referring to an approach where companies seek to mitigate supply chain risks by diversifying manufacturing to countries such as Vietnam and India while maintaining a presence in China. Sitharamans comments came a day after PM Narendra Modi announced that Indian goods will face a reduced US tariff of 18% after a phone conversation with President Donald Trump, who said the two sides had concluded a trade deal whereby New Delhi will cut its tariffs to zero and buy American goods, including energy, worth more than $500 billion. Sitharaman said the big picture takeaway from the budget was that it was a road map to Viksit Bharat by 2047.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_10",
    "text": "The finance minister was referring to an approach where companies seek to mitigate supply chain risks by diversifying manufacturing to countries such as Vietnam and India while maintaining a presence in China. Sitharamans comments came a day after PM Narendra Modi announced that Indian goods will face a reduced US tariff of 18% after a phone conversation with President Donald Trump, who said the two sides had concluded a trade deal whereby New Delhi will cut its tariffs to zero and buy American goods, including energy, worth more than $500 billion. Sitharaman said the big picture takeaway from the budget was that it was a road map to Viksit Bharat by 2047. The big picture clarity, or the prism through which you are looking at Viksit Bharat, is stability: providing stability to the tax payer, providing stability in policy to manufacturers, providing stability as a government for Centre-state relations, providing stability for newer visionary work, and providing stability in carrying forward reforms, further and furtherSo, thats the prism through which I am looking (at the budgets), she said.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_11",
    "text": "Sitharamans comments came a day after PM Narendra Modi announced that Indian goods will face a reduced US tariff of 18% after a phone conversation with President Donald Trump, who said the two sides had concluded a trade deal whereby New Delhi will cut its tariffs to zero and buy American goods, including energy, worth more than $500 billion. Sitharaman said the big picture takeaway from the budget was that it was a road map to Viksit Bharat by 2047. The big picture clarity, or the prism through which you are looking at Viksit Bharat, is stability: providing stability to the tax payer, providing stability in policy to manufacturers, providing stability as a government for Centre-state relations, providing stability for newer visionary work, and providing stability in carrying forward reforms, further and furtherSo, thats the prism through which I am looking (at the budgets), she said. Sitharaman underscored that the reform agenda will continue.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_12",
    "text": "Sitharaman said the big picture takeaway from the budget was that it was a road map to Viksit Bharat by 2047. The big picture clarity, or the prism through which you are looking at Viksit Bharat, is stability: providing stability to the tax payer, providing stability in policy to manufacturers, providing stability as a government for Centre-state relations, providing stability for newer visionary work, and providing stability in carrying forward reforms, further and furtherSo, thats the prism through which I am looking (at the budgets), she said. Sitharaman underscored that the reform agenda will continue. The momentum will continue.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_13",
    "text": "The big picture clarity, or the prism through which you are looking at Viksit Bharat, is stability: providing stability to the tax payer, providing stability in policy to manufacturers, providing stability as a government for Centre-state relations, providing stability for newer visionary work, and providing stability in carrying forward reforms, further and furtherSo, thats the prism through which I am looking (at the budgets), she said. Sitharaman underscored that the reform agenda will continue. The momentum will continue. There are always things to be doneit is that basic desire to clean up things, remove the undergrowth, and project India as a good investment destination, a good manufacturing location, and a place from where you can export to the entire world with cost competitiveness.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_14",
    "text": "Sitharaman underscored that the reform agenda will continue. The momentum will continue. There are always things to be doneit is that basic desire to clean up things, remove the undergrowth, and project India as a good investment destination, a good manufacturing location, and a place from where you can export to the entire world with cost competitiveness. Theres never going to be a yes-weve-done-it-all kind of approach; its going to be to make things constantly better, she said.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_15",
    "text": "The momentum will continue. There are always things to be doneit is that basic desire to clean up things, remove the undergrowth, and project India as a good investment destination, a good manufacturing location, and a place from where you can export to the entire world with cost competitiveness. Theres never going to be a yes-weve-done-it-all kind of approach; its going to be to make things constantly better, she said. Sitharaman spoke about the governments focus on implementation of policies.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_16",
    "text": "There are always things to be doneit is that basic desire to clean up things, remove the undergrowth, and project India as a good investment destination, a good manufacturing location, and a place from where you can export to the entire world with cost competitiveness. Theres never going to be a yes-weve-done-it-all kind of approach; its going to be to make things constantly better, she said. Sitharaman spoke about the governments focus on implementation of policies. ...The PM himself, once in a month, has a video conference with the district administration, where the progress of projects at the district level is listed before him..That is the level of focus on implementation -- down to the last point, she said.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_17",
    "text": "Theres never going to be a yes-weve-done-it-all kind of approach; its going to be to make things constantly better, she said. Sitharaman spoke about the governments focus on implementation of policies. ...The PM himself, once in a month, has a video conference with the district administration, where the progress of projects at the district level is listed before him..That is the level of focus on implementation -- down to the last point, she said. The finance minister said two committees formed on administrative reforms in the previous budget had submitted their inputs and that Niti Aayog was working on it.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_18",
    "text": "Sitharaman spoke about the governments focus on implementation of policies. ...The PM himself, once in a month, has a video conference with the district administration, where the progress of projects at the district level is listed before him..That is the level of focus on implementation -- down to the last point, she said. The finance minister said two committees formed on administrative reforms in the previous budget had submitted their inputs and that Niti Aayog was working on it. Against the backdrop of the pivot to the debt to GDP ratio, instead of the fiscal deficit, as the anchor of fiscal policy, Sitharaman said all state finance ministers agree that the piling up of debt at the state level was a burden.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_19",
    "text": "...The PM himself, once in a month, has a video conference with the district administration, where the progress of projects at the district level is listed before him..That is the level of focus on implementation -- down to the last point, she said. The finance minister said two committees formed on administrative reforms in the previous budget had submitted their inputs and that Niti Aayog was working on it. Against the backdrop of the pivot to the debt to GDP ratio, instead of the fiscal deficit, as the anchor of fiscal policy, Sitharaman said all state finance ministers agree that the piling up of debt at the state level was a burden. I have suggested that some restructure their loans.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_20",
    "text": "The finance minister said two committees formed on administrative reforms in the previous budget had submitted their inputs and that Niti Aayog was working on it. Against the backdrop of the pivot to the debt to GDP ratio, instead of the fiscal deficit, as the anchor of fiscal policy, Sitharaman said all state finance ministers agree that the piling up of debt at the state level was a burden. I have suggested that some restructure their loans. Many picked up this idea readily.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_21",
    "text": "Against the backdrop of the pivot to the debt to GDP ratio, instead of the fiscal deficit, as the anchor of fiscal policy, Sitharaman said all state finance ministers agree that the piling up of debt at the state level was a burden. I have suggested that some restructure their loans. Many picked up this idea readily. Some states, including those ruled by opposition parties, have benefited.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_22",
    "text": "I have suggested that some restructure their loans. Many picked up this idea readily. Some states, including those ruled by opposition parties, have benefited. Like Telangana, where the CM openly acknowledged that his state had benefited from this restructuring, she said. The Union government, under Article 293 of the Constitution, has the right to have oversight over states on their borrowingsWe are not going to ignore the fiscal deficit number (when debt becomes the anchor).",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_23",
    "text": "Some states, including those ruled by opposition parties, have benefited. Like Telangana, where the CM openly acknowledged that his state had benefited from this restructuring, she said. The Union government, under Article 293 of the Constitution, has the right to have oversight over states on their borrowingsWe are not going to ignore the fiscal deficit number (when debt becomes the anchor). We will keep it in mind. But we think many states will emulate using debt as a guiding anchor.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_24",
    "text": "The Union government, under Article 293 of the Constitution, has the right to have oversight over states on their borrowingsWe are not going to ignore the fiscal deficit number (when debt becomes the anchor). We will keep it in mind. But we think many states will emulate using debt as a guiding anchor. Sitharaman also expanded on a focus on micro, small and medium enterprises in the budget. For the last three budgets we have been doing several things for MSMEs.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_25",
    "text": "But we think many states will emulate using debt as a guiding anchor. Sitharaman also expanded on a focus on micro, small and medium enterprises in the budget. For the last three budgets we have been doing several things for MSMEs. If you talk to them, they speak of issues with liquidity, more facilities, concerns that they will lose benefits if they grow too much, access to raw materials, ease of exports, she said.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_26",
    "text": "Sitharaman also expanded on a focus on micro, small and medium enterprises in the budget. For the last three budgets we have been doing several things for MSMEs. If you talk to them, they speak of issues with liquidity, more facilities, concerns that they will lose benefits if they grow too much, access to raw materials, ease of exports, she said. She argued that the announcement in the budget on boosting legacy industrial clusters stemmed from this focus. Indias economy depends on 40% from MSMEs .",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_27",
    "text": "If you talk to them, they speak of issues with liquidity, more facilities, concerns that they will lose benefits if they grow too much, access to raw materials, ease of exports, she said. She argued that the announcement in the budget on boosting legacy industrial clusters stemmed from this focus. Indias economy depends on 40% from MSMEs . We cant ignore them. What will be their role? How will they come into this?",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_28",
    "text": "We cant ignore them. What will be their role? How will they come into this? That is where we identified that we give them better credit, professional help, equity assistance, she said. Sitharaman said that in the budget, the common man benefited directly and indirectly. See, for one guy who runs a small business, we reduced duties, simplified the procedures, and expanded the export window to one year.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_29",
    "text": "That is where we identified that we give them better credit, professional help, equity assistance, she said. Sitharaman said that in the budget, the common man benefited directly and indirectly. See, for one guy who runs a small business, we reduced duties, simplified the procedures, and expanded the export window to one year. In one budget, he has got three direct benefitstake a woman who is a part of a self-help group in a villageIn this budget, we announced SHE (Self-Help Entrepreneur) mart.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_30",
    "text": "Sitharaman said that in the budget, the common man benefited directly and indirectly. See, for one guy who runs a small business, we reduced duties, simplified the procedures, and expanded the export window to one year. In one budget, he has got three direct benefitstake a woman who is a part of a self-help group in a villageIn this budget, we announced SHE (Self-Help Entrepreneur) mart. In a village, if a woman who is part of an SHG wants to become an entrepreneur, this is a mart for them.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  },
  {
    "chunk_id": "article_3_clean.json_31",
    "text": "See, for one guy who runs a small business, we reduced duties, simplified the procedures, and expanded the export window to one year. In one budget, he has got three direct benefitstake a woman who is a part of a self-help group in a villageIn this budget, we announced SHE (Self-Help Entrepreneur) mart. In a village, if a woman who is part of an SHG wants to become an entrepreneur, this is a mart for them. This mart can help her sell products and digitally link to the global markets, officials can help them take loans from banks at reasonable rates, she added.",
    "metadata": {
      "title": "HT Interview| Exporters now have an edge over rivals: Finance Minister| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:19.222668"
    }
  }
]