[
  {
    "chunk_id": "article_7_clean.json_0",
    "text": "TITLE: PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe world is tilting towards India, Prime Minister Narendra Modi said at a meeting of the National Democratic Alliance (NDA) parliamentarians on Tuesday, referring to the trade deals between India and the European Union, and another, announced late Monday, between India and the US, according to people familiar with the matter.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_1",
    "text": "TITLE: PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe world is tilting towards India, Prime Minister Narendra Modi said at a meeting of the National Democratic Alliance (NDA) parliamentarians on Tuesday, referring to the trade deals between India and the European Union, and another, announced late Monday, between India and the US, according to people familiar with the matter. The PM also added that the deals have showcased Indias strength despite global uncertainty, one of the people cited above added, asking not to be named.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_2",
    "text": "TITLE: PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe world is tilting towards India, Prime Minister Narendra Modi said at a meeting of the National Democratic Alliance (NDA) parliamentarians on Tuesday, referring to the trade deals between India and the European Union, and another, announced late Monday, between India and the US, according to people familiar with the matter. The PM also added that the deals have showcased Indias strength despite global uncertainty, one of the people cited above added, asking not to be named. Also read: India-US trade deal protects dairy, key agriculture products; no duty for $40 billion exports Modi was felicitated by NDA parliamentarians for the US deal.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_3",
    "text": "TITLE: PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe world is tilting towards India, Prime Minister Narendra Modi said at a meeting of the National Democratic Alliance (NDA) parliamentarians on Tuesday, referring to the trade deals between India and the European Union, and another, announced late Monday, between India and the US, according to people familiar with the matter. The PM also added that the deals have showcased Indias strength despite global uncertainty, one of the people cited above added, asking not to be named. Also read: India-US trade deal protects dairy, key agriculture products; no duty for $40 billion exports Modi was felicitated by NDA parliamentarians for the US deal. In the meeting, Modi also said the NDA has been winning elections on the basis of its work and the effort put in by its workers, and cautioned against complacency.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_4",
    "text": "The PM also added that the deals have showcased Indias strength despite global uncertainty, one of the people cited above added, asking not to be named. Also read: India-US trade deal protects dairy, key agriculture products; no duty for $40 billion exports Modi was felicitated by NDA parliamentarians for the US deal. In the meeting, Modi also said the NDA has been winning elections on the basis of its work and the effort put in by its workers, and cautioned against complacency. The unit should maintain its winning streak, from local bodies to parliament, he added, according to parliamentary affairs minister Kiren Rijiju, who attended the meeting.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_5",
    "text": "Also read: India-US trade deal protects dairy, key agriculture products; no duty for $40 billion exports Modi was felicitated by NDA parliamentarians for the US deal. In the meeting, Modi also said the NDA has been winning elections on the basis of its work and the effort put in by its workers, and cautioned against complacency. The unit should maintain its winning streak, from local bodies to parliament, he added, according to parliamentary affairs minister Kiren Rijiju, who attended the meeting. The PM said winning does not mean becoming complacent, it means our responsibility has increased, Rijiju said, briefing reporters.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_6",
    "text": "In the meeting, Modi also said the NDA has been winning elections on the basis of its work and the effort put in by its workers, and cautioned against complacency. The unit should maintain its winning streak, from local bodies to parliament, he added, according to parliamentary affairs minister Kiren Rijiju, who attended the meeting. The PM said winning does not mean becoming complacent, it means our responsibility has increased, Rijiju said, briefing reporters. On Monday night, India and the US announced the broad contours of their long-awaited deal, with the US reducing the duty on Indian exports, levied last August, from 50% to 18%.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_7",
    "text": "The unit should maintain its winning streak, from local bodies to parliament, he added, according to parliamentary affairs minister Kiren Rijiju, who attended the meeting. The PM said winning does not mean becoming complacent, it means our responsibility has increased, Rijiju said, briefing reporters. On Monday night, India and the US announced the broad contours of their long-awaited deal, with the US reducing the duty on Indian exports, levied last August, from 50% to 18%. India has allowed duty free imports of most US products, US President Donald Trump said.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_8",
    "text": "The PM said winning does not mean becoming complacent, it means our responsibility has increased, Rijiju said, briefing reporters. On Monday night, India and the US announced the broad contours of their long-awaited deal, with the US reducing the duty on Indian exports, levied last August, from 50% to 18%. India has allowed duty free imports of most US products, US President Donald Trump said. Details of the deal are yet to be announced.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_9",
    "text": "On Monday night, India and the US announced the broad contours of their long-awaited deal, with the US reducing the duty on Indian exports, levied last August, from 50% to 18%. India has allowed duty free imports of most US products, US President Donald Trump said. Details of the deal are yet to be announced. Also read: US military downs Iranian drone 'aggressively' approaching aircraft carrier Rijiju pointed out that India has signed trade agreements with several countries in recent years.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_10",
    "text": "India has allowed duty free imports of most US products, US President Donald Trump said. Details of the deal are yet to be announced. Also read: US military downs Iranian drone 'aggressively' approaching aircraft carrier Rijiju pointed out that India has signed trade agreements with several countries in recent years. Under his (Modis) leadership, nine trade deals, FTAs, have been concluded. The India-EU Free Trade Agreement was signed just a week ago.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_11",
    "text": "Also read: US military downs Iranian drone 'aggressively' approaching aircraft carrier Rijiju pointed out that India has signed trade agreements with several countries in recent years. Under his (Modis) leadership, nine trade deals, FTAs, have been concluded. The India-EU Free Trade Agreement was signed just a week ago. And then, within a week, the agreement with the US was announced yesterday (Monday), including the announcement of tariff cuts.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_12",
    "text": "Under his (Modis) leadership, nine trade deals, FTAs, have been concluded. The India-EU Free Trade Agreement was signed just a week ago. And then, within a week, the agreement with the US was announced yesterday (Monday), including the announcement of tariff cuts. The minister also lashed out at Rahul Gandhi, the Leader of the Opposition in the Lok Sabha, for his attempt to highlight an article in The Caravan magazine that quotes bits from former army chief Manoj Mukund Naravanes yet-to-be-published memoir.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_13",
    "text": "The India-EU Free Trade Agreement was signed just a week ago. And then, within a week, the agreement with the US was announced yesterday (Monday), including the announcement of tariff cuts. The minister also lashed out at Rahul Gandhi, the Leader of the Opposition in the Lok Sabha, for his attempt to highlight an article in The Caravan magazine that quotes bits from former army chief Manoj Mukund Naravanes yet-to-be-published memoir. Also read: US House passes $1.2 trillion spending package, ending 4-day government shutdown The House runs by rules as per rules no magazine etc.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_14",
    "text": "And then, within a week, the agreement with the US was announced yesterday (Monday), including the announcement of tariff cuts. The minister also lashed out at Rahul Gandhi, the Leader of the Opposition in the Lok Sabha, for his attempt to highlight an article in The Caravan magazine that quotes bits from former army chief Manoj Mukund Naravanes yet-to-be-published memoir. Also read: US House passes $1.2 trillion spending package, ending 4-day government shutdown The House runs by rules as per rules no magazine etc. can be quoted from unless it is authenticated.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_15",
    "text": "The minister also lashed out at Rahul Gandhi, the Leader of the Opposition in the Lok Sabha, for his attempt to highlight an article in The Caravan magazine that quotes bits from former army chief Manoj Mukund Naravanes yet-to-be-published memoir. Also read: US House passes $1.2 trillion spending package, ending 4-day government shutdown The House runs by rules as per rules no magazine etc. can be quoted from unless it is authenticated. Even after the Speakers ruling, he kept flouting the rules, Rijiju said.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_16",
    "text": "Also read: US House passes $1.2 trillion spending package, ending 4-day government shutdown The House runs by rules as per rules no magazine etc. can be quoted from unless it is authenticated. Even after the Speakers ruling, he kept flouting the rules, Rijiju said. Naravanes account of the developments on the Ladakh border with China in August 2020, and a purpoted lack of an immediate political directive on how the Indian Army should respond to a Chinese provocation are at the heart of the controversy.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_17",
    "text": "can be quoted from unless it is authenticated. Even after the Speakers ruling, he kept flouting the rules, Rijiju said. Naravanes account of the developments on the Ladakh border with China in August 2020, and a purpoted lack of an immediate political directive on how the Indian Army should respond to a Chinese provocation are at the heart of the controversy. Rijiju said Gandhi kept raising the issue of the China border.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_18",
    "text": "Even after the Speakers ruling, he kept flouting the rules, Rijiju said. Naravanes account of the developments on the Ladakh border with China in August 2020, and a purpoted lack of an immediate political directive on how the Indian Army should respond to a Chinese provocation are at the heart of the controversy. Rijiju said Gandhi kept raising the issue of the China border. Whether it is Aksai Chin, or areas in Ladakh and Arunachal Pradesh, that are under Chinas control since 1959 and 1962, can the Congress bring those back?",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_19",
    "text": "Naravanes account of the developments on the Ladakh border with China in August 2020, and a purpoted lack of an immediate political directive on how the Indian Army should respond to a Chinese provocation are at the heart of the controversy. Rijiju said Gandhi kept raising the issue of the China border. Whether it is Aksai Chin, or areas in Ladakh and Arunachal Pradesh, that are under Chinas control since 1959 and 1962, can the Congress bring those back? he asked, referring to a period when the Congress was in power.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_20",
    "text": "Rijiju said Gandhi kept raising the issue of the China border. Whether it is Aksai Chin, or areas in Ladakh and Arunachal Pradesh, that are under Chinas control since 1959 and 1962, can the Congress bring those back? he asked, referring to a period when the Congress was in power. Gandhi should first apologise for the land that was allowed to be taken over by China in 1959 and 1962.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_21",
    "text": "Whether it is Aksai Chin, or areas in Ladakh and Arunachal Pradesh, that are under Chinas control since 1959 and 1962, can the Congress bring those back? he asked, referring to a period when the Congress was in power. Gandhi should first apologise for the land that was allowed to be taken over by China in 1959 and 1962. BJP president Nitin Nabin, who is a legislator in Bihar, attended his first NDA parliamentary party meeting and was greeted by the PM.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  },
  {
    "chunk_id": "article_7_clean.json_22",
    "text": "he asked, referring to a period when the Congress was in power. Gandhi should first apologise for the land that was allowed to be taken over by China in 1959 and 1962. BJP president Nitin Nabin, who is a legislator in Bihar, attended his first NDA parliamentary party meeting and was greeted by the PM. The meeting also applauded the budget presented by Union finance minister Nirmala Sitharaman on Sunday with the Prime Minister referring to it as futuristic.",
    "metadata": {
      "title": "PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:20.634512"
    }
  }
]