[
  {
    "chunk_id": "article_42_clean.json_0",
    "text": "TITLE: Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA cluster of balloons led to a brief explosion inside a building elevator in Mumbai after the balloons caught fire. CCTV footage from the elevator showed the moment when a man entered the elevator with a bunch of balloons and triggered an explosion.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_1",
    "text": "TITLE: Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA cluster of balloons led to a brief explosion inside a building elevator in Mumbai after the balloons caught fire. CCTV footage from the elevator showed the moment when a man entered the elevator with a bunch of balloons and triggered an explosion. The CCTV footage shows a woman entering the lift with a small trolley, followed by a man carrying several balloons packed in a large polythene bag.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_2",
    "text": "TITLE: Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA cluster of balloons led to a brief explosion inside a building elevator in Mumbai after the balloons caught fire. CCTV footage from the elevator showed the moment when a man entered the elevator with a bunch of balloons and triggered an explosion. The CCTV footage shows a woman entering the lift with a small trolley, followed by a man carrying several balloons packed in a large polythene bag. Moments later, the balloons catch fire, leading to the blast inside the elevator.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_3",
    "text": "CCTV footage from the elevator showed the moment when a man entered the elevator with a bunch of balloons and triggered an explosion. The CCTV footage shows a woman entering the lift with a small trolley, followed by a man carrying several balloons packed in a large polythene bag. Moments later, the balloons catch fire, leading to the blast inside the elevator. The flames briefly covered the CCTV camera, and seconds later, the woman and two men were seen rushing out of the elevator.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_4",
    "text": "The CCTV footage shows a woman entering the lift with a small trolley, followed by a man carrying several balloons packed in a large polythene bag. Moments later, the balloons catch fire, leading to the blast inside the elevator. The flames briefly covered the CCTV camera, and seconds later, the woman and two men were seen rushing out of the elevator. The CCTV footage shows the elevator doors shutting as flames erupt at the centre of the lift.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_5",
    "text": "Moments later, the balloons catch fire, leading to the blast inside the elevator. The flames briefly covered the CCTV camera, and seconds later, the woman and two men were seen rushing out of the elevator. The CCTV footage shows the elevator doors shutting as flames erupt at the centre of the lift. The man and the woman who were seen entering the lift reportedly suffered burn injuries, NDTV reported. The police said that a case has also been filed against the balloon seller.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_6",
    "text": "The CCTV footage shows the elevator doors shutting as flames erupt at the centre of the lift. The man and the woman who were seen entering the lift reportedly suffered burn injuries, NDTV reported. The police said that a case has also been filed against the balloon seller. It is still not known what type of gas was inside the balloons. Also read: Bride, groom suffer burns after hydrogen balloons explode during Haldi ceremony.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_7",
    "text": "The police said that a case has also been filed against the balloon seller. It is still not known what type of gas was inside the balloons. Also read: Bride, groom suffer burns after hydrogen balloons explode during Haldi ceremony. Watch | Trending Similar cases of baloons cathching fire are becoming common. Last year, hydrogen balloons exploded at a Haldi ceremony, with the bride and groom suffering burns. The incident came to light when the couple shared a video of it on Instagram.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_8",
    "text": "Watch | Trending Similar cases of baloons cathching fire are becoming common. Last year, hydrogen balloons exploded at a Haldi ceremony, with the bride and groom suffering burns. The incident came to light when the couple shared a video of it on Instagram. In the video, the couple can be seen walking with hydrogen balloons when the balloons catch fire due to one of the colour guns used during entry.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_9",
    "text": "Last year, hydrogen balloons exploded at a Haldi ceremony, with the bride and groom suffering burns. The incident came to light when the couple shared a video of it on Instagram. In the video, the couple can be seen walking with hydrogen balloons when the balloons catch fire due to one of the colour guns used during entry. Hydrogen balloons often catch fire and trigger a small explosion that can be dangerous and cause burn injuries.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_10",
    "text": "The incident came to light when the couple shared a video of it on Instagram. In the video, the couple can be seen walking with hydrogen balloons when the balloons catch fire due to one of the colour guns used during entry. Hydrogen balloons often catch fire and trigger a small explosion that can be dangerous and cause burn injuries. Also read: On camera, hydrogen balloons explode on woman's face during birthday celebration In another incident in Vietnam, a woman suffered first- and second-degree burns after balloons she was holding exploded.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_11",
    "text": "In the video, the couple can be seen walking with hydrogen balloons when the balloons catch fire due to one of the colour guns used during entry. Hydrogen balloons often catch fire and trigger a small explosion that can be dangerous and cause burn injuries. Also read: On camera, hydrogen balloons explode on woman's face during birthday celebration In another incident in Vietnam, a woman suffered first- and second-degree burns after balloons she was holding exploded. The balloons came in contact with lit candles on her cake at a restaurant decorated with balloons.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  },
  {
    "chunk_id": "article_42_clean.json_12",
    "text": "Hydrogen balloons often catch fire and trigger a small explosion that can be dangerous and cause burn injuries. Also read: On camera, hydrogen balloons explode on woman's face during birthday celebration In another incident in Vietnam, a woman suffered first- and second-degree burns after balloons she was holding exploded. The balloons came in contact with lit candles on her cake at a restaurant decorated with balloons. The video of the incident showed flames engulfing her face as she dropped the cake and balloons.",
    "metadata": {
      "title": "Gas-filled balloons catch fire inside lift in Mumbai apartment, terrifying video goes viral| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.428280"
    }
  }
]