[
  {
    "chunk_id": "article_13_clean.json_0",
    "text": "TITLE: Cong leaders attack US-India trade agreement, BJP praises| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leaders on Tuesday mounted an attack on the IndiaUnited States trade agreement, describing it as economically uneven and questioning why key elements of the pact were being articulated by American officials. While the BJP hailed it as a milestone that would expand opportunities for people.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_1",
    "text": "TITLE: Cong leaders attack US-India trade agreement, BJP praises| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leaders on Tuesday mounted an attack on the IndiaUnited States trade agreement, describing it as economically uneven and questioning why key elements of the pact were being articulated by American officials. While the BJP hailed it as a milestone that would expand opportunities for people. Priyank Kharge, state minister for electronics, compared the deal to the implementation of the Goods and Services Tax (GST), arguing that the government was celebrating a tariff reduction while ignoring what he portrayed as a structural imbalance.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_2",
    "text": "TITLE: Cong leaders attack US-India trade agreement, BJP praises| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nCongress leaders on Tuesday mounted an attack on the IndiaUnited States trade agreement, describing it as economically uneven and questioning why key elements of the pact were being articulated by American officials. While the BJP hailed it as a milestone that would expand opportunities for people. Priyank Kharge, state minister for electronics, compared the deal to the implementation of the Goods and Services Tax (GST), arguing that the government was celebrating a tariff reduction while ignoring what he portrayed as a structural imbalance. He said US duties on Indian goods had been brought down to 18%, while American products were entering India at zero tariffs.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_3",
    "text": "While the BJP hailed it as a milestone that would expand opportunities for people. Priyank Kharge, state minister for electronics, compared the deal to the implementation of the Goods and Services Tax (GST), arguing that the government was celebrating a tariff reduction while ignoring what he portrayed as a structural imbalance. He said US duties on Indian goods had been brought down to 18%, while American products were entering India at zero tariffs. The government of India has become a madhouse.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_4",
    "text": "Priyank Kharge, state minister for electronics, compared the deal to the implementation of the Goods and Services Tax (GST), arguing that the government was celebrating a tariff reduction while ignoring what he portrayed as a structural imbalance. He said US duties on Indian goods had been brought down to 18%, while American products were entering India at zero tariffs. The government of India has become a madhouse. It is nothing but the GST Bachao Utsav, which the government celebrated so much.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_5",
    "text": "He said US duties on Indian goods had been brought down to 18%, while American products were entering India at zero tariffs. The government of India has become a madhouse. It is nothing but the GST Bachao Utsav, which the government celebrated so much. First you implement high GSTs, then you reduce it after 8 years, then you celebrate the reduction.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_6",
    "text": "The government of India has become a madhouse. It is nothing but the GST Bachao Utsav, which the government celebrated so much. First you implement high GSTs, then you reduce it after 8 years, then you celebrate the reduction. Similarly, the US tariff has been reduced to 18%, so you are celebrating a reduction while there is zero tariff on US goods...I dont know what the government of India is celebrating. I dont see sense in this, Kharge said.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_7",
    "text": "First you implement high GSTs, then you reduce it after 8 years, then you celebrate the reduction. Similarly, the US tariff has been reduced to 18%, so you are celebrating a reduction while there is zero tariff on US goods...I dont know what the government of India is celebrating. I dont see sense in this, Kharge said. Industries minister MB Patil said the tariff reduction could benefit industry but questioned whether any commitments had been made regarding Indias purchase of Russian oil.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_8",
    "text": "Similarly, the US tariff has been reduced to 18%, so you are celebrating a reduction while there is zero tariff on US goods...I dont know what the government of India is celebrating. I dont see sense in this, Kharge said. Industries minister MB Patil said the tariff reduction could benefit industry but questioned whether any commitments had been made regarding Indias purchase of Russian oil. We all know that the US tariff has been reduced to 18%, but what is behind that no one knows.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_9",
    "text": "I dont see sense in this, Kharge said. Industries minister MB Patil said the tariff reduction could benefit industry but questioned whether any commitments had been made regarding Indias purchase of Russian oil. We all know that the US tariff has been reduced to 18%, but what is behind that no one knows. We dont know if there was any commitment from the PM not to buy Russian oil. It is good for industries that the tariff has been reduced, he said.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_10",
    "text": "We all know that the US tariff has been reduced to 18%, but what is behind that no one knows. We dont know if there was any commitment from the PM not to buy Russian oil. It is good for industries that the tariff has been reduced, he said. US officials have said the agreement would allow greater agricultural exports to India, while tariffs on Indian goods entering the United States stand at 18%. The BJPs Karnataka leadership, in contrast, described the agreement as a milestone.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_11",
    "text": "It is good for industries that the tariff has been reduced, he said. US officials have said the agreement would allow greater agricultural exports to India, while tariffs on Indian goods entering the United States stand at 18%. The BJPs Karnataka leadership, in contrast, described the agreement as a milestone. State party president BY Vijayendra said it would expand opportunities for farmers, small businesses, entrepreneurs and skilled workers while strengthening the Make in India and Aatmanirbhar Bharat initiatives.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_12",
    "text": "US officials have said the agreement would allow greater agricultural exports to India, while tariffs on Indian goods entering the United States stand at 18%. The BJPs Karnataka leadership, in contrast, described the agreement as a milestone. State party president BY Vijayendra said it would expand opportunities for farmers, small businesses, entrepreneurs and skilled workers while strengthening the Make in India and Aatmanirbhar Bharat initiatives. The India-US trade deal marks a transformative moment for our economy.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_13",
    "text": "The BJPs Karnataka leadership, in contrast, described the agreement as a milestone. State party president BY Vijayendra said it would expand opportunities for farmers, small businesses, entrepreneurs and skilled workers while strengthening the Make in India and Aatmanirbhar Bharat initiatives. The India-US trade deal marks a transformative moment for our economy. With tariffs reduced to just 18, this landmark agreement unlocks unprecedented opportunities for our farmers, MSMEs, entrepreneurs and skilled workers, and will also empower our Make In India and Aatmanirbhar Bharat vision.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_14",
    "text": "State party president BY Vijayendra said it would expand opportunities for farmers, small businesses, entrepreneurs and skilled workers while strengthening the Make in India and Aatmanirbhar Bharat initiatives. The India-US trade deal marks a transformative moment for our economy. With tariffs reduced to just 18, this landmark agreement unlocks unprecedented opportunities for our farmers, MSMEs, entrepreneurs and skilled workers, and will also empower our Make In India and Aatmanirbhar Bharat vision. A game-changer for exports, job creation and economic growth, he wrote on X, congratulating Prime Minister Narendra Modi.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  },
  {
    "chunk_id": "article_13_clean.json_15",
    "text": "The India-US trade deal marks a transformative moment for our economy. With tariffs reduced to just 18, this landmark agreement unlocks unprecedented opportunities for our farmers, MSMEs, entrepreneurs and skilled workers, and will also empower our Make In India and Aatmanirbhar Bharat vision. A game-changer for exports, job creation and economic growth, he wrote on X, congratulating Prime Minister Narendra Modi. Former chief minister Basavaraj Bommai called the agreement a significant step in relations between the two countries and said it would open global opportunities in technology and development for farmers, startups and small industries.",
    "metadata": {
      "title": "Cong leaders attack US-India trade agreement, BJP praises| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:23.188487"
    }
  }
]