[
  {
    "chunk_id": "article_23_clean.json_0",
    "text": "TITLE: 'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nLeaving several notes, crying caricature and a sorry message behind, three sisters died in Uttar Pradesh's Ghaziabad in reportedly a freak suicide case involving a Korean task-based game which, according to police, they got obsessed to.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_1",
    "text": "TITLE: 'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nLeaving several notes, crying caricature and a sorry message behind, three sisters died in Uttar Pradesh's Ghaziabad in reportedly a freak suicide case involving a Korean task-based game which, according to police, they got obsessed to. VIDEO The girls - a 16-year-old and her two half-sisters, aged 14 and 12 - died after allegedly jumping from the ninth floor of a high-rise in Ghaziabad, an earlier HT report quoted police as saying on Wednesday.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_2",
    "text": "TITLE: 'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nLeaving several notes, crying caricature and a sorry message behind, three sisters died in Uttar Pradesh's Ghaziabad in reportedly a freak suicide case involving a Korean task-based game which, according to police, they got obsessed to. VIDEO The girls - a 16-year-old and her two half-sisters, aged 14 and 12 - died after allegedly jumping from the ninth floor of a high-rise in Ghaziabad, an earlier HT report quoted police as saying on Wednesday. Police shared shocking details of the initial findings, including their purported obsession with the game, and the sisters' final moments as well as the discoveries after their death.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_3",
    "text": "TITLE: 'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nLeaving several notes, crying caricature and a sorry message behind, three sisters died in Uttar Pradesh's Ghaziabad in reportedly a freak suicide case involving a Korean task-based game which, according to police, they got obsessed to. VIDEO The girls - a 16-year-old and her two half-sisters, aged 14 and 12 - died after allegedly jumping from the ninth floor of a high-rise in Ghaziabad, an earlier HT report quoted police as saying on Wednesday. Police shared shocking details of the initial findings, including their purported obsession with the game, and the sisters' final moments as well as the discoveries after their death. The three with their father, a forex trader, and their mothers.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_4",
    "text": "VIDEO The girls - a 16-year-old and her two half-sisters, aged 14 and 12 - died after allegedly jumping from the ninth floor of a high-rise in Ghaziabad, an earlier HT report quoted police as saying on Wednesday. Police shared shocking details of the initial findings, including their purported obsession with the game, and the sisters' final moments as well as the discoveries after their death. The three with their father, a forex trader, and their mothers. They added that the eldest was born to the trader's first wife, while the younger two were born to the second wife.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_5",
    "text": "Police shared shocking details of the initial findings, including their purported obsession with the game, and the sisters' final moments as well as the discoveries after their death. The three with their father, a forex trader, and their mothers. They added that the eldest was born to the trader's first wife, while the younger two were born to the second wife. All three were with their mothers when, around 12.30 am on Wednesday, they went to the puja room, locked it from inside and jumped off the window one after another, the earlier HT report quoted assistant police commissioner Atul Kumar Singh.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_6",
    "text": "The three with their father, a forex trader, and their mothers. They added that the eldest was born to the trader's first wife, while the younger two were born to the second wife. All three were with their mothers when, around 12.30 am on Wednesday, they went to the puja room, locked it from inside and jumped off the window one after another, the earlier HT report quoted assistant police commissioner Atul Kumar Singh. \"Around 12.30am on Wednesday, all three were with their mothers.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_7",
    "text": "They added that the eldest was born to the trader's first wife, while the younger two were born to the second wife. All three were with their mothers when, around 12.30 am on Wednesday, they went to the puja room, locked it from inside and jumped off the window one after another, the earlier HT report quoted assistant police commissioner Atul Kumar Singh. \"Around 12.30am on Wednesday, all three were with their mothers. After some time, they went to the puja room and locked it from inside.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_8",
    "text": "All three were with their mothers when, around 12.30 am on Wednesday, they went to the puja room, locked it from inside and jumped off the window one after another, the earlier HT report quoted assistant police commissioner Atul Kumar Singh. \"Around 12.30am on Wednesday, all three were with their mothers. After some time, they went to the puja room and locked it from inside. Thereafter, they used a chair to jump out of the window one by one. They all died on the spot.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_9",
    "text": "After some time, they went to the puja room and locked it from inside. Thereafter, they used a chair to jump out of the window one by one. They all died on the spot. The guards and locals on the ground floor woke up hearing the loud noise of girls falling, and even their family members on the ninth floor woke up. Police were informed, and bodies were sent for autopsy,\" Singh said.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_10",
    "text": "They all died on the spot. The guards and locals on the ground floor woke up hearing the loud noise of girls falling, and even their family members on the ninth floor woke up. Police were informed, and bodies were sent for autopsy,\" Singh said. The police officer said the girls were highly obsessed with a Korean task-based game and thought that they were not Indians, but Koreans. \"They also portrayed themselves as Korean princesses under the influence of the game,\" said Singh.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_11",
    "text": "Police were informed, and bodies were sent for autopsy,\" Singh said. The police officer said the girls were highly obsessed with a Korean task-based game and thought that they were not Indians, but Koreans. \"They also portrayed themselves as Korean princesses under the influence of the game,\" said Singh. It, however, is not clear whether they jumped out of the window as part of a task of the said game. \"It is an online task-based game that they were addicted to.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_12",
    "text": "\"They also portrayed themselves as Korean princesses under the influence of the game,\" said Singh. It, however, is not clear whether they jumped out of the window as part of a task of the said game. \"It is an online task-based game that they were addicted to. They were not attentive to their studies... This situation developed after the Covid-19 pandemic...they got addicted to online gaming,\" Singh said. The 16-year-old was apparently still studying in Class 4.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_13",
    "text": "They were not attentive to their studies... This situation developed after the Covid-19 pandemic...they got addicted to online gaming,\" Singh said. The 16-year-old was apparently still studying in Class 4. The girls left behind a lot of notes in a diary and stated that they were sorry, and also made a crying caricature, Singh said, adding that the girls used to do routine activities together, including going to the bathroom.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_14",
    "text": "This situation developed after the Covid-19 pandemic...they got addicted to online gaming,\" Singh said. The 16-year-old was apparently still studying in Class 4. The girls left behind a lot of notes in a diary and stated that they were sorry, and also made a crying caricature, Singh said, adding that the girls used to do routine activities together, including going to the bathroom. Other reports carried exact details of the note left behind, \"A true life story.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_15",
    "text": "The 16-year-old was apparently still studying in Class 4. The girls left behind a lot of notes in a diary and stated that they were sorry, and also made a crying caricature, Singh said, adding that the girls used to do routine activities together, including going to the bathroom. Other reports carried exact details of the note left behind, \"A true life story. Is diary mein jo kuch bhi likha hain, woh sab padh lo, kyunki ye sab sach hain.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_16",
    "text": "The girls left behind a lot of notes in a diary and stated that they were sorry, and also made a crying caricature, Singh said, adding that the girls used to do routine activities together, including going to the bathroom. Other reports carried exact details of the note left behind, \"A true life story. Is diary mein jo kuch bhi likha hain, woh sab padh lo, kyunki ye sab sach hain. [Whatever you are seeing in this diary, read everything, because everything is true] Read now!",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_17",
    "text": "Other reports carried exact details of the note left behind, \"A true life story. Is diary mein jo kuch bhi likha hain, woh sab padh lo, kyunki ye sab sach hain. [Whatever you are seeing in this diary, read everything, because everything is true] Read now! I am really sorry, sorry papa,\" indiatoday.in quoted the contents of the note, which carried a sketch of a crying face.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_18",
    "text": "Is diary mein jo kuch bhi likha hain, woh sab padh lo, kyunki ye sab sach hain. [Whatever you are seeing in this diary, read everything, because everything is true] Read now! I am really sorry, sorry papa,\" indiatoday.in quoted the contents of the note, which carried a sketch of a crying face. Police said that their family knew about their addiction and would snatch their mobiles but the girls would manage to get the devices back.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_19",
    "text": "[Whatever you are seeing in this diary, read everything, because everything is true] Read now! I am really sorry, sorry papa,\" indiatoday.in quoted the contents of the note, which carried a sketch of a crying face. Police said that their family knew about their addiction and would snatch their mobiles but the girls would manage to get the devices back. \"They followed a daily life routine together; even went to the bathroom together.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_20",
    "text": "I am really sorry, sorry papa,\" indiatoday.in quoted the contents of the note, which carried a sketch of a crying face. Police said that their family knew about their addiction and would snatch their mobiles but the girls would manage to get the devices back. \"They followed a daily life routine together; even went to the bathroom together. Their diary left behind has a lot of details about their lifestyle and their obsession with the task-based game,\" said Singh.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_21",
    "text": "Police said that their family knew about their addiction and would snatch their mobiles but the girls would manage to get the devices back. \"They followed a daily life routine together; even went to the bathroom together. Their diary left behind has a lot of details about their lifestyle and their obsession with the task-based game,\" said Singh. Police said they will analyse the girls' mobile phones and seek details about the game they were addicted to.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_22",
    "text": "\"They followed a daily life routine together; even went to the bathroom together. Their diary left behind has a lot of details about their lifestyle and their obsession with the task-based game,\" said Singh. Police said they will analyse the girls' mobile phones and seek details about the game they were addicted to. Discussing suicides can be triggering for some. However, suicides are preventable.",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  },
  {
    "chunk_id": "article_23_clean.json_23",
    "text": "Police said they will analyse the girls' mobile phones and seek details about the game they were addicted to. Discussing suicides can be triggering for some. However, suicides are preventable. A few major suicide prevention helpline numbers in India are 011-23389090 from Sumaitri (Delhi-based) and 044-24640050 from Sneha Foundation (Chennai-based).",
    "metadata": {
      "title": "'Sorry papa', crying sketch: 'Game-obsessed' Ghaziabad sisters' chilling last note| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:26.642358"
    }
  }
]