[
  {
    "chunk_id": "article_20_clean.json_0",
    "text": "TITLE: Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nAn overnight traffic jam blocked the Mumbai-Pune Expressway on Tuesday evening after a gas tanker turned turtle, officials said. The blockade halted the traffic movement for over seven hours causing inconvenience to thousands of commuters who were left stranded.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_1",
    "text": "TITLE: Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nAn overnight traffic jam blocked the Mumbai-Pune Expressway on Tuesday evening after a gas tanker turned turtle, officials said. The blockade halted the traffic movement for over seven hours causing inconvenience to thousands of commuters who were left stranded. Track updates on Mamata Banerjee's SC hearing The vehicular movement on the Mumbai-Pune Expressway was brought to a grinding halt at around 5 pm and continued at least till midnight, with movement on both sides being halted for some hours.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_2",
    "text": "TITLE: Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nAn overnight traffic jam blocked the Mumbai-Pune Expressway on Tuesday evening after a gas tanker turned turtle, officials said. The blockade halted the traffic movement for over seven hours causing inconvenience to thousands of commuters who were left stranded. Track updates on Mamata Banerjee's SC hearing The vehicular movement on the Mumbai-Pune Expressway was brought to a grinding halt at around 5 pm and continued at least till midnight, with movement on both sides being halted for some hours. The cause of the traffic jam was reported to be a Mumbai-bound tanker propylene gas that overturned near the Adoshi Tunnel.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_3",
    "text": "The blockade halted the traffic movement for over seven hours causing inconvenience to thousands of commuters who were left stranded. Track updates on Mamata Banerjee's SC hearing The vehicular movement on the Mumbai-Pune Expressway was brought to a grinding halt at around 5 pm and continued at least till midnight, with movement on both sides being halted for some hours. The cause of the traffic jam was reported to be a Mumbai-bound tanker propylene gas that overturned near the Adoshi Tunnel. Also read: 3 girls jump off Ghaziabad building, were addicted to Korean mobile game The incident led to heavy traffic snarls along the corridor.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_4",
    "text": "Track updates on Mamata Banerjee's SC hearing The vehicular movement on the Mumbai-Pune Expressway was brought to a grinding halt at around 5 pm and continued at least till midnight, with movement on both sides being halted for some hours. The cause of the traffic jam was reported to be a Mumbai-bound tanker propylene gas that overturned near the Adoshi Tunnel. Also read: 3 girls jump off Ghaziabad building, were addicted to Korean mobile game The incident led to heavy traffic snarls along the corridor. Traffic heading towards Pune was backed up till Khalapur toll naka, while congestion on the Mumbai-bound lane stretched for nearly 10-12km, HT reported earlier.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_5",
    "text": "The cause of the traffic jam was reported to be a Mumbai-bound tanker propylene gas that overturned near the Adoshi Tunnel. Also read: 3 girls jump off Ghaziabad building, were addicted to Korean mobile game The incident led to heavy traffic snarls along the corridor. Traffic heading towards Pune was backed up till Khalapur toll naka, while congestion on the Mumbai-bound lane stretched for nearly 10-12km, HT reported earlier. As the vehicles remained stationary near the accident site for several hours, passengers took to social media saying how they had no access to food, water, and toilet facilities four several hours.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_6",
    "text": "Also read: 3 girls jump off Ghaziabad building, were addicted to Korean mobile game The incident led to heavy traffic snarls along the corridor. Traffic heading towards Pune was backed up till Khalapur toll naka, while congestion on the Mumbai-bound lane stretched for nearly 10-12km, HT reported earlier. As the vehicles remained stationary near the accident site for several hours, passengers took to social media saying how they had no access to food, water, and toilet facilities four several hours. They also alleged poor handling of the traffic situation by the administration.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_7",
    "text": "Traffic heading towards Pune was backed up till Khalapur toll naka, while congestion on the Mumbai-bound lane stretched for nearly 10-12km, HT reported earlier. As the vehicles remained stationary near the accident site for several hours, passengers took to social media saying how they had no access to food, water, and toilet facilities four several hours. They also alleged poor handling of the traffic situation by the administration. As the gas tanker overturned, the Mumbai-bound traffic was diverted onto the Pune-bound carriageway for about a 2-km stretch, PTI reported, citing expressway control room.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_8",
    "text": "As the vehicles remained stationary near the accident site for several hours, passengers took to social media saying how they had no access to food, water, and toilet facilities four several hours. They also alleged poor handling of the traffic situation by the administration. As the gas tanker overturned, the Mumbai-bound traffic was diverted onto the Pune-bound carriageway for about a 2-km stretch, PTI reported, citing expressway control room. Also read: Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport However, officials said normal movement could not be restored due to a continuous gas leak from the tanker, resulting in long queues and crawling traffic for over 12 hours, even for Pune-bound motorists.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_9",
    "text": "They also alleged poor handling of the traffic situation by the administration. As the gas tanker overturned, the Mumbai-bound traffic was diverted onto the Pune-bound carriageway for about a 2-km stretch, PTI reported, citing expressway control room. Also read: Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport However, officials said normal movement could not be restored due to a continuous gas leak from the tanker, resulting in long queues and crawling traffic for over 12 hours, even for Pune-bound motorists. The impact was severe on motorists, with several passengers stranded for hours.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_10",
    "text": "As the gas tanker overturned, the Mumbai-bound traffic was diverted onto the Pune-bound carriageway for about a 2-km stretch, PTI reported, citing expressway control room. Also read: Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport However, officials said normal movement could not be restored due to a continuous gas leak from the tanker, resulting in long queues and crawling traffic for over 12 hours, even for Pune-bound motorists. The impact was severe on motorists, with several passengers stranded for hours. The tanker overturned near the Adoshi tunnel in Raigad district allegedly on account of high speed.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_11",
    "text": "Also read: Air India, Indigo plane wingtips collide: Blow-by-blow account of what happened at Mumbai Airport However, officials said normal movement could not be restored due to a continuous gas leak from the tanker, resulting in long queues and crawling traffic for over 12 hours, even for Pune-bound motorists. The impact was severe on motorists, with several passengers stranded for hours. The tanker overturned near the Adoshi tunnel in Raigad district allegedly on account of high speed. The vehicle lost control due to the slope and overturned.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_12",
    "text": "The impact was severe on motorists, with several passengers stranded for hours. The tanker overturned near the Adoshi tunnel in Raigad district allegedly on account of high speed. The vehicle lost control due to the slope and overturned. Soon after the accident, gas was found leaking from the tanker, causing panic among motorists, an official said. The tanker was reportedly carrying propylene gas, which is highly flammable.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_13",
    "text": "The vehicle lost control due to the slope and overturned. Soon after the accident, gas was found leaking from the tanker, causing panic among motorists, an official said. The tanker was reportedly carrying propylene gas, which is highly flammable. As a precautionary measure, the police immediately closed traffic towards Mumbai to prevent any untoward incident.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_14",
    "text": "Soon after the accident, gas was found leaking from the tanker, causing panic among motorists, an official said. The tanker was reportedly carrying propylene gas, which is highly flammable. As a precautionary measure, the police immediately closed traffic towards Mumbai to prevent any untoward incident. As commuters were left high and dry for hours, they vented out their anger on social media and some of them even compared the highway to a parking lot as the vehicles remained stationary for hours.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_15",
    "text": "The tanker was reportedly carrying propylene gas, which is highly flammable. As a precautionary measure, the police immediately closed traffic towards Mumbai to prevent any untoward incident. As commuters were left high and dry for hours, they vented out their anger on social media and some of them even compared the highway to a parking lot as the vehicles remained stationary for hours. Another woman said she was travelling with her kids and had been left stranded without food, water with no washroom facility in sight.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_16",
    "text": "As a precautionary measure, the police immediately closed traffic towards Mumbai to prevent any untoward incident. As commuters were left high and dry for hours, they vented out their anger on social media and some of them even compared the highway to a parking lot as the vehicles remained stationary for hours. Another woman said she was travelling with her kids and had been left stranded without food, water with no washroom facility in sight. A commuter even described the traffic jam as historic and said people were sleeping in their vehicles.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_17",
    "text": "As commuters were left high and dry for hours, they vented out their anger on social media and some of them even compared the highway to a parking lot as the vehicles remained stationary for hours. Another woman said she was travelling with her kids and had been left stranded without food, water with no washroom facility in sight. A commuter even described the traffic jam as historic and said people were sleeping in their vehicles. A conductor of the Maharashtra State Road Transport Corporation bus was quoted as saying by PTI that their vehicle had been stationary for over six hours near the accident site.",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  },
  {
    "chunk_id": "article_20_clean.json_18",
    "text": "Another woman said she was travelling with her kids and had been left stranded without food, water with no washroom facility in sight. A commuter even described the traffic jam as historic and said people were sleeping in their vehicles. A conductor of the Maharashtra State Road Transport Corporation bus was quoted as saying by PTI that their vehicle had been stationary for over six hours near the accident site. With inputs from Sameera Kapoor Munshi",
    "metadata": {
      "title": "Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune Expressway traffic jam| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:25.708028"
    }
  }
]