{
  "url": "https://www.hindustantimes.com/india-news/jaishankar-rubio-welcome-india-us-trade-deal-hold-talks-on-critical-minerals-in-washington-101770168846564.html",
  "structured_text": "TITLE: Jaishankar, Rubio welcome India-US trade deal, hold talks on critical minerals in Washington| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nExternal affairs minister S Jaishankar met US secretary of state Marco Rubio in Washington, DC, on Tuesday, where the two leaders welcomed the trade deal reached between Prime Minister Narendra Modi and President Donald Trump and discussed steps to formalise bilateral cooperation on the exploration, mining and processing of critical minerals. Rubio held one-on-one talks with Jaishankar at the state department ahead of the first critical minerals ministerial meeting being hosted by the US on Wednesday. The two leaders held talks on bilateral cooperation agenda as well as regional and global issues, Jaishankar said. In a post on X, EAM wrote, A wide-ranging conversation that covered our bilateral cooperation agenda, regional and global issues. Facets of the India-US Strategic Partnership discussed included trade, energy, nuclear, defence, critical minerals, and technology. Agreed on the early meetings of various mechanisms to advance our shared interests. A summary of the meeting shared by state department principal deputy spokesperson Tommy Pigott said Rubio and Jaishankar welcomed the trade deal reached between President Trump and Prime Minister Modi.\" It also said that the two leaders discussed the importance of their democracies working together to unlock new economic opportunities and advance our shared energy security goals. The two leaders also expressed their commitment to expanding bilateral and multilateral cooperation through the Quad and acknowledged that a prosperous Indo-Pacific region remains vital to advancing our shared interests, according to Pigott. Trump and PM Modi announced the India-US trade deal after a phone call on Monday. The breakthrough came after nearly 12 months of tense talks that strained bilateral ties and left India facing some of the highest US tariffs. PM Modi said Indian goods will now be subject to a lower US tariff of 18% after his conversation with Trump. This replaces the earlier reciprocal rate of 25%. In a post on Truth Social, Trump said the agreement goes beyond tariff reductions. He described it as a concluded deal under which India would cut its tariffs and non-tariff barriers on US goods to zero and commit to purchasing more than $500 billion worth of American energy, technology, farm products, coal and other items. Notably, the deal excludes Indian dairy and sensitive agriculture items, allows zero-duty access for more than $40 billion worth of Indian goods and lowers customs duties on labour-intensive exports such as textiles, leather items, marine products, chemicals and some agricultural goods, including processed food, to 18% from the first day, people aware of the development told HT.",
  "metadata": {
    "title": "Jaishankar, Rubio welcome India-US trade deal, hold talks on critical minerals in Washington| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:22.342255"
  }
}