{
  "url": "https://www.hindustantimes.com/india-news/traffic-advisory-issued-as-mumbai-pune-expressway-traffic-jam-continues-for-15-hours-check-advisory-restrictions-101770199378777.html",
  "structured_text": "TITLE: Traffic advisory issued as Mumbai-Pune Expressway traffic jam continues for 15+ hours | Check advisory, restrictions| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nTraffic movement on the MumbaiPune corridor was severely affected on February 4 after a gas tanker met with an accident near the Adoshi Tunnel. Authorities said a gas leak from the tanker led to major disruption on both the MumbaiPune Expressway and the old MumbaiPune Highway (NH-48). The incident caused long traffic snarls, forcing officials to restrict movement in the affected stretch. Also read| Commuters stuck for 15 hours on MumbaiPune highway with no food, water or toilet access Commuters have been strongly advised to avoid the LonavalaKhandala ghat section. Motorists travelling between Mumbai and Pune are urged to plan their journeys carefully and follow traffic advisories, as per HT bureau. To ease congestion, authorities recommended the following alternative routes: A tanker overturned at around 5 pm on Tuesday near the Adoshi tunnel in Raigad district. The vehicle was allegedly travelling at high speed when it lost control on the downward slope and toppled. Soon after the accident, gas was found leaking from the tanker. The tanker was carrying propylene gas, which is highly flammable. As a precaution, police immediately shut traffic towards Mumbai to avoid any potential danger, officials said. Vehicles remained stranded near the accident site as traffic congestion stretched beyond 15 hours, leaving commuters, including women and children, stuck in long queues without access to food, drinking water or toilet facilities. Commuters said they were forced to ration water, skip meals, and sit inside vehicles for hours without ventilation as temperatures fluctuated. Parents struggled to calm restless children, while elderly passengers complained of body pain, dehydration, and anxiety, as earlier HT reported. Near Khalapur Toll Plaza, Pune resident Rohit More was stranded overnight with his two children, aged one and three. There are no toilets, no place to even step out safely. Managing infants inside a parked car for hours is exhausting, he said. Milk ran out, diapers became an issue, and the children were crying through the night. This was not something we could have prepared for. Sanjay Mundada, a project management professional heading to Mumbai for an important meeting, said the jam made even remote work impossible. I tried attending my meeting from the car, but network issues and noise made it futile. After eight hours, I had no option but to inform my office that I wouldnt make it. An entire workday was lost, he said. At multiple points along the expressway, commuters said vehicles were turning back or exiting midway, abandoning critical appointments. I was travelling to Mumbai for a court-related matter, said Rakesh Kulkarni, a commuter from Pimpri-Chinchwad. After nearly six hours without any movement and no facilities, I decided to return. Missing the hearing was unavoidable, but staying stuck without water was worse. (With inputs from HT correspondent)",
  "metadata": {
    "title": "Traffic advisory issued as Mumbai-Pune Expressway traffic jam continues for 15+ hours | Check advisory, restrictions| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:30.070729"
  }
}