{
  "url": "https://www.hindustantimes.com/india-news/india-us-trade-deal-tariffs-reduction-nirmala-sitharaman-interview-donald-trump-china-pm-modi-union-budget-101770161394988.html",
  "structured_text": "TITLE: Budget 2026 to benefit common man, US deal a big relief to Indian exporters, says Sitharaman | Exclusive| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nUnion Budget 2026-27 sets the roadmap to Viksit Bharat (Developed India) by providing stability in taxation, policies, and reforms, finance minister Nirmala Sitharaman said, adding that her government will continue to keep up the momentum on reforms with the idea of making things constantly better. In an interview where she discussed the Union Budget she presented on February 1, Sitharaman also welcomed the deal with the US announced on Monday night, which reduces the tariffs on Indian exports to 18% from 50%, and suggested that the deal could also boost capital flows into India as the China+1 strategy plays out something that could also benefit the Indian currency, which, incidentally, registered its highest single-day gain since March 2020 on Tuesday. Edited excerpts: It is a reduction in tariffs, specifically, down to 18%, which is very good news; it means our exporters now stand at an advantage compared to many of our competitors. It is a very welcome move and will be a big relief to our exporters. Thats right. In fact, a sequence of FTAs that weve completed -- UAE, Australia, EFTA, New Zealand, EU, Qatar... The big picture, the destination is Viksit Bharat by 2047. But the picture clarity, or the prism through which you are looking at Viksit Bharat, is stability: providing stability to the taxpayer, providing stability in policy to manufacturers, providing stability as a government for Centre-state relations, providing stability for newer visionary work, and providing stability in carrying forward reforms, further and further. So stability it is the government is in its third term, continuing with the same Prime Minister, thats the assurance businesses get. And this government has anyway been very responsive to the wishlist of industry. So, thats the prism through which I am looking (at the budgets): providing that stability, with the destination in mind. But the momentum will continue. There are always things to be done. Whoever would have imagined that we still have some laws from the 19th century? We are unearthing these and saying, Not relevant for today, remove it. These are basic things that the country could have done decades ago. So it is that basic desire to clean up things, remove the undergrowth, and project India as a good investment destination, a good manufacturing location, and a place from where you can export to the entire world with cost competitiveness. Theres never going to be a yes-weve-done-it-all kind of approach; its going to be to make things constantly better. Implementation has to go down to the very last person. Other than the departments that are being regularly reviewed. which have to take it down to the district or village level, the PM himself, once in a month, has a video conference with the district administration, where the progress of projects at the district level is listed before him. He is directly communicating with the district administration to find out what is moving and what is not, and if something isnt moving, why -- to see if theres anything that has to be done at his level. That is the level of focus on implementation -- down to the last point. Besides this, officers posted in Delhi are asked to go back to the state cadres they belong to , and to the place of their first posting, as assistant collector or deputy DM. They are asked to go to that place, where they were first posted 30 years ago perhaps, and asked to assess the change. And to see what could be done further? That is the extent to which the last mile connect needs to happen. Its going fine. The two committees formed on reforms have given us their inputs. Niti Aayog is also working on it. Niti Aayog has done a complete mapping of this -- where are the points where the intervention has to happen. At what level, at what stage, and where. We expect a certain desire from the states to emulate; I meet up with all state finance ministers, both from our own party and other parties. They all agree that the piling up of debt is a burden. I have suggested that some restructure their loans. Many picked up this idea readily. Some states, including those ruled by opposition parties, have benefited. Like Telangana, where the CM openly acknowledged that his state had benefited from this restructuring. The Union government, under Article 293 of the Constitution, has the right to have oversight over states on their borrowings. As per the FRBM (Fiscal Regulatory and Budgetary Management Act), if they go beyond 3% of their respective GDP (in terms of debt), we can intervene. The CAG also highlights this. We are not going to ignore the fiscal deficit number (when debt becomes the anchor). We will keep it in mind. But we think many states will emulate using debt as a guiding anchor. On debt, I am finding that everyone is equally concerned, to be fair The last was Narasimham (Committee), right? It will look at banking in total -- banking in India. Completely Thats right, but it is at its healthiest best, and therefore you are in a position to assert with confidence that if there is any recommendation coming from a learned set of people, we will be in a position to sit down with the banks and talk to them. We will have to decide on the terms of reference. Reviving is the wrong word. But we are looking at MSMEs. For the last three budgets we have been doing several things for MSMEs. If you talk to them, they speak of issues with liquidity, more facilities, concerns that they will lose benefits if they grow too much, access to raw materials, ease of exports... But one thing stands out. Those clusters formed ages ago, decades ago, are all bursting at the seams. We are looking at reviving these centres -- looking at how we can expand, plus look at sectors that need funding for technology... When I looked at it in terms of growth, I looked at larger manufacturing -- semiconductors, chip manufacturing , electronics and components. Those are the ones that can be scaled up. But Indias economy depends on 40% from MSMEs . We cant ignore them. What will be their role? How will they come into this? That is where we identified that we give them better credit, professional help, equity assistance. And the fourth one -- we said, we will do this for new ones, but what will we do for MSMEs in manufacturing that have been around for decades? Like the sports goods manufacturing cluster in Jalandhar; power tools in Ludhiana; textiles in Surat; hosiery in Coimbatore and Tiruppur. Like these, around the country, there are clusters of MSMEs. They need to be energised. So there is focus on the big (new) ones -- semiconductors, chips, PLIs for them -- but there is also focus on the legacy ones, MSME clusters. Areas which have been languishing for a long time... At least for grains, pulses, through procurement (MSP), there is some sort of support. But we are now reaching a stage where it looks like we may even have to import coconut oil. This is an area where we were once not only self-reliant, but also big exporters. Trees were becoming older, productivity was declining, and in some regions, many were destroyed by cyclones. It is beyond farmers to replace all of them at once. There is such a market overseas for cold pressed coconut oil; coconut flakes. Cocoa -- we import so much. And Karnataka has plantations for them. And we are importing cashews from Ecuador; there is so much cultivation in coastal areas -- a rural industry, where there are a lot of women employed. MeiTY is holding a lot of discussions on this -- but if you are getting tools from AI that are benefitting the common man, like I said, for farmers, handicrafts, market outreach... But who is the cadre who is going to do this work? We need people to prompt AI, to use AI. I am creating a pool of people who will have to use AI to create and find markets, get intelligence from aerial surveys on agriculture... Not at all In the budget, there is direct benefit to the common man as well as indirect benefit. Consider the changes in customs through taxation. The guy who exports goods is also part of the common man. Imagine that I run a small MSME unit and export some products, for which I import raw materials. The raw material import is very troublesome, I have to fill in a lot of paperwork and the tax customs duties are very high; after this, when I export the goods in the foreign market, I am not able to save because the costs are high. In this budget, what did we do? We pushed the customs duties towards zero. We made it zero in some cases, and one or two percent in others. Because of this, the costs will reduce. Then, the paperwork and compliance were also reduced by showing trust in the exporter and reducing the paperwork as much as possible. Third, importing raw materials for export is usually duty free, but with a rider that the export of the value-added goods has to happen within six months and the paperwork has to be submitted to the department. We have changed it from six months to one year. You can import duty free, value add, and export comfortably within a year. See, for one guy who runs a small business, we reduced duties, simplified the procedures, and expanded the export window to one year. In one budget, he has got three direct benefits. Take a woman who is a part of a self-help group in a village. Coming from a small family, she collects 5-10 for her savings, locally sells the products to make her corpus, and takes a loan from a bank to run the business. From such groups of women, the last few budgets helped raise many Lakhpati Didis. Through the National Rural Livelihood Mission, women are taught how local products or handicrafts can be branded, and how small shops can be run. In this budget, we announced SHE (Self-Help Entrepreneur) mart. In a village, if a woman who is part of an SHG wants to become an entrepreneur, this is a mart for them. This mart can help her sell products and digitally link to the global markets, officials can help them take loans from banks at reasonable rates. Prime Minister Narendra Modi often talks about making quality products. This is what well teach them. Women in villages want to study science. How can I encourage them? Going to college, attending lectures, tutorials, coming back home late this is connected to the security of women. Hence, every district will have womens hostels that will help female students. Isnt this for the common woman in villages? When men and women look for jobs now, they arent preferred if they dont have minimum knowledge of AI. Using central funding, we have ensured AI training in ITIs in every district, funding hardware, software, machine, seats, and facilities in rooms. We are using a hub-and-spoke model. Imagine there are five districts; in one district, well make a hub or centre, get AI trainers there, and use machines to do training. This hub will be linked to 4-5 neighbouring districts that will be joined to the hub in one district, AI will help agricultural, crop yield processes and procurement; in another nearby district, AI will help small businesses, machine tools or handicrafts. In three-four states, a pilot project is on and received tremendous response. We will scale it up. ... and of our macroeconomic doing well, but that the rupees weakness is largely because of the external environment which doesnt appreciate the fundamentals of our economy being good Its a fairly complex issue. Everyone says our macroeconomic fundamentals are fine. Our growth rate is steadily increasing. Our foreign exchange reserves are high -- three days ago they crossed $700 billion. Then why is the Rupee becoming weaker? Because our capital inflows are reducing. Why are capital inflows reducing? Some people have exited after booking profits, but why have they not come in? We have to convince large fund managers to come in -- but this is a problem facing not just us, but others as well. But after last nights conversation, I think things will change. You will see the China+1 strategy play out fully now. No. For the last three years, we have been dealing with an uncertain world, challenges, supply chain breakdowns, not merely disruptions... You remember the issue the automobile sector faced (with chip shortages). These are the kinds of issues we have been dealing with for three budgets. So I didnt require the economic survey to tell me that Very difficult to say. With the benefit of time... I didnt have that benefit then. What are the lessons learnt? Each challenge was unique. I hope we never see a situation such as Covid again, but with the grace of God and the fortitude of our PM, we negotiated it. We have not touched all STTs, just futures and options. The number of people who have called us to say My son is earning well, but he is losing all his money on derivatives. Cant you do something?.",
  "metadata": {
    "title": "Budget 2026 to benefit common man, US deal a big relief to Indian exporters, says Sitharaman | Exclusive| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:19.982541"
  }
}