{
  "url": "https://www.hindustantimes.com/india-news/air-india-tests-found-fuel-switches-work-if-procedure-followed-dgca-101770146172333.html",
  "structured_text": "TITLE: Air India tests found fuel switches work if procedure followed: DGCA| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nTests by Air Indias engineers on the fuel switches of a Boeing 787 Dreamliner, which was grounded after its pilot reported a possible issue with one of them, found the components were working within satisfactory parameters when operated according to the procedure recommended by the aircrafts manufacturer, the aviation regulator said on Monday. The Directorate General of Civil Aviation (DGCA) in a statement said it had advised Air India to educate its crew on the procedure recommended by Boeing for operating the switches, which control the flow of fuel to the planes engines.These components were at the centre of the investigation into the crash of another Air India Dreamliner in Ahmedadabad last June, in 260 people were killed, after a preliminary report found that its fuel switches were in the cutoff position. The final report is still pending. The fuel control switches -- there are two on a Dreamliner, one for each engine-- alternate between two positions, run and cutoff, and have a locking feature. Once it is engaged, the pilot has to lift the switch deliberately to change its position. On Monday, after the pilot in command of Flight AI132 from London to Bengaluru had reported a possible issue with the switches, Air India referred the matter to Boeing. Based on Boeings guidance, engineers tested the pull-to-unlock force on the fuel control switch of the affected aircraft, the replacement unit, and a switch from another aircraft. All readings were found within prescribed limits, the regulator said, adding that the inspections were conducted in the presence of DGCA officials. As per Air India engineering Both left and right switches were checked and found satisfactory, with the locking tooth/pawl fully seated and not slipping from RUN to CUTOFF. When full force was applied parallel to the base plate, the switch remained secure, the regulator said. However, the regulator warned the tests found that applying external force in an incorrect direction caused the switch to move easily from RUN to CUTOFF, due to the angular base plate allowing slip when pressed improperly with finger or thumb. The DGCAs statement also clarified the sequence of events that led to the pilot to flag the issue on Monday. During engine start in London, on two occasions, the crew observed that the fuel control switch did not remain positively latched in the RUN position when light vertical pressure was applied. On the third attempt, the switch latched correctly in RUN and subsequently remained stable. Before continuing with the rest of procedure, a physical verification was performed by the crew to confirm that the switch was fully and positively latched in the RUN position. DGCA said the crew did not observe any abnormal engine parameters, cautions, warnings, or related system messages during engine start or at any time thereafter. The DGCA said that the operating crew member was briefed on the observation. Unnecessary contact with the switch was avoided, and engine indications and alerting systems were closely monitored by the crew for the remainder of the flight. The flight was completed without incident,the civil aviation watchdog said. However, after landing at Bangalore, the pilot reported the defect in the pilot defect report (PDR). The log read- A/C (aircrfat) is veering to left..LEFT FUEL CONTROL SWITCH slips from RUN to CUT OFF when pushed down slightly , it does not lock in its position... The airline, which has 33 Boeing 787 aircraft in its fleet, has ordered a precautionary fleet-wide re-inspection of the fuel control switch latch. These switches were earlier inspected on DGCA orders after the preliminary report into the Ahmedabad crash was released in July. To date, no adverse findings have been reported on the aircraft for which this re-inspection is completed. We would also like to remind all crew to promptly report any defects observed during operations and to ensure that all required actions are completed prior to accepting the aircraft, an internal communication to pilots operating 787s read. Airline officials said the fuel control switch unit from the grounded aircraft, with the tail number VTN-ANX, is likely to be flown to a Boeing facility for detailed analysis.",
  "metadata": {
    "title": "Air India tests found fuel switches work if procedure followed: DGCA| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:18.242227"
  }
}