{
  "url": "https://www.hindustantimes.com/india-news/india-free-to-buy-oil-from-any-supplier-russian-official-on-trumps-claim-101770218801201.html",
  "structured_text": "TITLE: India free to buy oil from any supplier: Russian official on Trump's claim| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nTwo days after American President Donald Trump announced a new India-US trade deal with a claim that New Delhi would stop buying Russian oil, Russia has said New Delhi is free to buy oil from any country. Russia's Press Secretary Dmitry Peskov said Russia is not the only supplier of oil and petroleum products to India, adding New Delhi has purchased oil from other countries. \"We, along with all other international energy experts, are well aware that Russia is not the only supplier of oil and petroleum products to India. India has always purchased these products from other countries. Therefore, we see nothing new here,\" Dmitry Peskov said, according to PTI. Also Read: Has India agreed to zero tariff on American goods? Questions cloud Trump-Modi deal amid tall claims, little detail The remarks of the Kremlin spokesperson comes in response to a question on Trump's claim that Prime Minister Narendra Modi had agreed to stop buying Russian oil and switch to purchasing it from the United States. On Tuesday, Peskov said Russia hasn't heard anything from New Delhi on the issue. He added that Russia values its relationship with India and would continue to develop its strategic partnership. US President Donald Trump announced the new trade deal with Washington and New Delhi on Monday, which includes a lower reciprocal tariffs for India and claimed that New Delhi would halt purchases of Russian oil and increase imports of American goods. India has confirmed the reduction in the tariffs, however there is no official word on halting the imports of Russian oil. Trump and PM Modi made the announcement on the trade deal after a phone call on Monday. PM Modi said Indian goods will now face a reduced US tariff of 18% following his phone call with Trump. India earlier faced a higher reciprocal tariff of 25% and an additional penalty of 25%. Also Read: After Trump claims India will stop buying Russian oil, Kremlin responds Wonderful to speak with my dear friend President Trump today. Delighted that Made in India products will now have a reduced tariff of 18%. Big thanks to President Trump on behalf of the 1.4 billion people of India for this wonderful announcement,\" PM Modi said in the social media post. While PM Modi's post mentions of the reduced tariff, it did not mention a trade deal or commitments related to Russian oil purchases. Kommersant FM, a prominent Russian radio channel, noted that, unlike President Trump, PM Modi did not mention any agreement on halting Russian oil imports. A leading Russian expert has also suggested that Indian refiners cannot fully stop the import of Russian crude, adding that India imports 1.5 million to 2 million barrels per day from Russia. \"The American shale oil they export is light grades, similar to gas condensate. Russia, on the other hand, supplies relatively heavy, sulfur-rich Urals. This means India will need to blend US crude with other grades, which incurs additional costs, meaning a simple substitution won't be possible,\" Igor Yushkov, a leading expert at the National Energy Security Fund, said, according to PTI. \"Russia typically exports 1.5 million to 2 million barrels per day to the country. America won't be able to cover that volume. So, one gets the sense that Trump is simply trying to show that he won these trade negotiations and the deal was concluded entirely in line with US demands,\" he added.",
  "metadata": {
    "title": "India free to buy oil from any supplier: Russian official on Trump's claim| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:33.838403"
  }
}