{
  "url": "https://www.hindustantimes.com/india-news/over-500-flights-and-50-trains-delayed-as-dense-fog-grips-delhi-for-9-hours-101770162925698.html",
  "structured_text": "TITLE: Over 500 flights and 50 trains delayed as dense fog grips Delhi for 9 hours| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nDense fog for nearly nine hours in the early hours of Tuesday reduced visibility to as low as 50 metres in parts of the national capital, impacting both flight and rail operations. Experts said the fog was due to the moisture from the last western disturbance, the impact of which will be over by Wednesday. The lowest visibility recorded in the city was at Safdarjung at 50 metres, followed by 100 metres at Palam.Visibility began dipping rapidly on Monday night itself and by 11:30 pm, had already touched 100 metres. It remained in this range till 8:30 am on Tuesday, said an IMD official The IMD classifies fog as shallow if visibility is between 1,000-500 metres; moderate between 500 and 200 m; dense between 199 and 50 m; and very dense below 50 m. While no flights at Delhis Indira Gandhi International (IGI) airport had been cancelled or diverted, the flight tracking website FlightRadar24 showed there were over 500 flights delayed through the day, primarily departures. The average delay time was around 30 minutes. Over 50 trains to and from the Capital were also delayed in the early hours of the day. The India Meteorological Department (IMD)said fog intensity is likely to reduce in the coming days and a fresh western disturbance is expected to influence the region from February 5, raising surface wind speeds. So far, there is likelihood of cloudiness and surface winds of 20-30 km/hr on February 6 and 7, the official said, stating only shallow to moderate fog is now likely on Wednesday, adding that there were lower chances of any rain in the city during the next western disturbance. On Tuesday, Delhis minimum temperature stood at 9.4C a degree above normal. It was 10.4C on Monday. Fog gave way to bright sunshine around 10 am, making for a comparatively warm day as compared to a day earlier. The maximum temperature was 17.5C on Monday five degrees below normal for this time of the year. It is forecast to remain between 21-23C till Friday before rising by another 1-2C by Sunday. Meanwhile, Delhis air quality, which was briefly in the moderate category on Monday morning, continued to rise and was in the higher end of the poor category. The 24 hour average air quality index (AQI) stood at 272 at 4 pm on Tuesday up from a reading of 210 at 4 pm on Monday. Forecasts show the AQI is expected to improve to moderate again by February 5, as wind speeds improve again. The Central Pollution Control Board (CPCB) classifies air quality as moderate when the AQI is between 101 and 200, poor between 201 and 300, and very poor between 301 and 400. Beyond 400, air quality is termed severe. Delhis air quality is likely to be in the poor category from February 3 and 4. The air quality is likely to be in the moderate category from February 5 till 6, said the Centres Air Quality Early Warning System (EWS) for Delhi on Monday.",
  "metadata": {
    "title": "Over 500 flights and 50 trains delayed as dense fog grips Delhi for 9 hours| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:21.094057"
  }
}