{
  "url": "https://www.hindustantimes.com/india-news/he-has-no-right-to-comment-sharad-pawar-snubs-fadnavis-over-ncp-merger-claim-days-after-ajit-pawars-death-101770183983745.html",
  "structured_text": "TITLE: Sharad Pawar's salvo against Fadnavis amid NCP merger row: 'He has no right'| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nAlmost a week after Ajit Pawar's death in a fatal plane crash shook the political landscape of Maharashtra, the merger of two Nationalist Congress Party (NCP) factions one led by Sharad Pawar and another led by his nephew Ajit has emerged to be a flashpoint as the NCP (Sharadchandra Pawar) chief snubbed Maharashtra chief minister Devendra Fadnavis over his merger claims. Track Mamata SIR hearing updates Sharad said that the merger talks were held between Ajit and Jayant Patil and not with Fadnavis, who earlier said that Ajit would have shared the merger talks with him if it was really happening. Also read: Literal parking lot: Commuters fume over 7-hour-long Mumbai-Pune traffic jam Sharad was speaking to reporters in Baramati on Wednesday where said said NCP (SP) leader Jayant Patil and his nephew and NCP chief Ajit had been leading the merger talks. I do not understand, what right he has to mention my name? As he was nowhere in the merger talks, he has no right to comment on it,\" NCP(SP) chief said, as he also expressed happiness over Sunetra Pawar being sworn in as deputy chief minister. Sunetra Pawar, NCP leader and widow of the late Ajit Pawar, stepped into fill the post that became vacant following his demise. Also read: Charlie Kirk murder: Defense objects to showing shooting videos, claims bias \"At present, our entire focus is on taking care of everyone and moving forward together with those who are grieving. As of now, there is no discussion at all about any political decisions,\" he said. Pawar also said he could not attend Parliament on Budget Day for the first time in 58 years due to a family incident and expressed concern that the Union Budget may create difficulties for common people. \"Whether it is the Maharashtra Legislative Assembly or the Lok Sabha of the country, I have been a member for the past 58 years. In all these 58 years, I have never been absent from Parliament on Budget Day. Unfortunately, due to an incident in my family, I could not be present in Parliament on the day of the Budget this time,\" Pawar said. Also read: Drone shot down, Tehran demands to shift talks venue: Latest on Iran-US tensions NCP chief and deputy chief minister Ajit Pawar died in a fatal air crash in Baramati on January 28. The sudden death left a political vacuum in Maharashtra's politics where he was revered figure and known as dada (elder brother). Four other people, including his security officer and plane crew, also died in the crash. With inputs from Yogesh Joshi",
  "metadata": {
    "title": "Sharad Pawar's salvo against Fadnavis amid NCP merger row: 'He has no right'| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:26.988959"
  }
}