{
  "url": "https://www.hindustantimes.com/india-news/exchhattisgarh-minister-gets-supreme-court-bail-in-liquor-scam-101770145754820.html",
  "structured_text": "TITLE: Ex-Chhattisgarh minister gets Supreme Court bail in liquor scam| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nThe Supreme Court on Tuesday granted interim bail to Chhattisgarh legislator and former excise minister Kawasi Lakhma in the multi-crore state liquor scam, imposing stringent conditions, including requiring him to remain outside the state and enter only for the purpose of attending trial. A bench headed by Chief Justice of India (CJI) Surya Kant passed the order considering several facts, including the continuing probe against him by the state anti-corruption bureau (ACB) and the Enforcement Directorate (ED), his year-long incarceration since January 15, 2025 and the possibility of the trial not beginning soon. Lakhma, 67, is currently a sitting member of the Chhattisgarh legislative assembly and sought parity on the ground that 19 of the 22 people arrested in the liquor scam are out on bail. The bench, also comprising justices Joymalya Bagchi and Vipul M Pancholi, said, In order to balance the competing claims of the prosecution to have an uninterrupted, free and fair right to proceed with ongoing investigation and the right of accused to plead liberty with a view to strike a balance between the two.petitioner is directed to be released on interim bail in both cases registered by the ED and the ACB. Leaving it to the trial court to fix bail conditions and bail bonds, the court imposed conditions restraining his movement. It is directed that the petitioner shall not stay in Chhattisgarh, except for attending the court for which he will arrive a day before. He was further directed to deposit his passport with the trial court hearing the ED case with an express ban on travelling abroad. During his stay outside the state, his contact number and particulars of place of residence will be shared with the jurisdictional police station and he was directed to furnish his mobile phone number with the police and ED with a rider that the prior permission of the trial court will be necessary before changing the number. The court further gagged him from making any statement which is subject matter of investigation or is under consideration before the trial court. However, this bar will not apply on taking any ground of challenge before any judicial forum. While it was suggested to the court by the petitioners to fix timelines for the investigation to complete, the bench was not in favour of issuing such a direction stating that specialised agencies need to be given a free hand in carrying out probe. It said, Any direction by us to conclude the investigation in a matter having complex, complicated questions involving several persons can have cascading and adverse impact on the prosecution case. In such matters, especially when different specialised agencies are probing within their specialised domain, the prosecution ought to be given a free hand to complete the investigation. Lakhmas legal team led by senior advocates Mukul Rohatgi and Siddharth Dave along with advocate Mayank Jain pointed out that the petitioner is a sitting MLA and he should be permitted to attend the Assembly to discharge his legislative duties. The order said, As regards his participation in the legislative assembly during the period when charge sheet is filed or the court takes cognisance against him, an appropriate decision shall be taken by the Speaker of the Assembly. We do not express any opinion on it. The order further stated that he will not be allowed to seek personal exemption from trial except on health grounds. Additional solicitor general (ASG) SV Raju appearing for ED along with senior advocate Mahesh Jethmalani appearing for Chhattisgarh along with advocate Ravi Sharma opposed bail pointing out that during his role as excise minister in the state from 2019-21, he not only facilitated the liquor syndicate by tailoring policies to facilitate the illegal business, he even pocketed commissions to create assets. The ED claimed that the assets attached as proceeds of crime are worth 72 crore. Jethmalani, on the other hand, alleged that his personal staff have testified that he received 2 crore commission per month for facilitating the liquor scam which is estimated to have resulted in a loss of over 2500 crore to the state exchequer. However, the bench noted that the state has to examine more than 800 witnesses and this exercise will take considerable time. Lakhma was arrested in the ED case in January 2025. Later he was also taken into custody by the ACB of the state in April 2025 for offences under cheating, forgery and criminal conspiracy under the Indian Penal Code, besides the offence of amassing disproportionate assets under sections 7 and 12 of the Prevention of Corruption Act. As per the ED, Lakhma was instrumental in aiding the scam orchestrated by a syndicate operated by retired IAS officer Anil Tuteja, businessman Anwar Dhebar, state excise official Arun Pati Tripathi among others. Being the excise minister, he was also accused of posting officers at designated locations to help the operations of the syndicate.",
  "metadata": {
    "title": "Ex-Chhattisgarh minister gets Supreme Court bail in liquor scam| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:18.874451"
  }
}