{
  "url": "https://www.hindustantimes.com/india-news/17th-edition-of-india-art-fair-puts-spotlight-on-emerging-practices-response-to-evolution-of-region-s-art-landscape-101770166292171.html",
  "structured_text": "TITLE: 17th edition of India Art Fair puts spotlight on emerging practices: Response to evolution of regions art landscape| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nAt the Triveni Kala Sangam in central Delhi, sculptures and installations are visible, but when you enter the room, its quite likely that you will trip. As your eyes adjust to the dim light, you realise that the smooth floor of the once pristine white cube has been transformed into an uneven one made of exposed brick, gray sand and wooden platforms. Also read: US House passes $1.2 trillion spending package, ending 4-day government shutdown I want the viewer to be uncomfortable, said curator Wribhu Borphukon, who has been in charge of the India Art Fairs ambitious Young Collectors Programme (YCP) for the past three editions. The YCPs mandate is to bring lesser-known contemporary artists to the attention of the art-going public. It is also to bring new collectors into the mix. With works priced between 20,000 and 26 lakh, the YCP is the IAFs investment in the future of Indian art. With no pressure to make profit or sales, it is also its most ambitious gamble, and much like this exhibit, it offers room to stumble. Also read: PM Modi hails US, EU trade deals at NDA meeting: World tilting towards India Back at Triveni, the design of this specific exhibit, titled Omens, Organisms, Objects, Order, is intentionally futuristic. Parag Tandels Worli Koliwada is a series of cyanotype prints that take off from traditional Koli recipes (davla and dried Shrimp, umbar and eggplant curry, roasted Bombay duck and potatoes curry), a nod to the artists own fishing community ethnicity. Deepak Kumars Neglected Reality is an installation of drawings, found objects and metal sculptures that use the metaphor of detritus (tiny bird skeletons, an emptied nest, bones) to show his preoccupation with the passage of time. Berlin-based Sam Madhus digital installation the highest priced among this lot at 26 lakh including the screens combines cyberpunk aesthetic with an Eastern symbology. The exhibition considers the idea of collecting in the future, with some pieces specifically made for this concept, Borphukon said. Also read: India-US trade deal protects dairy, key agriculture products; no duty for $40 billion exports Triveni isnt the only one of the many sites where the India Art Fair has extended its programme. The YCP has also teamed up with the Fashion Design Council of India, roping in independent curator Sreyansi Singh who has put together an exhibition titled Disobedient Objects: The Biography of Clothes for the YCP. The exhibition opened earlier this week at STIR art gallery in DLF Chattarpur Farms, and shows clothes-making as a methodology in contemporary art. These works show contemporary art practices that engage critically with textiles, drawing our attention to material, process and labour, Singh said. In the press of foundation and gallery-represented artists at the fair, emerging practices that are experimental and new need a place of their own. The 17th edition, which opens on February 5 and continues over the weekend, will host 135 exhibitors, including 27 first-time participants. The numbers rise each year 15 more than last year, 50 more than even three years ago. Of the 105 national and 30 international participants this year, at least 22 are foundations and 14 are design studios. The expansion in the 17th edition reflects a measured and strategic response to the evolution of the regions art landscape, said fair director Jaya Asokan. Besides the exhibition booths, the fair will also offer talks, panel discussions and guided tours in multiple languages.",
  "metadata": {
    "title": "17th edition of India Art Fair puts spotlight on emerging practices: Response to evolution of regions art landscape| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:21.829070"
  }
}