{
  "url": "https://www.hindustantimes.com/india-news/rahul-gandhi-flashes-printed-copy-of-ex-army-chief-s-naravane-unpublished-book-four-stars-of-destiny-at-parliament-101770201604677.html",
  "structured_text": "TITLE: Heres what Gen Naravane wrote on PM: Rahul flashes copy of ex-army chiefs book that govt said doesnt exist'| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nRahul Gandhi held up a book on Parliament premises today as he doubled down on his claim that the Modi government mishandled the border dispute with China. This is the same book that Leader of Opposition Gandhi wanted to cite in the Lok Sabha, but was stopped as it is not published yet. He asserted that he was only quoting from a magazine article that carried excerpts from this book. But he could not, as the Lok Sabha speaker and the ruling BJP-led NDA cited rules against such quoting. On Wednesday, on the third consecutive day of the controversy, he brought a printed version of the book which is currently pending for approval with the Ministry of Defence to the Parliament premises, and flashed it to cameras. Former Chief of Army Staff (COAS) General MM Naravane's autobiography or memoir, 'Four Stars of Destiny', is not available for purchase as it needed government approval thats not yet been granted. Defence minister Rajnath Singh has asserted in the Lok Sabha, I am confident, this book has never been published. Also Read: Between publisher and MoD: What General MM Naravane said on his book at nub of Rahul Gandhi vs BJP in LS That did not stop Rahul Gandhi from creating a dramatic moment on Wednesday, with a copy in hand. See, it exists the book the government says does not, he said. In a video posted on his X handle, he further said, I don't think PM (Narendra Modi) will have the guts to come to the Lok Sabha today, because if he comes I'm going to give him this book. So, if the PM comes, I will go physically and hand him this book. Gen Naravane has not spoken on the matter so far, though he has in the past confirmed that the book is pending for MoD approval. Rahul Gandhi claimed the former army chief wrote that when he informed Rajnath Singh and other leaders, including NSA Ajit Doval, about Chinese tanks approaching, he got no direct reply for a long time. And then he writes that the PMs message conveyed to him was, Jo uchit samjho, woh karo (Do what you think is right)... This means Narendra Modi ji did not fulfil his responsibility; effectively telling the army chief to handle it as he could not decide, the Congress leader said, speaking in Hindi. Also Read | Rahul Gandhi calls Bittu traitor, BJP cries anti-Sikh bias, cites Operation Bluestar, turban in attack Naravane ji has clearly said in this, that he felt alone and was abandoned by the entire establishment, Rahul Gandhi further claimed. This is the very truth that I am being stopped from speaking in Parliament. The country is asking questions, and the government is running away from answering,\" Rahul Gandhi wrote on X. Gandhis insistence on quoting a part about the 2020 border tensions with China from the unpublished book, via excerpts mentioned in The Caravan magazine, led to a government uproar. This has stalled the Lok Sabha since Monday, February 2, when Parliament took up for discussion the Motion of Thanks to the Presidential Address for the Budget Session. Rajnath Singh and others allegedly named in the book have not responded to the express allegations about their handling of the Galwan clash and other India-China border issues. Earlier, Rajnath and other leaders asserted in the Lok Sabha that quoting from a book thats not been published is not just against Parliaments rules but also against national interest and harms national security. Rajnath argued with full confidence in the Lok Sabha on Monday as Rahul Gandhi held up a printout of the article citing the book that the alleged points made in the unpublished book are not correct, which is why it is held up. He asked rhetorically why the writer of the claimed book (Gen Naravane) did not go to court over the pending approval if the facts in it are right. Home minister Amit Shah and other BJP MPs also repeatedly said the book was never published. Speaker Om Birla agreed with their contention. (Rahul Gandhi) should present the book that he is claiming to quote from. I want to see it; this House wants to see it, Rajnath Singh said on Monday. This line of argument continued on Tuesday. For a third day, on Wednesday, the Lok Sabha was adjourned again amid sloganeering by Opposition members over the suspension of eight MPs during the previous day's Budget Session sitting. The members were suspended for the remainder of the session over \"throwing papers at the Chair\" following the uproar over Rahul Gandhi's insistence on mentioning the reference to the 2020 standoff with China in eastern Ladakh. Rahul Gandhi may have held up a printed copy but General Manoj Mukund Naravane's memoir 'Four Stars of Destiny' has indeed never been available for the public to buy or access. It was supposed to be published in April 2024, as per pre-order announcements made in late 2023 by the publisher, Penguin. Amazon still has a listing that says in the price section: Currently unavailable. We don't know when or if this item will be back in stock. The former army chief was asked about this book in October 2025 at a literature festival in Kasauli, Himachal Pradesh, where was in a session on his recently published fiction, 'The Cantonment Conspiracy'. I just want to ask you, why your first book was not cleared and published, an audience member said during the livecast session. Even I want to know that, Gen Naravane said. No, no, surely you must be knowing something, the audience member insisted. My job was to write the book and give it to the publishers. It is for the publishers to get permission from the MoD (Ministry of Defence). They have given it to them, and it is still under review, he said. Also Read | When Gen Naravane explained why he wrote memoir 4 Stars of Destiny, now at centre of Rahul-BJP row over Galwan He added that its been under review for more than a year now, as of October 2025. So it's not for me, it's beyond; not for me to actually follow up, Gen Naravane added, The ball is in the publishers and the MoDs court. But I enjoyed writing the book, for better or for worse, and that's that It is for the MoD to give permission as and when they deem fit. It is considered standard practice for books by former senior military officials to undergo scrutiny to check for sensitive material, but General Naravanes book drew controversy for reportedly revealing discussions on issues such as the Agnipath scheme and the Galwan clash in which 20 Indian soldiers were killed in a fight with the Chinese. Also Read: Who is Manoj Mukund Naravane? Ex-Indian Army chief at the centre of Rahul Gandhi vs Modi Government in Lok Sabha Gen MM Naravane served as Indias Chief of Army Staff from December 2019 to April 2022. Its Amazon and Flipkart listings say it has 448 pages. The description reads: \"From his first encounter with the Chinese as a young officer in Sikkim to dealing with them in Galwan when he was Chief, from daily incidents of firing across the LC to implementing a ceasefire with Pakistan, General Naravane takes us through his distinguished career spanning over four decades that saw him serve in all corners of the country.\" As for Naravane's other book, military thriller The Cantonment Conspiracy, that was published in March 2025. This fictional account has two officers at a defence academy investigating a case of assault and murder in a garrison.",
  "metadata": {
    "title": "Heres what Gen Naravane wrote on PM: Rahul flashes copy of ex-army chiefs book that govt said doesnt exist'| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:31.412035"
  }
}