{
  "url": "https://www.hindustantimes.com/india-news/six-held-for-duping-real-estate-developer-of-rs-3-7-crore-in-online-stock-market-investment-scam-101770199598952.html",
  "structured_text": "TITLE: Six held for duping real estate developer of 3.7 crore in online stock market investment scam| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nNew Delhi, Six people have been arrested from multiple states for allegedly duping a real estate developer of over 3.7 crore on the pretext of providing high returns through online stock market investments, police said on Wednesday. The racket was being orchestrated by cybercriminals operating from abroad, while the arrested individuals managed mule bank accounts and handled the routing of cheated money within India, they said. The accused were apprehended during multi-state coordinated raids conducted in Mumbai, Kota , Noida and Lucknow, with authorities recovering nine mobile phones used in the crime, they said. The case came to light after a complaint was filed by Krishan Kumar, a real estate developer, who alleged that he was duped of approximately 3.76 crore under the guise of assured high returns from online stock market investments. When the returns failed to materialise, and the investment platform turned out to be a scam, he approached the police. An e-FIR was registered under relevant sections of the Bharatiya Nyaya Sanhita on September 15 at the Special Cell police station, and an investigation was initiated. During the investigation, police analysed bank account details and found that 10 lakh from the cheated amount had been credited into a first-layer mule account in the name of Siblu Kumar, a resident of Navi Mumbai. Following technical surveillance, Siblu Kumar was traced and arrested in Kota. Based on his disclosures, police tracked another accused, Wasim Ahmad of Moradabad, to Delhi's Jangpura area. A raid at a house in Masjid Lane led to his arrest along with three associates Rajesh Khan, Sahid Ali and Mannu Issar. Another accused, Manish Kumar from Dwarka, who was found managing fraudulent proceeds and arranging mule accounts, was also arrested, the police said. According to police, all accused were primarily engaged in procuring and operating mule bank accounts, arranging SIM cards and mobile phones, and facilitating fund transfers to conceal the money trail. Forensic analysis of the suspects' devices reportedly revealed details of multiple bank accounts and digital evidence linking them to cyber fraud. The police said the operation exposed a well-organised network using fake investment platforms and advanced digital tools to target victims. Further investigation is underway to trace the complete money trail and identify other conspirators and facilitators involved in the racket, they added. This article was generated from an automated news agency feed without modifications to text.",
  "metadata": {
    "title": "Six held for duping real estate developer of 3.7 crore in online stock market investment scam| India News",
    "date": null,
    "source": "www.hindustantimes.com",
    "extracted_at": "2026-02-17T16:45:28.950576"
  }
}