[
  {
    "chunk_id": "article_41_clean.json_0",
    "text": "TITLE: 'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA book by General MM Naravane, Indias former Chief of Army Staff (COAS), has dominated Parliament proceedings this week, with Leader of Opposition Rahul Gandhi being stopped from citing its contents to question PM Narendra Modi and his government over their China policy.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_1",
    "text": "TITLE: 'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA book by General MM Naravane, Indias former Chief of Army Staff (COAS), has dominated Parliament proceedings this week, with Leader of Opposition Rahul Gandhi being stopped from citing its contents to question PM Narendra Modi and his government over their China policy. Its not published, so cant be cited, according to Rajnath Singh, who heads the defence ministry where its reportedly pending for approval since 2023.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [
        "defence"
      ],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_2",
    "text": "TITLE: 'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA book by General MM Naravane, Indias former Chief of Army Staff (COAS), has dominated Parliament proceedings this week, with Leader of Opposition Rahul Gandhi being stopped from citing its contents to question PM Narendra Modi and his government over their China policy. Its not published, so cant be cited, according to Rajnath Singh, who heads the defence ministry where its reportedly pending for approval since 2023. General Naravane has not spoken amidst this row.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [
        "Defence Ministry"
      ],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_3",
    "text": "TITLE: 'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News\nDATE: None\nSOURCE: www.hindustantimes.com\n\nCONTENT:\nA book by General MM Naravane, Indias former Chief of Army Staff (COAS), has dominated Parliament proceedings this week, with Leader of Opposition Rahul Gandhi being stopped from citing its contents to question PM Narendra Modi and his government over their China policy. Its not published, so cant be cited, according to Rajnath Singh, who heads the defence ministry where its reportedly pending for approval since 2023. General Naravane has not spoken amidst this row. But he has spoken before about the book, Four Stars of Destiny, and lamented the ongoing delay in approval.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_4",
    "text": "Its not published, so cant be cited, according to Rajnath Singh, who heads the defence ministry where its reportedly pending for approval since 2023. General Naravane has not spoken amidst this row. But he has spoken before about the book, Four Stars of Destiny, and lamented the ongoing delay in approval. He has also shared how he decided to write it at all. There is a story behind writing this book.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_5",
    "text": "But he has spoken before about the book, Four Stars of Destiny, and lamented the ongoing delay in approval. He has also shared how he decided to write it at all. There is a story behind writing this book. I had no intention of writing a memoir or an autobiography, he told web channel Lallantop in an interview in April 2025, a year after the book was originally supposed to be published. Penguin (publishing house) had published a book on the late General Bipin Rawat.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_6",
    "text": "There is a story behind writing this book. I had no intention of writing a memoir or an autobiography, he told web channel Lallantop in an interview in April 2025, a year after the book was originally supposed to be published. Penguin (publishing house) had published a book on the late General Bipin Rawat. I went to its book release in March 2023. People who had come from Penguin, jokingly I told them that you aren't publishing a book of mine. In response, they asked, Have you written a book?",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_7",
    "text": "I went to its book release in March 2023. People who had come from Penguin, jokingly I told them that you aren't publishing a book of mine. In response, they asked, Have you written a book? I said no, he recalled. I told them, If you say so, I will write it, to which they said, Yes sir, it will be a matter of pride if you give us this opportunity to publish your book, the retired officer said. And like that, by the way, this process started for me to write a book.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [
        "Penguin"
      ],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_8",
    "text": "I said no, he recalled. I told them, If you say so, I will write it, to which they said, Yes sir, it will be a matter of pride if you give us this opportunity to publish your book, the retired officer said. And like that, by the way, this process started for me to write a book. He said the satisfaction he has got by writing the book is enough.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [
        "Publishing"
      ],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_9",
    "text": "I told them, If you say so, I will write it, to which they said, Yes sir, it will be a matter of pride if you give us this opportunity to publish your book, the retired officer said. And like that, by the way, this process started for me to write a book. He said the satisfaction he has got by writing the book is enough. At a literary festival in the hill station of Kasauli six months later, in October 2025, Gen Naravane again said he had done his job by writing, and now it is between the publisher and the Ministry of Defence.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_10",
    "text": "And like that, by the way, this process started for me to write a book. He said the satisfaction he has got by writing the book is enough. At a literary festival in the hill station of Kasauli six months later, in October 2025, Gen Naravane again said he had done his job by writing, and now it is between the publisher and the Ministry of Defence. In the earlier interview, though, he also expressed disappointment at the delay, when asked about books by former top army officers being stopped or halted.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_11",
    "text": "He said the satisfaction he has got by writing the book is enough. At a literary festival in the hill station of Kasauli six months later, in October 2025, Gen Naravane again said he had done his job by writing, and now it is between the publisher and the Ministry of Defence. In the earlier interview, though, he also expressed disappointment at the delay, when asked about books by former top army officers being stopped or halted. Everyone has a span of information control.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_12",
    "text": "At a literary festival in the hill station of Kasauli six months later, in October 2025, Gen Naravane again said he had done his job by writing, and now it is between the publisher and the Ministry of Defence. In the earlier interview, though, he also expressed disappointment at the delay, when asked about books by former top army officers being stopped or halted. Everyone has a span of information control. Being in the position of Army Chief, you would know about your service, but (not) how it impacts other ministries, foreign relations with different countries...",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [
        "defence"
      ],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_13",
    "text": "In the earlier interview, though, he also expressed disappointment at the delay, when asked about books by former top army officers being stopped or halted. Everyone has a span of information control. Being in the position of Army Chief, you would know about your service, but (not) how it impacts other ministries, foreign relations with different countries... Therefore, when a book is written, if a review is needed, then perhaps it is a necessity so that, from the perspective of the country's overall national security, there isn't something in it that spoils our relations with other countries, he argued.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_14",
    "text": "Everyone has a span of information control. Being in the position of Army Chief, you would know about your service, but (not) how it impacts other ministries, foreign relations with different countries... Therefore, when a book is written, if a review is needed, then perhaps it is a necessity so that, from the perspective of the country's overall national security, there isn't something in it that spoils our relations with other countries, he argued. There is nothing wrong with a review; it must happen so that some point does not come out inadvertently, he said, but added, However, it would be better if there were a fixed time limit; it shouldn't take 15 months to review any one book.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_15",
    "text": "Being in the position of Army Chief, you would know about your service, but (not) how it impacts other ministries, foreign relations with different countries... Therefore, when a book is written, if a review is needed, then perhaps it is a necessity so that, from the perspective of the country's overall national security, there isn't something in it that spoils our relations with other countries, he argued. There is nothing wrong with a review; it must happen so that some point does not come out inadvertently, he said, but added, However, it would be better if there were a fixed time limit; it shouldn't take 15 months to review any one book. In Kasauli later, he was reportedly more poetic as he remarked, I think it is maturing, like aged wine.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_16",
    "text": "Therefore, when a book is written, if a review is needed, then perhaps it is a necessity so that, from the perspective of the country's overall national security, there isn't something in it that spoils our relations with other countries, he argued. There is nothing wrong with a review; it must happen so that some point does not come out inadvertently, he said, but added, However, it would be better if there were a fixed time limit; it shouldn't take 15 months to review any one book. In Kasauli later, he was reportedly more poetic as he remarked, I think it is maturing, like aged wine. The longer its there, it becomes more and more vintage; of greater value.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [
        "BSE"
      ],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_17",
    "text": "There is nothing wrong with a review; it must happen so that some point does not come out inadvertently, he said, but added, However, it would be better if there were a fixed time limit; it shouldn't take 15 months to review any one book. In Kasauli later, he was reportedly more poetic as he remarked, I think it is maturing, like aged wine. The longer its there, it becomes more and more vintage; of greater value. Four months on, the unpublished book entered national consciousness as Rahul Gandhi brought to the Lok Sabha an article in The Caravan magazine that quotes the books excerpts.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_18",
    "text": "In Kasauli later, he was reportedly more poetic as he remarked, I think it is maturing, like aged wine. The longer its there, it becomes more and more vintage; of greater value. Four months on, the unpublished book entered national consciousness as Rahul Gandhi brought to the Lok Sabha an article in The Caravan magazine that quotes the books excerpts. Gen Naravane has not disputed the excerpts.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_19",
    "text": "The longer its there, it becomes more and more vintage; of greater value. Four months on, the unpublished book entered national consciousness as Rahul Gandhi brought to the Lok Sabha an article in The Caravan magazine that quotes the books excerpts. Gen Naravane has not disputed the excerpts. Defence minister Rajnath Singh has, however, said that the book is held up because its contents are not factually correct, arguing why General Naravane has not gone to court if the facts in the book are correct.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_20",
    "text": "Four months on, the unpublished book entered national consciousness as Rahul Gandhi brought to the Lok Sabha an article in The Caravan magazine that quotes the books excerpts. Gen Naravane has not disputed the excerpts. Defence minister Rajnath Singh has, however, said that the book is held up because its contents are not factually correct, arguing why General Naravane has not gone to court if the facts in the book are correct. A printed copy of the book made an appearance on Wednesday when Rahul Gandhi flashed it to cameras in the Parliament complex: See, it exists the book the government says does not.\"",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_21",
    "text": "Gen Naravane has not disputed the excerpts. Defence minister Rajnath Singh has, however, said that the book is held up because its contents are not factually correct, arguing why General Naravane has not gone to court if the facts in the book are correct. A printed copy of the book made an appearance on Wednesday when Rahul Gandhi flashed it to cameras in the Parliament complex: See, it exists the book the government says does not.\" The Congress top leader further said, I don't think PM (Narendra Modi) will have the guts to come to the Lok Sabha today, because if he comes I'm going to give him this book.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_22",
    "text": "Defence minister Rajnath Singh has, however, said that the book is held up because its contents are not factually correct, arguing why General Naravane has not gone to court if the facts in the book are correct. A printed copy of the book made an appearance on Wednesday when Rahul Gandhi flashed it to cameras in the Parliament complex: See, it exists the book the government says does not.\" The Congress top leader further said, I don't think PM (Narendra Modi) will have the guts to come to the Lok Sabha today, because if he comes I'm going to give him this book. Rahul Gandhi claimed the former army chief wrote that when he informed Rajnath Singh and other leaders, including NSA Ajit Doval, about Chinese tanks approaching, he got no direct reply for a long time.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_23",
    "text": "A printed copy of the book made an appearance on Wednesday when Rahul Gandhi flashed it to cameras in the Parliament complex: See, it exists the book the government says does not.\" The Congress top leader further said, I don't think PM (Narendra Modi) will have the guts to come to the Lok Sabha today, because if he comes I'm going to give him this book. Rahul Gandhi claimed the former army chief wrote that when he informed Rajnath Singh and other leaders, including NSA Ajit Doval, about Chinese tanks approaching, he got no direct reply for a long time. And then he writes that the PMs message conveyed to him was, Jo uchit samjho, woh karo (Do what you think is right)...",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_24",
    "text": "The Congress top leader further said, I don't think PM (Narendra Modi) will have the guts to come to the Lok Sabha today, because if he comes I'm going to give him this book. Rahul Gandhi claimed the former army chief wrote that when he informed Rajnath Singh and other leaders, including NSA Ajit Doval, about Chinese tanks approaching, he got no direct reply for a long time. And then he writes that the PMs message conveyed to him was, Jo uchit samjho, woh karo (Do what you think is right)... This means Narendra Modi ji did not fulfil his responsibility; effectively telling the army chief to handle it as he could not decide, the Congress leader said, speaking in Hindi.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  },
  {
    "chunk_id": "article_41_clean.json_25",
    "text": "Rahul Gandhi claimed the former army chief wrote that when he informed Rajnath Singh and other leaders, including NSA Ajit Doval, about Chinese tanks approaching, he got no direct reply for a long time. And then he writes that the PMs message conveyed to him was, Jo uchit samjho, woh karo (Do what you think is right)... This means Narendra Modi ji did not fulfil his responsibility; effectively telling the army chief to handle it as he could not decide, the Congress leader said, speaking in Hindi. Gandhis insistence on quoting a part about the 2020 border tensions with China from the unpublished book has stalled the Lok Sabha since Monday, February 2, when Parliament took up for discussion the Motion of Thanks to the Presidential Address for the Budget Session.",
    "metadata": {
      "title": "'By the way': When Gen Naravane explained why he wrote memoir Four Stars of Destiny, now at centre of Rahul-BJP row| India News",
      "date": null,
      "source": "www.hindustantimes.com",
      "extracted_at": "2026-02-17T16:45:33.090674"
    },
    "entities": {
      "companies": [],
      "indices": [],
      "sectors": [],
      "macros": []
    }
  }
]